{"Id": 1749, "PostId": 8, "Score": 0, "Text": "That'd be *cite*, not *site*.", "CreationDate": "2016-05-17T12:23:07.127", "UserId": 849}
{"Id": 1750, "PostId": 8, "Score": 0, "Text": "@TRiG, Thanks. Edited to correct.", "CreationDate": "2016-05-17T15:04:56.750", "UserId": 61}
{"Id": 1751, "PostId": 8, "Score": 0, "Text": "Arrrrrgh! You changed *both* of them!", "CreationDate": "2016-05-17T17:09:29.810", "UserId": 849}
{"Id": 1, "PostId": 16, "Score": 1, "Text": "I think migrating the best questions is a good idea.  But wouldn't we need Stack Echange resouces to do this?  @ben-collins, you work for SE right?  Any input on migrating?", "CreationDate": "2014-07-31T20:03:58.027", "UserId": 61}
{"Id": 92, "PostId": 20, "Score": 3, "Text": "Where did he mention that?", "CreationDate": "2014-08-12T12:45:51.063", "UserId": 116}
{"Id": 14, "PostId": 21, "Score": 2, "Text": "I agree and I think it is happening again. Just going through the review queue, questions are being flagged as opinion based or too broad but could have easily gathered some great answers. There is no concrete right answer for them but an answer could be given. I am noticing that a few users are closing questions generally based on the rep of the person as well. Similar questions get through if the person has contributed a bit more on the site and as soon as one person presses close, others tend to follow. Since most people come from SO I think that their moderation rules are following.", "CreationDate": "2014-08-02T03:13:50.100", "UserDisplayName": "user109"}
{"Id": 17, "PostId": 21, "Score": 1, "Text": "Honestly, we need more down votes to help *guide* the bad posts toward higher quality. It's truly a shark tank, and I'm still going to be inclined to down vote or close if it is a really lame, clearly-no-research type of question.", "CreationDate": "2014-08-02T07:56:24.573", "UserId": 43}
{"Id": 18, "PostId": 21, "Score": 3, "Text": "@jdero: I understand you at 100% but... The problem is, that people (\"askers\") come from outside, ask 1 or 2 questions without thinking about its \"quality\". Or they get some answers and they will maybe come back, or their questions will be closed as \"poor\" and they will never come back. From their point of view, theirs questions are \"important\" & \"interesting\" because it's important & interesting for them. They don't see this web as some kind of \"wiki for entrepreneurs\"... And thus, we have the \"egg/hen\" problem. Without visitors, no site development...", "CreationDate": "2014-08-02T13:32:03.087", "UserId": 31}
{"Id": 35, "PostId": 23, "Score": 0, "Text": "\"*Why isn't there more information about taxes easily available to startup founders?*\" - because tax is so complicated that it's impossible to concisely state anything correctly.", "CreationDate": "2014-08-04T15:45:51.203", "UserId": 131}
{"Id": 2, "PostId": 24, "Score": 0, "Text": "Ah, yes. I believe I have the same opinion. I still don't get why there isn't a class in standard public education dedicated to taxes (a required course for high school graduation) since we *all* pay taxes.", "CreationDate": "2014-08-01T21:01:45.077", "UserId": 43}
{"Id": 15, "PostId": 25, "Score": 0, "Text": "I can see your point, but I also see value in keeping around some more general \"beginner\" questions. While it is possible to find this information by digging through various sites, I tend to trust highly-upvoted answers on SE more than a lot of things I read on the internet. I notice the same argument a lot on StackOverflow with questions that are closed as off-topic that have tens of thousands of views, hundreds of up-votes and appear at the top of search results. Those are often quite useful, and would really prefer that they could just be tagged appropriately and kept around.", "CreationDate": "2014-08-02T03:50:55.113", "UserId": 160}
{"Id": 16, "PostId": 25, "Score": 0, "Text": "I guess what I'm really looking for is more like a wiki that is moderated in the style of the SE sites.", "CreationDate": "2014-08-02T03:53:07.537", "UserId": 160}
{"Id": 19, "PostId": 25, "Score": 0, "Text": "That information may be valuable, but like you said it's more of a wiki than Q/A. Those questions may get a bunch of views, but I don't think they're good questions", "CreationDate": "2014-08-02T16:22:03.160", "UserId": 9}
{"Id": 20, "PostId": 26, "Score": 0, "Text": "I'm curious, is there any way to manually move questions to the community-wiki status? As I've mentioned elsewhere, I think this type of question could be valuable if it was handled appropriately. Maybe it could be tagged as \"wiki\", and the normal rules for \"good\" questions could be relaxed. I suspect that having a reliable source of background information readily available and editable on the site would not only bring new users, but also serve as a springboard for more focused questions that fit the normal Q/A format.", "CreationDate": "2014-08-02T16:43:57.280", "UserId": 160}
{"Id": 21, "PostId": 26, "Score": 0, "Text": "I thought there was. It only seems to be available for answers currently. Community wiki posts are still Q/A though.", "CreationDate": "2014-08-02T16:46:26.973", "UserId": 9}
{"Id": 3, "PostId": 28, "Score": 1, "Text": "That's exactly what I mean. I see this close reason as being used for eliminating those questions that are intended to compile a list or promote a discussion.", "CreationDate": "2014-08-02T00:44:55.343", "UserId": 9}
{"Id": 6, "PostId": 28, "Score": 0, "Text": "@connor yeah I thought you were thinking the same as me from your commentary on the question that brought this up", "CreationDate": "2014-08-02T01:08:39.313", "UserId": 44}
{"Id": 4, "PostId": 29, "Score": 0, "Text": "I'm still trying to figure out how subjective is too subjective myself. On one hand we want don't want to eliminate too many questions, on the other we don't want to fall apart like the last site for having too much junk. I mean for this close reason to be just used for questions that explicitly ask to compile a list or generate a discussion. From there we can start generating a clearer picture of the line between on and off-topic, but I think these types are definite off-topic.", "CreationDate": "2014-08-02T00:48:03.480", "UserId": 9}
{"Id": 5, "PostId": 29, "Score": 1, "Text": "Building off of that I just saw this question, which I think is a great example of something that is subjective but not too much so: http://startups.stackexchange.com/questions/184/is-employee-value-derived-from-their-equity", "CreationDate": "2014-08-02T00:48:54.220", "UserId": 9}
{"Id": 7, "PostId": 29, "Score": 0, "Text": "@connor That is a good example. I think the specificity helps, too. Yeah, I'm not really trying to argue one way or the other for what \"too subjective\" means, so much as raise the matter that we, as early users, are more or less tasked with coming to a comfortable definition of what we think it should mean. But regardless of how we define it, I certainly concur that there will be times when we'll need a flag reason for this.", "CreationDate": "2014-08-02T02:23:34.983", "UserId": 59}
{"Id": 8, "PostId": 29, "Score": 0, "Text": "Cool. Now how do we get that done? Is there a way to get the attention of the community managers?", "CreationDate": "2014-08-02T02:26:56.603", "UserId": 9}
{"Id": 9, "PostId": 29, "Score": 0, "Text": "Just a thought and I'm not completely sure how strongly I believe this, but it kind of seems like subjective requests meant to \"benefit the populous\" are inappropriate, whereas more specific cases aren't. Like if someone says \"what free software is there for startups?\" that's a little too broad to be productive. But if someone says, \"I'm starting a store and I don't need anything too spectacular but I'd like to have a website, what cheap tools are there to help me with that?\" I think that could benefit from people's experience in the field.", "CreationDate": "2014-08-02T02:27:24.873", "UserId": 59}
{"Id": 10, "PostId": 29, "Score": 0, "Text": "So perhaps this flag could represent a mix of too subjective and too broad?", "CreationDate": "2014-08-02T02:27:47.117", "UserId": 59}
{"Id": 11, "PostId": 29, "Score": 0, "Text": "@connor I think through Meta posts like this. I mean, it's clearly not our position--you and me--to make these decisions. I think we just need your post here to gain some more attention, and for that we don't have many options other than to just hope more people come on this evening and vote it up.", "CreationDate": "2014-08-02T02:28:49.623", "UserId": 59}
{"Id": 12, "PostId": 29, "Score": 0, "Text": "Benefit the populous is a good point. I think the hypothetical questions that are intended to help future users make giving them a good answer impossible. Your latter version is definitely better, but I still feel it's borderline. It's tough for me to decide right now.", "CreationDate": "2014-08-02T02:31:23.297", "UserId": 9}
{"Id": 13, "PostId": 29, "Score": 0, "Text": "As I understand it, it is mostly up to us (meaning the larger community). I'm just not sure where the community managers are lurking", "CreationDate": "2014-08-02T02:32:25.497", "UserId": 9}
{"Id": 159, "PostId": 30, "Score": 0, "Text": "\"it may get out of hand\" - nice.", "CreationDate": "2014-09-13T04:43:25.373", "UserId": 551}
{"Id": 25, "PostId": 32, "Score": 1, "Text": "To expand on that, I think we should use the common english name of the country and use a shorter name when possible. For example, united-states instead of united-states-of-america and china instead of peoples-republic-of-china. As long as they're understandable, we should be ok.", "CreationDate": "2014-08-02T19:17:30.537", "UserId": 9}
{"Id": 26, "PostId": 32, "Score": 0, "Text": "@connor yeah sounds good to me.", "CreationDate": "2014-08-02T19:34:57.397", "UserId": 44}
{"Id": 31, "PostId": 33, "Score": 1, "Text": "I completely agree. I was only considering the best, canonical answers. Just to help give the site some good content.", "CreationDate": "2014-08-04T08:54:59.227", "UserId": 9}
{"Id": 24, "PostId": 34, "Score": 0, "Text": "I definitely agree that [tag:usa] should be a synonym for [tag:united-states] however there is only one of those that is the primary and that's what I'm talking about.", "CreationDate": "2014-08-02T18:11:57.820", "UserId": 44}
{"Id": 22, "PostId": 35, "Score": 1, "Text": "I agree. I'm responsible for some of those edits.", "CreationDate": "2014-08-02T16:50:24.240", "UserId": 9}
{"Id": 23, "PostId": 35, "Score": 1, "Text": "Completely agree: http://meta.startups.stackexchange.com/a/34/92", "CreationDate": "2014-08-02T17:03:21.203", "UserId": 92}
{"Id": 27, "PostId": 35, "Score": 0, "Text": "possible duplicate of [Tagging guidelines - country names](http://meta.startups.stackexchange.com/questions/31/tagging-guidelines-country-names)", "CreationDate": "2014-08-02T23:33:15.840", "UserId": 148}
{"Id": 28, "PostId": 35, "Score": 1, "Text": "@Daniel I hadn't seen that one originally, but I agree that they draw the same conclusion. However, I'm inclined to leave mine open too since that one is meant to set a standard practice and mine addresses a particular case; a single tag synonym is a very different matter than setting up a scheme of countries as tags, even if the scheme of countries would, by definition, lead to the synonym being put in place. Mine's more a short-term solution that could be implemented in seconds, compared to that which is a longer-term, systematic solution.", "CreationDate": "2014-08-03T00:21:43.473", "UserId": 59}
{"Id": 29, "PostId": 35, "Score": 0, "Text": "@MatthewHaugen I understand your reasoning and support it. I did also miss, that Awal Garg was referencing the other post too. Therefore I retracted my close vote", "CreationDate": "2014-08-03T10:57:51.743", "UserId": 148}
{"Id": 30, "PostId": 35, "Score": 0, "Text": "I fully support this - great post Matt.", "CreationDate": "2014-08-04T07:27:33.210", "UserId": 43}
{"Id": 33, "PostId": 37, "Score": 2, "Text": "There is an issue with experts in the Startup space that make me worry about the validity of this site. I already work far too much on my startup, I have staff, office, growth (getting close to a large investment round, fingers crossed) etc but I find it difficult to put in hours here. People I know that founded very well known startups, millions in funding etc, just won't have the time here, hence it seems once reaching a certain stage, there might be drop off of experienced entrepreneurs past a point. Programmers is always different because you can have superstar programmers who work 9-5", "CreationDate": "2014-08-04T14:34:48.363", "UserDisplayName": "user109"}
{"Id": 32, "PostId": 38, "Score": 0, "Text": "We have a few weeks to think about there is no guarantee that the Community Team will choose the same people we vote on but we can at least share our preferences to let them have an additional metric to make the decision on.", "CreationDate": "2014-08-04T14:07:56.667", "UserId": 44}
{"Id": 109, "PostId": 38, "Score": 0, "Text": "good luck to all candidates :) Hope we get the best of the best!", "CreationDate": "2014-08-20T06:29:30.560", "UserId": 92}
{"Id": 135, "PostId": 38, "Score": 0, "Text": "Its been quite a while, I think mods should have been announced by now.", "CreationDate": "2014-09-03T11:06:46.720", "UserId": 92}
{"Id": 136, "PostId": 38, "Score": 0, "Text": "@AwalGarg I would have thought so two - two weeks public beta now. However we have low enough activity that it isn't to bad - only benefit to our low activity which we do need to fix (questions/per day really is our only metric I don't like right now)", "CreationDate": "2014-09-03T16:59:20.543", "UserId": 44}
{"Id": 163, "PostId": 38, "Score": 0, "Text": "Vote was 7-6-6-2 at time of closing. connor, nick/jdero, matthew.", "CreationDate": "2014-09-14T07:43:04.043", "UserId": 43}
{"Id": 37, "PostId": 39, "Score": 1, "Text": "I'll second that", "CreationDate": "2014-08-04T17:27:36.340", "UserId": 7}
{"Id": 38, "PostId": 39, "Score": 3, "Text": "Thanks for the nomination, Nick. I'd definitely be willing to moderate this site. I can't edit this post to add my approval though.", "CreationDate": "2014-08-04T20:50:01.223", "UserId": 9}
{"Id": 39, "PostId": 39, "Score": 0, "Text": "@connor good luck", "CreationDate": "2014-08-04T21:59:46.050", "UserId": 217}
{"Id": 42, "PostId": 39, "Score": 0, "Text": "Connor has my vote", "CreationDate": "2014-08-05T05:26:25.637", "UserDisplayName": "user109"}
{"Id": 44, "PostId": 39, "Score": 1, "Text": "@Adam you can of course vote for multiple - most sites get 2-3 PT moderators", "CreationDate": "2014-08-05T06:14:51.043", "UserId": 44}
{"Id": 34, "PostId": 40, "Score": 4, "Text": "\"*something this community should be nothing about*\" - really?  Freelancers are one-man businesses that require financing, marketing, accounts management... if incorporated, they face the same filing and documentation challenges as any other business, they need to employ themselves (resulting in all the same employment law issues), etc.  Sure, I understand that there is a difference, but when a freelancer decides to employ his wife to do the accounts and takes on a contractor to assist with workload... doesn't it become something more? All I'm saying is that it's a grey area.", "CreationDate": "2014-08-04T15:43:21.210", "UserId": 131}
{"Id": 36, "PostId": 40, "Score": 0, "Text": "I agree that there is some significant greyness there... @Adam do you have an idea of how we can clearly and consistently categorize as one or another?", "CreationDate": "2014-08-04T15:53:38.900", "UserId": 44}
{"Id": 40, "PostId": 40, "Score": 0, "Text": "@eggyal - there is cross over but clearly any freelancing questions should be asked on http://freelancing.stackexchange.com/. As per the description of the site itself: \"Q&A site for entrepreneurs faced with delivering a new product or service under conditions of significant uncertainty\" Freelancing doesn't fall in this category. Freelancing doesn't really deliver a product or service with significant uncertainty. They get a job, deliver a product or service and get paid. Start-ups deliver a product or service, generally not widely done before with very varying returns.", "CreationDate": "2014-08-05T04:00:43.510", "UserDisplayName": "user109"}
{"Id": 46, "PostId": 40, "Score": 3, "Text": "Just because a question would be on-topic on another SE site does not make it off-topic here, so the existence of [freelancing.se] is pretty much irrelevant to this discussion.  If you don't believe that freelancing delivers \"a service with significant uncertainty\" then I think you may want to speak to a few more freelancers: marketing themselves, finding clients, learning new skills, identifying the right opportunities - all leave freelancers in precarious, uncertain positions from one job to the next.", "CreationDate": "2014-08-05T06:34:06.197", "UserId": 131}
{"Id": 47, "PostId": 40, "Score": 0, "Text": "I know there is uncertainty but its predictable uncertainty. My main concern comes from what a startup is actually defined as: http://www.paulgraham.com/growth.html", "CreationDate": "2014-08-05T08:14:22.463", "UserDisplayName": "user109"}
{"Id": 48, "PostId": 40, "Score": 0, "Text": "Freelancing isn't a highly scalable venture, its time for money. If its not a startup or from someone working or founding a startup, this site may as well be called Small Business. As per the Area51 discussion, it seemed more popular to limit it to tech startups than to expand to small business in general. http://discuss.area51.stackexchange.com/questions/14770/proposal-to-increase-the-scope-from-startup-business-to-business-or-some-oth", "CreationDate": "2014-08-05T08:18:18.873", "UserDisplayName": "user109"}
{"Id": 52, "PostId": 40, "Score": 1, "Text": "Every service business is \"time for money\".  Take someone like [PA Consulting](http://www.paconsulting.com/): all they sell is their time, yet anyone starting up a consulting firm of that sort would probably find their questions on-topic here.  And I'm not sure that questions should be off-topic just because a person's business model is not \"scalable\".", "CreationDate": "2014-08-05T10:02:56.097", "UserId": 131}
{"Id": 53, "PostId": 40, "Score": 0, "Text": "Start-ups aren't a \"time for money\" business model, which just adds to the point I'm making.", "CreationDate": "2014-08-05T12:00:22.643", "UserDisplayName": "user109"}
{"Id": 56, "PostId": 40, "Score": 0, "Text": "So if, together with some friends, I start a consulting business (along the same lines as PA Consulting)... you wouldn't consider that to be a startup business?!", "CreationDate": "2014-08-06T14:18:31.857", "UserId": 131}
{"Id": 63, "PostId": 40, "Score": 0, "Text": "I wouldn't consider that a start-up as defined here: http://www.paulgraham.com/growth.html", "CreationDate": "2014-08-08T04:20:13.223", "UserDisplayName": "user109"}
{"Id": 71, "PostId": 40, "Score": 0, "Text": "I don't see anything in that article that precludes my hypothetical consultancy business from being a startup.  Look at the historical growth rates of many such consultancy businesses, including those that I have mentioned.", "CreationDate": "2014-08-09T07:13:20.160", "UserId": 131}
{"Id": 41, "PostId": 41, "Score": 0, "Text": "One example I am using is: http://startups.stackexchange.com/questions/222/how-should-i-start-a-freelance-web-app-development-business\n\nIt was flagged as too-broad but its not too-broad, its completely off-topic. This is showing that people think the question is related but not in good Q&A format. People should not be answering and mention its off-topic.", "CreationDate": "2014-08-05T04:04:37.053", "UserDisplayName": "user109"}
{"Id": 43, "PostId": 42, "Score": 1, "Text": "Jdreo has my vote as well", "CreationDate": "2014-08-05T05:26:55.873", "UserDisplayName": "user109"}
{"Id": 74, "PostId": 42, "Score": 2, "Text": "Hi, thank you for the nomination. I guess I should just add a little bit. Clearly, I wasn't the greatest programmer, and had little to offer in my 1 year of activity on SO. I followed onstartups for a while, and actively helped to bring startups back, and really want to dedicate myself to this community to make it something great.", "CreationDate": "2014-08-10T08:36:20.493", "UserId": 43}
{"Id": 113, "PostId": 42, "Score": 2, "Text": "I want to see this guy as one of the moderator... reason - he is friendly, helpful, has nice communication skills and obviously one of the lead users on Startups.SE (also active)", "CreationDate": "2014-08-24T19:22:30.390", "UserId": 104}
{"Id": 162, "PostId": 42, "Score": 0, "Text": "Vote was 7-6-6-2 at time of closing.", "CreationDate": "2014-09-14T07:42:13.493", "UserId": 43}
{"Id": 114, "PostId": 43, "Score": 1, "Text": "I know that something went wrong with Softwarerecs.SE but you will make a good mod on Startups.", "CreationDate": "2014-08-24T19:23:37.763", "UserId": 104}
{"Id": 115, "PostId": 43, "Score": 0, "Text": "@Mr.Alien I don't think anything per se went wrong with the moderator selection there; our Moderators are pretty good :) I think though that most likely the reason I wasn't on the shortlist was lack of history of activity - sure I've been intermittently active on StackOverflow as needed basically but now; SR shows what I can do - 44% of first post review are mine, and I have >100 accepted flags; it shows that I understand moderation whereas before I was a relatively new user with very limited community moderation history.", "CreationDate": "2014-08-24T19:27:29.963", "UserId": 44}
{"Id": 133, "PostId": 43, "Score": 1, "Text": "As an SR mod, I can vouch for Nick - he's been a driving force on SR, and seems to know quite a bit about SE and the system itself.", "CreationDate": "2014-09-01T22:28:23.070", "UserId": 150}
{"Id": 134, "PostId": 43, "Score": 0, "Text": "@Undo Thanks. SR is really where I cut my teeth on the SE system after my occasional uses of SO.", "CreationDate": "2014-09-02T00:20:07.837", "UserId": 44}
{"Id": 49, "PostId": 44, "Score": 1, "Text": "*General* business questions will be just as applicable to the tech industry as they are to other industry sectors.  So, if I've understood correctly, your proposal is to exclude questions that are *specifically* about a non-tech sector.  So far, they're relatively few and far between.  What would be the problem with allowing such questions?", "CreationDate": "2014-08-05T09:26:00.900", "UserId": 131}
{"Id": 50, "PostId": 44, "Score": 0, "Text": "I said they are relevant but if we have a large user base who are small business owners, then they will ask general business questions, further obscuring tech startup related questions, then it attracts more small business and the cycle repeats. Then why not just change it to small business. I just don't think this community has its niche defined thoroughly enough yet.", "CreationDate": "2014-08-05T09:29:54.703", "UserDisplayName": "user109"}
{"Id": 51, "PostId": 44, "Score": 2, "Text": "I think there are two proposals here: restrict to **startups** (i.e. refuse questions that are pertinent only to more established businesses); and restrict to the **tech industry** (i.e. refuse questions that are pertinent only to non-tech industries).  Whilst I support the former proposal (but foresee considerable difficulty in defining exactly when a startup becomes \"too mature\"), I don't really see any reason for the latter - isn't it just a case of *tagging* questions in such a way that those interested in only one particular industry can filter the site accordingly?", "CreationDate": "2014-08-05T09:39:26.457", "UserId": 131}
{"Id": 57, "PostId": 44, "Score": 1, "Text": "Before answering what *type* of startups, do you think there is any value to looking at [how to define a startup](http://meta.startups.stackexchange.com/questions/6/what-is-a-startup)? Adam seems to be under the impression it is defined as 'small business', but many of the questions on the site seem to ask about the stage prior to having any business at all. May be a discussion worth having. Hope this helps!", "CreationDate": "2014-08-06T15:46:39.470", "UserId": 89}
{"Id": 58, "PostId": 44, "Score": 0, "Text": "Start-ups are a niche of small business. Also I don't mind what stage a startup is in, either in its growth phase or thinking about staring one, I think any stage is good for the site. The point is small business isn't a startup yet we are getting questions purely about small businesses on here that don't relate to startups. However startups don't have to be tech related but they tend to be. I believe that actually focussing on Tech Startups is going to clarify the site and stop its tendency to move towards small business. I hope that makes sense.", "CreationDate": "2014-08-06T16:11:56.957", "UserDisplayName": "user109"}
{"Id": 54, "PostId": 46, "Score": 3, "Text": "RamenForRevenue :) I joke.", "CreationDate": "2014-08-06T00:24:07.363", "UserId": 43}
{"Id": 55, "PostId": 46, "Score": 0, "Text": "I don't really have any good thoughts yet.", "CreationDate": "2014-08-06T05:25:45.710", "UserId": 44}
{"Id": 59, "PostId": 49, "Score": 3, "Text": "Curious - who is we? Who made the decision to extend? I think the quality of the majority of the questions here are great. Like the guy who asked about scrum-styled workflow mgmt but not necessarily for software... As time passes I think we'll get more and more breadth (as opposed to depth) of questions.", "CreationDate": "2014-08-07T02:46:11.147", "UserId": 43}
{"Id": 60, "PostId": 49, "Score": 2, "Text": "@jdero I would assume 'we' to be the Stack Overflow Community Team; atleast Robert is part of that and that is the group that *would* decide that. I also think the questions and answers are by and large of quite good quality. That being said I definitely see the lack of breadth being a problem.", "CreationDate": "2014-08-07T03:26:49.940", "UserId": 44}
{"Id": 61, "PostId": 49, "Score": 0, "Text": "I see - I'm curious - is there an algorithm that gives us a score? Or is it somewhat of a general observation? Probably a mix of both?", "CreationDate": "2014-08-07T03:28:10.793", "UserId": 43}
{"Id": 62, "PostId": 49, "Score": 1, "Text": "I *believe* that the CT (Community Team) have more data/metrics they use as well as human centred decision making. From the public area 51 stats we look good in some ways; high answered percentage, okay answers per question, low views but that doesn't usually pick up until *at least* a couple months in the *public beta*. Concerning stat is the questions per day at this point - 10/day: during the private beta it is really good to have it if anything more like 20+ to get off to a good start. (do note this is highly unofficial analysis)", "CreationDate": "2014-08-07T04:57:50.620", "UserId": 44}
{"Id": 72, "PostId": 49, "Score": 0, "Text": "Robert, is there any way that we (or SE) can apply some gentle pressure to [those who committed to the Area 51 proposal](http://area51.stackexchange.com/proposals/62811?phase=commitment) but who have not yet shown up here?", "CreationDate": "2014-08-09T19:56:14.553", "UserId": 131}
{"Id": 73, "PostId": 49, "Score": 1, "Text": "Just to put it out there, questions per day is averaging at 7 right now. The average is also declining. We have to fight this <3 ... I just feel like I'm the only one on the entire site sometimes, and don't want to just ask a ton of consecutive questions. I have a lot to ask, I just don't want to look like an attention hoodlum.", "CreationDate": "2014-08-10T07:50:10.560", "UserId": 43}
{"Id": 75, "PostId": 49, "Score": 0, "Text": "I wouldn't worry about asking too much or too much into the average right now. I'd expect the private beta numbers to below the 15/day threshold. Also, if you have good questions, ask them. It helps to have good questions to define the scope of the site and show SE that good questions are coming out of this beta.", "CreationDate": "2014-08-10T14:26:31.743", "UserId": 9}
{"Id": 81, "PostId": 49, "Score": 1, "Text": "Well, this private beta launched right as I went on vacation. I managed to ask 1 and answer 2 questions before taking a 10-day trip. Looks like it's time to polish a few more questions", "CreationDate": "2014-08-11T16:02:57.923", "UserId": 24}
{"Id": 88, "PostId": 49, "Score": 0, "Text": "@jdero yeah I know... sorry. I was away for the weekend (well since Thursday really) so didn't get more than a couple review actions done", "CreationDate": "2014-08-11T23:55:07.927", "UserId": 44}
{"Id": 91, "PostId": 50, "Score": 2, "Text": "I think that focus is still too narrow. Not all businesses aim for an IPO, nor do all that do get there. And many questions are not only related to small businesses either. Thus I would propose a much broader focus such as `running a business` in general (see my answer below).", "CreationDate": "2014-08-12T08:08:35.013", "UserId": 116}
{"Id": 64, "PostId": 53, "Score": 2, "Text": "If StackOverflow was filled with a whole group of beginner programmers, how do you think that site would have gone?", "CreationDate": "2014-08-08T06:33:51.253", "UserDisplayName": "user109"}
{"Id": 65, "PostId": 53, "Score": 3, "Text": "@Adam it wasn't. And neither is this. We all know something or the other... And btw, even Jon Skeet wasn't present at the very beginning, he joined later. We do have people who know things, and that is why questions are being answered. There are many questions which are related to maintaining a startup, just that the other ones are much abundant.", "CreationDate": "2014-08-08T06:48:20.513", "UserId": 92}
{"Id": 66, "PostId": 53, "Score": 3, "Text": "You're missing the point. Start-ups are NOT generally defined as a business about to start-up, that is called usually called a small or micro business. Start-ups are a different type of business altogether. If you wanted a small business forum there are plenty around. More experienced start up owners aren't going to come here for people literally just about to start up. And if you don't have more experienced founders then you are literally going to have new business founders answering questions they only think they know the answer to but have not actually gone through.", "CreationDate": "2014-08-08T07:11:17.537", "UserDisplayName": "user109"}
{"Id": 68, "PostId": 53, "Score": 0, "Text": "@Adam exactly... and other than inviting people, we can't do anything. But we do have some great men here, and we are improving since day one, and we will keep improving. That's all I meant to say.", "CreationDate": "2014-08-08T07:19:54.673", "UserId": 92}
{"Id": 90, "PostId": 53, "Score": 1, "Text": "But it _is_ filled with beginners. That's the very definition of a startup: a business that is in the beginning! And if we focus on startups only, this will always be the case. As soon as anyone got any insightful answers, they have no startup anymore and thus no interest in a startup community. Startups have the most questions, but not the answers. Alas we need to change the name in order to attract and maintain people who got some answers!", "CreationDate": "2014-08-12T08:04:00.750", "UserId": 116}
{"Id": 77, "PostId": 56, "Score": 0, "Text": "What types of startup questions are you thinking of that aren't 'business' questions?", "CreationDate": "2014-08-10T19:48:34.977", "UserId": 9}
{"Id": 80, "PostId": 56, "Score": 1, "Text": "When startup questions are business questions, I'm fine with that, but I don't want this site to become a business site not associated with startups.", "CreationDate": "2014-08-11T08:56:12.713", "UserId": 233}
{"Id": 70, "PostId": 58, "Score": 0, "Text": "I don't mean having premaking tags for all countries but for any countries that are required to use those guidelines.", "CreationDate": "2014-08-08T14:45:07.000", "UserId": 44}
{"Id": 78, "PostId": 59, "Score": 1, "Text": "+1 I very much like Dave McClure's definition; whilst a little bit tongue-in-cheek, it's actually very concise and surprisingly well aligned with my own sense of what defines a \"startup\".", "CreationDate": "2014-08-11T08:36:53.700", "UserId": 131}
{"Id": 79, "PostId": 59, "Score": 0, "Text": "@eggyal yes, that definition is my fav too as it, for one, defines startup and business clearly apart and two, nicely captures the excitement and risk of startups.", "CreationDate": "2014-08-11T08:52:12.197", "UserId": 233}
{"Id": 76, "PostId": 61, "Score": 2, "Text": "\"Conception to Exit\" might work better given your first point above.", "CreationDate": "2014-08-10T16:06:23.080", "UserId": 10}
{"Id": 84, "PostId": 61, "Score": 2, "Text": "I fully agree with everything you say. We need people who have the same problems and we need people who have answers to some of the problems. And I think we should just consider business in general as a viable option.", "CreationDate": "2014-08-11T21:52:20.483", "UserId": 116}
{"Id": 93, "PostId": 61, "Score": 0, "Text": "You have four upvotes. Not everybody is in disagreement with you.", "CreationDate": "2014-08-12T13:19:59.190", "UserId": 60}
{"Id": 83, "PostId": 62, "Score": 1, "Text": "I would even argue that focusing on small business is to focused. The question is: Who has the same problems and who has answers to these questions. I think the answer is everyone in the process of leading a business.", "CreationDate": "2014-08-11T21:50:28.530", "UserId": 116}
{"Id": 85, "PostId": 62, "Score": 0, "Text": "@roesslerj: So then the site becomes a \"Business Leadership\" SE?  I think that's some way from what the original Area51 proposal envisaged...", "CreationDate": "2014-08-11T21:59:35.730", "UserId": 131}
{"Id": 86, "PostId": 62, "Score": 1, "Text": "Thats true, but the other option seems to be to have this site die a lonely death. And honestly: I have seen lots of interesting talks and gotten lots of very helpful advice for/about startups. But those were all from people that were not running startups anymore, because they grew out of that phase.", "CreationDate": "2014-08-11T22:03:57.903", "UserId": 116}
{"Id": 82, "PostId": 63, "Score": 0, "Text": "Regarding @Adam's comment on AwalGarg's answer: I agree and I see this as a way to fill the site with non-beginners in business.", "CreationDate": "2014-08-11T21:46:59.487", "UserId": 116}
{"Id": 89, "PostId": 64, "Score": 1, "Text": "Awesome answer! Loved since the very first sentence. Thanks.", "CreationDate": "2014-08-12T00:55:20.247", "UserId": 60}
{"Id": 94, "PostId": 64, "Score": 0, "Text": "@Math: Thanks for your positive reinforcement ;-)", "CreationDate": "2014-08-12T13:39:36.690", "UserId": 116}
{"Id": 95, "PostId": 65, "Score": 1, "Text": "I agree, although I would point out that knowledge and moderation are not always required to be combined.", "CreationDate": "2014-08-12T22:54:00.007", "UserId": 44}
{"Id": 102, "PostId": 65, "Score": 1, "Text": "Thanks! I'd be honored. I'd love to work with everyone to build this site up. I know there's some talk on the featured posts on whether this SE is actually going anywhere, but I definitely think we can resolve that and make it a resource to entrepreneurs everywhere.", "CreationDate": "2014-08-14T23:18:38.637", "UserId": 59}
{"Id": 96, "PostId": 66, "Score": 2, "Text": "Both this and the area51 proposal for  a site on sex questions really could use some anonymous method. Like hide name and profile link but include rep range (ie like just say <500 or >500 or 1k etc.", "CreationDate": "2014-08-13T01:16:19.800", "UserId": 44}
{"Id": 97, "PostId": 66, "Score": 0, "Text": "I agree that this is a great idea, but I think stack exchange has shot down this idea a few times already. :(", "CreationDate": "2014-08-13T02:03:22.967", "UserId": 9}
{"Id": 98, "PostId": 67, "Score": 4, "Text": "_\"If your question is about Strategies for successfully bringing a product or service to market\"_ is ontopic... I am also assuming this is about a particular product or service, and not a general question, since it will be too broad then and over in one go! But then, you say _\"How can I market this?\"_ is offtopic... I think they are both quite related... any clarifications on that?", "CreationDate": "2014-08-14T04:53:23.797", "UserId": 92}
{"Id": 99, "PostId": 67, "Score": 1, "Text": "I vote for \"Starting _and running_ a small business...\" (and I would even omit \"small\"), but otherwise I'm in favor. Of the exclusions in any case...", "CreationDate": "2014-08-14T20:43:33.857", "UserId": 116}
{"Id": 100, "PostId": 67, "Score": 0, "Text": "@AwalGarg These types of sites always seem to attract question like \"How do I get people to use my website <link>\". \"I have this idea... will it work?\" Under the category of \"general brainstorming\", folks soliciting broad ideas for a product or marketing strategy go well beyond this type of Q&A. But that does ***not*** preclude very *specific* questions you may have encountered in marketing your product or service. That's not what I meant in that *general brainstorming* clause.", "CreationDate": "2014-08-14T21:27:21.710", "UserId": 152}
{"Id": 101, "PostId": 67, "Score": 0, "Text": "You might want to include a point specifically addressing ads. I know it's discussed elsewhere, but I see you deleted a question just today wherein someone was blatantly spamming about their PR business, and I would never have expected that sort of behavior in a *private* beta. The more we can do to combat those in the future, the better.", "CreationDate": "2014-08-14T22:29:18.057", "UserId": 59}
{"Id": 103, "PostId": 67, "Score": 0, "Text": "@RobertCartaino Thanks for the clarification. I agree to that. And also, I agree to what \\@roesslerj said, so it would be great if you incorporate that... I am a bit busy now, and will post a complete answer later.", "CreationDate": "2014-08-15T09:36:44.677", "UserId": 92}
{"Id": 116, "PostId": 67, "Score": 1, "Text": "I think you should allow for asking questions about how to market successfully.  Keep it strategy focused, of course, but definitely allow \"I'm here, but no idea where to go next with marketing\"  Entrepreneurs are often and foremost technicians and not sales experts and this is one of the most often asked question I get as I help small businesses build their websites and online presence.", "CreationDate": "2014-08-25T21:20:53.410", "UserId": 521}
{"Id": 132, "PostId": 69, "Score": 1, "Text": "I don't see why it would be problematic if they only allowed it from users with 500+ rep, and then included your rep range in the post, and still had the same provisions and restrictions as you would normally, except a hidden link to the actual profile.", "CreationDate": "2014-09-01T04:14:37.917", "UserId": 43}
{"Id": 104, "PostId": 71, "Score": 0, "Text": "The creator of Bright Journey [mentioned](http://discuss.area51.stackexchange.com/a/13096) it during a discussion on this site's Area51 proposal, so I don't see how \"*neither of us knows the other exact*\"?", "CreationDate": "2014-08-18T17:48:21.750", "UserId": 131}
{"Id": 105, "PostId": 71, "Score": 0, "Text": "Well that makes this awkward. Thanks for the link.", "CreationDate": "2014-08-18T18:48:14.287", "UserId": 43}
{"Id": 106, "PostId": 71, "Score": 0, "Text": "@eggyal In reading your link (apologies for the delay), this is only a reference to onstartups. I'm talking about this new startups community, and furthermore the knowledge of brightjourney in general by current startups.se folk. Sad to read that post, but with their help we will stand a better chance at succeeding.", "CreationDate": "2014-08-20T02:15:58.497", "UserId": 43}
{"Id": 110, "PostId": 71, "Score": 1, "Text": "I'm not sure whether we're looking at the same post?  I'm referring to Hopstream's answer, beginning \"Being frustrated with how the Answers.Onstartups knowledge was closed, we re-created the community over the last month: Bright Journey\"?", "CreationDate": "2014-08-20T20:36:18.557", "UserId": 131}
{"Id": 111, "PostId": 71, "Score": 0, "Text": "What does that have to do with our awareness of their presence? Clearly they came from onstartups, and therefore recognize the SE community, but that's not really what I was posting about.", "CreationDate": "2014-08-21T00:49:10.923", "UserId": 43}
{"Id": 112, "PostId": 71, "Score": 1, "Text": "I'm just saying that the existence of Bright Journey was disclosed to \"us\" during a discussion on the Area51 proposal.", "CreationDate": "2014-08-21T07:29:48.273", "UserId": 131}
{"Id": 1738, "PostId": 73, "Score": 0, "Text": "Agreed, according to the help docs for this site at http://startups.stackexchange.com/help/on-topic, yes these are on topic.", "CreationDate": "2015-11-17T04:22:26.253", "UserId": 6224}
{"Id": 107, "PostId": 74, "Score": 3, "Text": "Thanks guys :) I hope we will further create more, better, and quality content. And congratulations to all! And when are we getting our pro tem mods btw?", "CreationDate": "2014-08-20T05:22:45.913", "UserId": 92}
{"Id": 108, "PostId": 74, "Score": 1, "Text": "@AwalGarg Soon, this is the point where we _really_ start looking for folks that want to help lead the community, Grace Note will probably begin the selection process within a week or two. Anyone interested should [head over here](http://meta.startups.stackexchange.com/questions/38/nominate-pro-tempore-moderators-to-help-guide-the-site-through-beta) and throw their hat in, soon. We do look at possible candidates based on their activity and interactions alone, but make sure you chime in there just to be safe if interested.", "CreationDate": "2014-08-20T06:17:47.227", "UserId": 96}
{"Id": 124, "PostId": 75, "Score": 0, "Text": "I think I got accomplished  what I wanted in the fact this meta post is approaching 100 views. It's just good to be aware of each other :)", "CreationDate": "2014-08-29T01:10:32.483", "UserId": 43}
{"Id": 117, "PostId": 78, "Score": 0, "Text": "Stupid question--where do we vote for tag synonyms, anyway? It isn't on review and I don't see it anywhere on the tag page itself.", "CreationDate": "2014-08-27T06:32:25.933", "UserId": 59}
{"Id": 118, "PostId": 78, "Score": 0, "Text": "is there an up arrow here: http://startups.stackexchange.com/tags/united-states/synonyms ?", "CreationDate": "2014-08-27T07:07:27.820", "UserId": 43}
{"Id": 119, "PostId": 78, "Score": 0, "Text": "although I'm curious if there's a page to see all of the running votes. That would be nice.", "CreationDate": "2014-08-27T07:08:33.970", "UserId": 43}
{"Id": 120, "PostId": 78, "Score": 1, "Text": "Ah, I see. Thanks. Yeah, that would be useful. Although I suppose the rush of tag synonyms probably tends to slow down as the site gets established, so it probably hasn't been a high priority UI-wise. Maybe the idea is that people make posts on meta (case in point)?", "CreationDate": "2014-08-27T07:11:29.260", "UserId": 59}
{"Id": 121, "PostId": 78, "Score": 0, "Text": "hmmph I apparently haven't been answering my southern neighbours questions enough - at least the requirement is 4 score on the tag (not total rep) and I don't have that yet - I have more rep on Sri-Lanka than I do on united-states!", "CreationDate": "2014-08-27T15:54:31.733", "UserId": 44}
{"Id": 122, "PostId": 79, "Score": 0, "Text": "Off-hand I can't think of any other states/provinces that have a duplication with a country name. hmmm I do not like applying -state to everyone state (and then would we want to append -province to every province). I think at this point maybe leave it and see what happens. Basically I'm copping out because I can't think of a good solution.", "CreationDate": "2014-08-28T13:37:21.350", "UserId": 44}
{"Id": 123, "PostId": 79, "Score": 1, "Text": "@NickWilde works for me. I'm not sure what the actual chances of anyone needing to refer to the country actually are. Admittedly I'm not the most informed about the country, but I don't get the impression it's teeming with the sorts of innovation we generally discuss here. I just figured it should be brought up before someone *does* attempt to refer to the country and gets some wildly inaccurate answers. But hopefully the tag wiki will handle that before it happens anyway.", "CreationDate": "2014-08-28T20:21:03.047", "UserId": 59}
{"Id": 223, "PostId": 80, "Score": 0, "Text": "I agree that georgia-country would be a fine fit (and would be better than doing georgia-state - it makes more sense to add the modifier to the less frequently used one tag).\n But I don't see a reason to add the tag until someone needs to use it (though having already discussed it when/if that time comes will be helpful).", "CreationDate": "2014-09-28T19:01:45.807", "UserId": 844}
{"Id": 125, "PostId": 82, "Score": 1, "Text": "Not an answer as I'm still thinking... app-development doesn't to me specify mobile nor does mobile-apps specify the development of apps; it could just as easily mean to me support or etc.", "CreationDate": "2014-08-30T20:25:18.630", "UserId": 44}
{"Id": 126, "PostId": 82, "Score": 0, "Text": "That's a good point. I suppose you could use another tag in addition to complement mobile-apps if you want to specify that you are a support company. Like how if you're a california llc, you'd use california and llc instead of california-llc", "CreationDate": "2014-08-30T23:54:45.900", "UserId": 9}
{"Id": 127, "PostId": 82, "Score": 0, "Text": "exactly my thought. In which case app-development should still be burninated and replaced with `development` or `support` or whatever if applicable.If that is so I'm in favour of the burnination of app-development.", "CreationDate": "2014-08-31T00:11:14.003", "UserId": 44}
{"Id": 128, "PostId": 82, "Score": 1, "Text": "Since there doesn't seem to be any opposition, I went ahead and retagged those five questions.", "CreationDate": "2014-08-31T01:36:49.870", "UserId": 9}
{"Id": 129, "PostId": 82, "Score": 0, "Text": "+1 - though I would have liked to see some more activity from other users rather than just lack of opposition. (I think right thing to do and fine to go ahead but I'm glaring at those not being active on meta)", "CreationDate": "2014-08-31T01:41:39.153", "UserId": 44}
{"Id": 130, "PostId": 82, "Score": 0, "Text": "Well it's also up to those who review the edits. I've lost my edit priviledge since we went public", "CreationDate": "2014-08-31T02:00:08.510", "UserId": 9}
{"Id": 131, "PostId": 82, "Score": 0, "Text": "me to (sob)... soon I'll get it back though", "CreationDate": "2014-08-31T03:35:26.763", "UserId": 44}
{"Id": 1579, "PostId": 83, "Score": 0, "Text": "Agree. Quora is a much better source of startup-related answers than what I've seen here and on other SE sites. You often see answers from actual VCs and angel investors ([David Rose's answers](https://www.quora.com/David-S-Rose) are remarkable); AFAIK, none of those folks are active here.", "CreationDate": "2015-02-19T13:03:03.203", "UserId": 3640}
{"Id": 1581, "PostId": 83, "Score": 0, "Text": "Might be worth noting that it appears you might be bit bias on the topic; meaning it appears your current activity on Quora is: Questions-61, Answers-296, Posts-3, Edits-1739; but on SE-Startups Main & Meta, aside from the comment above, you've had zero activity.", "CreationDate": "2015-02-19T20:13:49.800", "UserId": 551}
{"Id": 1582, "PostId": 83, "Score": 0, "Text": "Correct, I've just learned about SE-Startups today. I used to be active on answers.onstartups.com. Nevertheless, with all due respect for the [top users here](https://startups.stackexchange.com/users?tab=Reputation&filter=all), I don't see any of the major angel investors from Quora, and their answers have often provided unique insight into the fundraising part of startup life. Same goes for famous founders.", "CreationDate": "2015-02-19T21:53:56.590", "UserId": 3640}
{"Id": 1583, "PostId": 83, "Score": 0, "Text": "@DanDascalescu: Unique insight only go so far for the average startup, and maybe I'm biased, but I'm not impressed with Quora's free for all approach; as you know, if SE took that approach, OnStartups would still be on SE, and I personally am very happy with the mods & community of Startups-SE. Welcome back... :-)", "CreationDate": "2015-02-20T05:36:05.217", "UserId": 551}
{"Id": 1584, "PostId": 83, "Score": 0, "Text": "To each their own; while the quality of technical answers on Quora is far behind SO, the frustration I've experienced with the general \"fist in your face\" attitude on SE (nonsensical close votes, deletionists, overzealous moderators [etc](https://pinboard.in/search/u:dandv?query=against+stackexchange).) has pushed me to Quora many times.", "CreationDate": "2015-02-20T07:28:40.493", "UserId": 3640}
{"Id": 137, "PostId": 86, "Score": 0, "Text": "can you point out why down vote ?", "CreationDate": "2014-09-08T18:14:22.870", "UserId": 668}
{"Id": 138, "PostId": 87, "Score": 1, "Text": "Thanks for suggestion but [tag:field-sales] tag is more suitable.", "CreationDate": "2014-09-09T11:50:14.443", "UserId": 668}
{"Id": 139, "PostId": 88, "Score": 0, "Text": "inside sales talks about approach like by phone , online etc.where field-sales talks about versicle of sales.don't mix both .", "CreationDate": "2014-09-11T13:23:11.220", "UserId": 668}
{"Id": 141, "PostId": 88, "Score": 0, "Text": "it's not convincing to me.", "CreationDate": "2014-09-11T13:37:48.633", "UserId": 668}
{"Id": 142, "PostId": 88, "Score": 0, "Text": "@Rudra: Yes, I know; my point was to create two tags, one for each term - and apply them to real existing questions. Are you going to post examples of teal existing questions that are on the site that should have field-sales as a tag? If not, your questions appears to be speculative and there's no need to add the tag. Also, just in case it's not clear, if you earn enough rep, you can add tags yourself.", "CreationDate": "2014-09-11T13:39:14.953", "UserId": 551}
{"Id": 143, "PostId": 88, "Score": 0, "Text": "@Rudra: Sorry, but I don't understand what you mean by \"it's not convincing to me.\"", "CreationDate": "2014-09-11T13:40:29.503", "UserId": 551}
{"Id": 144, "PostId": 88, "Score": 0, "Text": "follow this question about [field-sales](http://startups.stackexchange.com/questions/605/field-sales-marketing-vs-online-inbound-marketing), I am looking about sales vertical.So better you create that tag.", "CreationDate": "2014-09-11T13:44:13.477", "UserId": 668}
{"Id": 145, "PostId": 88, "Score": 0, "Text": "@Rudra: Thanks for giving an example. My take at this point is that a single question is not a pattern, but in my opinion two does, so I posted another question on the topic to resolve your request: [What tactics work well for startups using field sales?](http://startups.stackexchange.com/questions/682/what-tactics-work-well-for-startups-using-field-sales) - only thing I would ask in return is that you do your best to share what you know on the site, tell people you know about it, and enjoy being part of the community... :-) ...cheers!", "CreationDate": "2014-09-11T14:29:31.687", "UserId": 551}
{"Id": 146, "PostId": 88, "Score": 0, "Text": "blunders : Thanks for another example which is generated by you, Tag is created .", "CreationDate": "2014-09-11T14:41:21.573", "UserId": 668}
{"Id": 147, "PostId": 89, "Score": 4, "Text": "Obviously there is no question here.  I have voted to close as \"*unclear what you're asking*\".", "CreationDate": "2014-09-12T18:50:33.900", "UserId": 131}
{"Id": 148, "PostId": 89, "Score": 0, "Text": "+1 @eggal: Well played... :-) ...and agree, congrats to the pro-tempore moderators.", "CreationDate": "2014-09-12T19:56:45.057", "UserId": 551}
{"Id": 150, "PostId": 89, "Score": 0, "Text": "Congratulations to all pro-temp moderators.", "CreationDate": "2014-09-12T21:39:33.030", "UserId": 43}
{"Id": 160, "PostId": 89, "Score": 0, "Text": "Thanks to the SE team for the appointment :) I will endeaver to grow and improve this site towards its potential.", "CreationDate": "2014-09-13T18:34:27.587", "UserId": 44}
{"Id": 161, "PostId": 89, "Score": 0, "Text": "Congrats to Connor and Matthew Haugen!", "CreationDate": "2014-09-13T18:34:50.773", "UserId": 44}
{"Id": 149, "PostId": 91, "Score": 1, "Text": "@Grace_Note I'm just curious, for my future use of the Stack Exchange: why wasn't I chosen for this? I was recommended by existing moderators, tied for the second most votes from the community, and was by far the most active person on the site (in terms of time, chat, and contribution). I just would like to know what I did wrong. I invited friends, helped new users, and frankly I monitor the content and review posts 24/7. I just feel like I've invested so much and have been blindsided.", "CreationDate": "2014-09-12T21:38:55.750", "UserId": 43}
{"Id": 151, "PostId": 91, "Score": 4, "Text": "You didn't do anything wrong. Ideally, moderators are elected and selected by the community, but in these early stages we perform a selection appointment. We only motion to select three out of what is generally a very large and bustling community ripe with many useful talents, which is based on a number of factors as a result. There are members who are actively involved and very deserving of recognition. My failure to account for everyone, including you, this early on is in *no way* meant as a slight against them. I'm sorry if it was seen as such.", "CreationDate": "2014-09-12T21:46:45.940", "UserId": 11}
{"Id": 152, "PostId": 91, "Score": 2, "Text": "I thank you for your kind words but am extremely hurt by your decision. I don't have any more words for you.", "CreationDate": "2014-09-12T21:49:41.207", "UserId": 43}
{"Id": 153, "PostId": 91, "Score": 2, "Text": "You clearly aren't emphasizing the weight of whichever attributes are in your algorithm and I wish this community the best of luck as it won't have to deal with me anymore.", "CreationDate": "2014-09-12T22:07:01.580", "UserId": 43}
{"Id": 154, "PostId": 91, "Score": 3, "Text": "@jdero: For what it's worth, I don't envy mods all the hassle that they have to bear.  I would much rather spend my time helping to answer people's questions than dealing with flags, offensive comments, inappropriate edits and drivelling nonsense day-in and day-out.  Of course, I'm very grateful to those who volunteer to take on those tasks—but if you're here (as I am) in a bid to raise your profile and/or further your career, I think you'd be far better off with time available to show off your knowledge than being swamped in moderation tasks.", "CreationDate": "2014-09-12T22:10:17.347", "UserId": 131}
{"Id": 155, "PostId": 91, "Score": 0, "Text": "@jdero: Plus, you must bear in mind that mods really don't have a great deal more power than a user who earns the maximum privileges through their site reputation... which you (very deservingly) are well on your way to doing.  Please don't desert us over such a pithy thing—if you're still interested in the role when it comes to elections, then I'm sure that you will have the community's vote.  In the meantime, I for one would be deeply disappointed to lose your input.", "CreationDate": "2014-09-12T22:11:19.063", "UserId": 131}
{"Id": 156, "PostId": 91, "Score": 0, "Text": "It has nothing to do with my career. I just want to help people.", "CreationDate": "2014-09-12T22:14:55.530", "UserId": 43}
{"Id": 157, "PostId": 91, "Score": 2, "Text": "@jdero: Then, in my humble opinion, you're far better placed to do that without having the responsibility of being a moderator.", "CreationDate": "2014-09-12T22:15:49.880", "UserId": 131}
{"Id": 1748, "PostId": 91, "Score": 0, "Text": "@Meta I don't like reading old conversations when they played out like this, I just didn't think it was entirely sensical at the time. As for your comment, I'm okay being a dark knight :D", "CreationDate": "2016-05-03T21:57:19.730", "UserId": 43}
{"Id": 172, "PostId": 92, "Score": 0, "Text": "\"We’d like to hear your thoughts.\" -- who is we?", "CreationDate": "2014-09-23T20:11:11.353", "UserId": 551}
{"Id": 175, "PostId": 92, "Score": 0, "Text": "@blunders I had discussed it with Matthew and Nick. Sorry, I meant to mention that.", "CreationDate": "2014-09-23T20:34:21.423", "UserId": 9}
{"Id": 240, "PostId": 92, "Score": 0, "Text": "May I suggest [\"Bootstrap\"](http://www.investopedia.com/terms/b/bootstrap.asp)?", "CreationDate": "2014-09-30T05:48:13.253", "UserId": 92}
{"Id": 242, "PostId": 92, "Score": 0, "Text": "@blunders There is a moderator-only chat that they use to discuss raising these issues.", "CreationDate": "2014-10-01T01:57:44.413", "UserId": 43}
{"Id": 243, "PostId": 92, "Score": 0, "Text": "@jdero: :-) ...yes, I know, I was just pointing it out in an indirect way for others that might not have been aware. Oddly, it appears that the question was [posted without a consensuses first](http://chat.stackexchange.com/transcript/message/17839472#17839472), or at least that's the way it appears to me. Never having been a mod, I'm very aware there's a lot of \"magic\" that happens behind the curtains, so to speak.", "CreationDate": "2014-10-01T02:06:06.617", "UserId": 551}
{"Id": 244, "PostId": 92, "Score": 1, "Text": "@AwalGarg Of course. If you post it as an answer it'll be easier to compare to the others.", "CreationDate": "2014-10-01T02:12:46.800", "UserId": 9}
{"Id": 245, "PostId": 92, "Score": 3, "Text": "It's good that these issues are raised, but in this case I think startups is a great name. If anything, the only people who don't know what a startup is (in terms of getting an \"in-the-ballpark\" definition) are probably the ones who never would be able to contribute to this site. I think it's quite perfect. Short, easily pronounced, and has amazing potential to attract enough curiosity to provoke growth :D", "CreationDate": "2014-10-01T02:15:12.587", "UserId": 43}
{"Id": 246, "PostId": 92, "Score": 1, "Text": "@blunders I'm not sure what you mean by no consensus. The purpose of this post is to see if there is a consensus one way or the other.", "CreationDate": "2014-10-01T02:20:22.120", "UserId": 9}
{"Id": 247, "PostId": 92, "Score": 2, "Text": "@jdero I think that startups is a good name, I just thought there might be something better. Right now it doesn't look like there's enough momentum for any of the current options for SE to consider a change.", "CreationDate": "2014-10-01T02:23:19.317", "UserId": 9}
{"Id": 248, "PostId": 92, "Score": 0, "Text": "@connor: Meaning if I was going to suggest a change, and that change originated from a subset of a group, I would make sure the subset agreed before moving onto the community at large. Also, I agree that it appears that for now, there's no clear momentum; which isn't a huge surprise to me having worked on thought SE beta branding efforts before.", "CreationDate": "2014-10-01T02:27:37.970", "UserId": 551}
{"Id": 249, "PostId": 92, "Score": 0, "Text": "+1 @jdero: Clearly, [I agree](http://meta.startups.stackexchange.com/a/93/551); added your comment to my answer.", "CreationDate": "2014-10-01T02:28:15.103", "UserId": 551}
{"Id": 250, "PostId": 92, "Score": 0, "Text": "@blunders Ah. We only agreed that it was worth a discussion.", "CreationDate": "2014-10-01T02:29:16.617", "UserId": 9}
{"Id": 251, "PostId": 92, "Score": 1, "Text": "@connor: Everything is worth discussion; even if it is only to disagree that it is... :-)", "CreationDate": "2014-10-01T02:32:18.990", "UserId": 551}
{"Id": 252, "PostId": 92, "Score": 0, "Text": "Exactly. And that's why we have meta.", "CreationDate": "2014-10-01T02:33:18.350", "UserId": 9}
{"Id": 254, "PostId": 92, "Score": 0, "Text": "I'm a bit late to the meta party over here, but I wanted to throw my 2 cents in and say that I feel like there could be a better option out there than Startups. Of the ones presented, \"Startups and small businesses\" is my favorite. That said, if the general consensus is to stay with Startups (or there is no consensus either way), I'm happy as-is.", "CreationDate": "2014-10-02T03:13:26.900", "UserId": 844}
{"Id": 284, "PostId": 92, "Score": 0, "Text": "@JRWarren: There was a party? Ah, now I feel left out... :-)", "CreationDate": "2014-10-02T20:36:32.570", "UserId": 551}
{"Id": 285, "PostId": 92, "Score": 0, "Text": "@JRWarren I agree that describes our site best. I think its biggest con is that stack exchange prefers shorter names.", "CreationDate": "2014-10-02T20:41:46.203", "UserId": 9}
{"Id": 167, "PostId": 93, "Score": 0, "Text": "The \"title\" is not the same as the subdomain. Although ours happen to match up, there are [sites](http://ham.stackexchange.com) where they do not, with good reason. While I respect the viewpoint that we should keep the same one, and I would have proposed it myself had you not already, please adjust your first line to reflect the topic of this discussion by trimming off `.stackexchange.com`, in case that confuses later readers.", "CreationDate": "2014-09-23T18:49:39.853", "UserId": 59}
{"Id": 168, "PostId": 93, "Score": 1, "Text": "@MatthewHaugen: Startups SE is the name of the site, it's not simple called Startups; as such, I have no issue leaving my answer as is. Also, I agree, having a subdomain that's different than the sitename is confusing, especially in the context of the issue your query is on. If you want a two part answer, that being both the subdomain and sitename, I would request you update the question first. Also, to be honest, I see your question as is as being a bit biased, and not open ended.", "CreationDate": "2014-09-23T20:02:12.740", "UserId": 551}
{"Id": 173, "PostId": 93, "Score": 0, "Text": "@blunders just to clarify: Matthew didn't open the question, Connor opened it after discussion between the mods and referring to Robert Cartaino's posts. It is specifically meant to be open for any suggestions; it is not open ended but it is open.", "CreationDate": "2014-09-23T20:15:32.250", "UserId": 44}
{"Id": 219, "PostId": 93, "Score": 1, "Text": "+1 for the word usage trends.  Also, I like the name.", "CreationDate": "2014-09-26T20:09:46.030", "UserId": 554}
{"Id": 220, "PostId": 94, "Score": 1, "Text": "You might be on to something.  Following @blunders lead: [Google Ngram Viewer](https://books.google.com/ngrams/graph?content=startups%2Centrepeneurs%2C+small+business&year_start=1800&year_end=2000&corpus=15&smoothing=3&share=&direct_url=t1%3B%2Cstartups%3B%2Cc0%3B.t1%3B%2Centrepeneurs%3B%2Cc0%3B.t1%3B%2Csmall%20business%3B%2Cc0).", "CreationDate": "2014-09-26T20:11:26.330", "UserId": 554}
{"Id": 165, "PostId": 95, "Score": 0, "Text": "**Major Con:** Long & hard to spell.", "CreationDate": "2014-09-23T13:21:37.057", "UserId": 551}
{"Id": 166, "PostId": 95, "Score": 0, "Text": "@blunders That's very true, but remember that we are not bound to keeping the same subdomain as title. We could risk some confusion otherwise in certain circumstances, but that's worth noting. So \"long and hard to spell\" isn't *really* a big deal for the topic here.", "CreationDate": "2014-09-23T18:47:39.720", "UserId": 59}
{"Id": 169, "PostId": 95, "Score": 0, "Text": "Clearly, it is to me... :-) ...also, based on your other comments, please explain if you see the use of the above term being subject to trademark claims by the dotcom/mag of the same name.", "CreationDate": "2014-09-23T20:05:28.760", "UserId": 551}
{"Id": 170, "PostId": 95, "Score": 1, "Text": "I don't know what SE's take on it would be but from a technical end having Startups.stackexchange.com automatically redirect to entrepeneurs.stackexchange.com is **very** simple", "CreationDate": "2014-09-23T20:05:49.513", "UserId": 44}
{"Id": 171, "PostId": 95, "Score": 0, "Text": "@NickWilde Good point. `askpatents.stackexchange.com` already redirects to `patents.stackexchange.com`, so I'm sure they'd be alright with that.", "CreationDate": "2014-09-23T20:07:45.970", "UserId": 59}
{"Id": 174, "PostId": 95, "Score": 1, "Text": "In that case I see very limited down side here. depending on the SE teams' patience/willingness we could even ask them to auto-redirect the most common misspellings of entrepeneurs", "CreationDate": "2014-09-23T20:18:56.293", "UserId": 44}
{"Id": 179, "PostId": 95, "Score": 0, "Text": "@NickWilde: [Nothing to lose](https://books.google.com/ngrams/graph?content=startups%2C+entrepeneurs+&year_start=1800&year_end=2000&corpus=15&smoothing=3&share=&direct_url=t1%3B%2Cstartups%3B%2Cc0%3B.t1%3B%2Centrepeneurs%3B%2Cc0)... [right](http://www.google.com/trends/explore#q=startups%2C%20entrepeneurs)?", "CreationDate": "2014-09-24T16:41:40.290", "UserId": 551}
{"Id": 182, "PostId": 95, "Score": 0, "Text": "@blunders ah that is interesting data - interesting date of crossover being pretty much when Entrepreneur Mag started being a legal hassle. I wouldn't want to say it was causative but be an interesting study to determine that", "CreationDate": "2014-09-24T17:16:04.210", "UserId": 44}
{"Id": 183, "PostId": 95, "Score": 0, "Text": "@NickWilde: Thanks. Do you have a link related to your Entrepreneur Mag reference?", "CreationDate": "2014-09-24T17:28:05.953", "UserId": 551}
{"Id": 184, "PostId": 95, "Score": 0, "Text": "@blunders no - and as I said it approximately the same time but I'm not sure that it is causative.", "CreationDate": "2014-09-24T17:33:07.820", "UserId": 44}
{"Id": 185, "PostId": 95, "Score": 0, "Text": "http://www.bloomberg.com/news/2011-05-19/-cite-entrepreneur-cite-the-magazine-that-sues-entrepreneurs.html", "CreationDate": "2014-09-24T17:33:40.040", "UserId": 44}
{"Id": 187, "PostId": 95, "Score": 0, "Text": "@NickWilde: Well, guess that appears to confirm [my concerns on if there's any reason to be concerned about conflicts related to using that term](http://meta.startups.stackexchange.com/questions/92/is-our-name-appropriate/95?noredirect=1#comment169_95); though, I don't think that's the reason for the decline of the term, or the success of the term startups, though might be wrong. Thanks for digging up the link!", "CreationDate": "2014-09-24T17:43:43.903", "UserId": 551}
{"Id": 202, "PostId": 95, "Score": 1, "Text": "I said it looked correlated *not* causation - http://xkcd.com/552/", "CreationDate": "2014-09-24T19:19:46.550", "UserId": 44}
{"Id": 203, "PostId": 95, "Score": 0, "Text": "and yes I agree unfortunately that does confirm your concerns - thanks for bring them up; that's why I found that link", "CreationDate": "2014-09-24T19:20:30.003", "UserId": 44}
{"Id": 208, "PostId": 95, "Score": 0, "Text": "@NickWilde: Right, if they're not correlated, clearly there's no causation... :-)", "CreationDate": "2014-09-24T21:37:14.483", "UserId": 551}
{"Id": 211, "PostId": 95, "Score": 0, "Text": "@MatthewHaugen: Might be worth updating your answer to reflect any cons that have been found via comments (if you believe they're valid) so people don't have to read the comments to find them.", "CreationDate": "2014-09-24T22:13:35.813", "UserId": 551}
{"Id": 176, "PostId": 96, "Score": 1, "Text": "I really like this. I wonder whether there are any similar versions that could address the first con you listed, although I don't think it's even such a big deal.", "CreationDate": "2014-09-24T09:25:47.940", "UserId": 59}
{"Id": 177, "PostId": 96, "Score": 0, "Text": "Realize that \"go big, or go home\" is a common pitch, but the reality is that there's a huge amount of value that's created by startups that never go big. Beyond that, \"big thinking\" is often of zero use to startups. All just my opinion, but I personally don't care for this line of thought.", "CreationDate": "2014-09-24T16:34:53.167", "UserId": 551}
{"Id": 178, "PostId": 96, "Score": 1, "Text": "@blunders: That seems a little paradoxical to me - is it not that creating \"*a huge amount of value*\" is the very definition of being \"*big*\"?", "CreationDate": "2014-09-24T16:38:35.580", "UserId": 131}
{"Id": 180, "PostId": 96, "Score": 0, "Text": "@eggyal: Nothing paradoxical at all, or at least to me; aka the [long-tail](http://en.wikipedia.org/wiki/Long_tail#mediaviewer/File:Long_tail.svg).", "CreationDate": "2014-09-24T16:45:03.410", "UserId": 551}
{"Id": 186, "PostId": 96, "Score": 1, "Text": "@blunders: Indeed, the Wikipedia article to which you linked gives examples of [Internet Companies](http://en.wikipedia.org/wiki/Long_tail#Internet_companies) whose business model entails a \"long tail\"—and I'm pretty sure we'd describe all of them as \"*big*\" (eBay, Yahoo!, Google, Amazon, iTunes, Audible, LoveFilm).", "CreationDate": "2014-09-24T17:40:25.137", "UserId": 131}
{"Id": 188, "PostId": 96, "Score": 0, "Text": "@eggyal: Find a \"complete\" list of startups creating value, then tell me how many have billion dollar caps.", "CreationDate": "2014-09-24T17:52:17.747", "UserId": 551}
{"Id": 189, "PostId": 96, "Score": 0, "Text": "@blunders: You said \"*huge amount of value*\".  My point was that people always pay big sums for businesses that create a \"*huge amount of value*\".  I can only find examples that support my POV, as I have already stated.  By all means feel free to provide a counterexample, rather than challenging me to find examples that would prove a point I believe is wrong (and I don't believe exist).", "CreationDate": "2014-09-24T18:06:04.167", "UserId": 131}
{"Id": 190, "PostId": 96, "Score": 0, "Text": "@eggyal: The huge value is the sum of the long-tail, not a single entity within it. As for supporting data, I'll look for it, though pretty obvious in my opinion that startups follow the long-tail model.", "CreationDate": "2014-09-24T18:16:47.497", "UserId": 551}
{"Id": 191, "PostId": 96, "Score": 0, "Text": "@blunders: I don't think it makes any difference whether one derives huge value from being high volume low margin, or low volume high margin—the \"huge value\" created either way is the very definition of being \"big\".  To put it your way, if one's business model involves long-tails, then \"*thinking big*\" would be planning on developing so many of them that the sum is \"*big*\".", "CreationDate": "2014-09-24T18:19:32.940", "UserId": 131}
{"Id": 192, "PostId": 96, "Score": 0, "Text": "@eggyal: You keep referencing an entity that's business model is based on the long-tail, which has nothing to do with my use of the term. I am referencing the \"market index\" of startup and the value they create as fitting to a long-tail when viewed in sum.", "CreationDate": "2014-09-24T18:25:05.530", "UserId": 551}
{"Id": 193, "PostId": 96, "Score": 1, "Text": "@blunders: I honestly have no idea what any of that means.", "CreationDate": "2014-09-24T18:25:48.580", "UserId": 131}
{"Id": 194, "PostId": 96, "Score": 0, "Text": "@eggyal: I know.", "CreationDate": "2014-09-24T18:26:47.300", "UserId": 551}
{"Id": 196, "PostId": 96, "Score": 0, "Text": "PE & VC would have little interest in the long-tail of a market in my opinion. I'll post a question requesting supporting data, feel free to upvote it if your interested in an answer.", "CreationDate": "2014-09-24T18:33:28.650", "UserId": 551}
{"Id": 199, "PostId": 96, "Score": 1, "Text": "I'll admit to being a little lost on the whole conversation that precedes this comment. \"Think Big\" is a [common phrase](http://dictionary.reference.com/browse/think+big) [that refers](http://dictionary.cambridge.org/dictionary/british/think-big) [to being](http://www.oxforddictionaries.com/definition/english/think-big) ambitious. I'm not sure I see why it needs to be read-into any more than that. It's a well-known phrase that is used extremely commonly in or around startups *and* small businesses.", "CreationDate": "2014-09-24T18:48:37.263", "UserId": 59}
{"Id": 200, "PostId": 96, "Score": 0, "Text": "@eggyal: In theory, yes, though investing in millions of non-publicly traded entities globally would currently have a massive administrative overhead; as for data, if you model the revenue present in a [sample of a single year of the INC 5000](https://opendata.socrata.com/Business/Top-5-000-Companies-from-INC-com/n4ex-cets), it appears to fit a long-tail. Please feel free take a look and let me know if I'm wrong.", "CreationDate": "2014-09-24T18:50:44.143", "UserId": 551}
{"Id": 201, "PostId": 96, "Score": 0, "Text": "@MatthewHaugen: In my opinion, being a billion dollar company is rarely the goal of most startups that end up producing real value, including the ones that end up being having billion dollar caps. Most successful founders just want to be independently successful, which only requires making enough to support the business and their needs. Hence why in my opinion \"Think Big\" reflects a failure to see both what most real world founders really care about, and how startups produce value in the real-world; meaning the aggregate value is as important, if not more, as the billion dollar outliers.", "CreationDate": "2014-09-24T19:04:16.887", "UserId": 551}
{"Id": 205, "PostId": 96, "Score": 1, "Text": "@blunders: Ah, I think I understand now. You're saying that whilst some businesses create little value, there are so many of them that in aggregate they contribute a lot to the wider economy? Of course I don't dispute that. Whether the people behind those businesses aspire to something bigger, or are satisfied with the status quo is open to debate—but even if they're satisfied with the status quo, I didn't think that this site was aimed at such people: I had understood that it was aimed at helping businesses solve the problems that they face when attempting to grow into something bigger.", "CreationDate": "2014-09-24T20:05:00.563", "UserId": 131}
{"Id": 207, "PostId": 96, "Score": 0, "Text": "@eggyal: Yes, I agree that it appears you understand what I am saying now. As for growth, in my opinion, that is secondary to getting a business running, which I personally see as more important than growth. Further, if outlier type growth is the focus of the site (which I personally would support) - that does not appear to be the popular opinion; very possible I've misunderstood you. Lastly, chat would likely be a better forum for our discussion, though I might be wrong.", "CreationDate": "2014-09-24T21:07:10.710", "UserId": 551}
{"Id": 209, "PostId": 96, "Score": 1, "Text": "@blunders: In the context of my previous comment, I was including \"growing from nothing into something\" (i.e. getting started) when I said \"attempting to grow into something bigger\" - though I accept that got a little lost during my edit.  I don't think \"outlier growth\" is the focus of the site, but rather entrepreneurs who *aspire* to such growth: i.e. people who have \"big\" ideas, irrespective of what they achieve in practice.  Lastly, comments on meta are intended to be used for discussion in a manner not acceptable on main sites.", "CreationDate": "2014-09-24T21:43:30.033", "UserId": 131}
{"Id": 210, "PostId": 96, "Score": 0, "Text": "@eggyal: Okay, good to know comments are different on meta; it'd annoy the $&*% out of me if I posted the question or answer. On an unrelated note, every time I see your name, I think about \"Eggy Inc\" selling shares; maybe we should just call the site [Eggy Inc](http://whois.domaintools.com/eggyinc.com)... :-)", "CreationDate": "2014-09-24T22:00:27.660", "UserId": 551}
{"Id": 256, "PostId": 96, "Score": 0, "Text": "Is referencing Donald Trump really a positive?", "CreationDate": "2014-10-02T11:46:01.463", "UserId": 849}
{"Id": 197, "PostId": 97, "Score": 1, "Text": "See also [Limits for self-promotion in answers](http://meta.stackexchange.com/q/57497).", "CreationDate": "2014-09-24T18:33:56.323", "UserId": 131}
{"Id": 212, "PostId": 100, "Score": 1, "Text": "Related: http://meta.startups.stackexchange.com/questions/17/include-content-from-old-startups-site", "CreationDate": "2014-09-25T22:14:50.990", "UserId": 59}
{"Id": 213, "PostId": 100, "Score": 0, "Text": "While there is definitely some good content in that data, SE considered the site full of junk and closed it. We definitely want a clean start, but feel free to bring over some of your old content if you think it's good.", "CreationDate": "2014-09-25T22:27:34.417", "UserId": 9}
{"Id": 487, "PostId": 100, "Score": 0, "Text": "\"Full of junk\"?  That's a bit harsh.  I would disagree - there was a lot of good content on it, but, as I expect to happen with this site, it will reach a point where very few NEW valid questions will be asked and it will plateau...\nI don't think the site was closed for the reason(s) you think it was closed.", "CreationDate": "2014-12-13T19:17:56.380", "UserId": 1775}
{"Id": 1727, "PostId": 100, "Score": 0, "Text": "@connor: you didn't just close it. You _deleted_ *very* valuable knowledge, such as [this question and its answers](http://web.archive.org/web/20110903064811/http://answers.onstartups.com/questions/19422/if-im-working-at-a-company-do-they-have-intellectual-property-rights-to-the-stu).", "CreationDate": "2015-10-29T08:25:14.100", "UserId": 3640}
{"Id": 1730, "PostId": 100, "Score": 0, "Text": "@DanDascalescu The content [wasn't deleted](http://cdn.sstatic.net/area51/datadumps/122013%20Answers%20Onstartups.zip). If there's something you like from the previous site, you're welcome to post it here as Community Wiki. It wasn't any of us who made the decision to disable the old site, so I don't know why it was done, but I do know that [se] has changed the beta evaluation process since then. The best approach now is to push to keep this site filled with as high quality of content as possible, and if you think pulling choice selections from the old one is a good way to do that, feel free.", "CreationDate": "2015-10-29T09:24:08.323", "UserId": 59}
{"Id": 1731, "PostId": 100, "Score": 0, "Text": "@MatthewHaugen: surprisingly mysterious why OnStartups was wiped out. Anyway, I've raised an [issue about a particular question on meta](http://meta.startups.stackexchange.com/questions/281/recover-specific-google-vs-your-own-ip-question-from-answers-onstartups).", "CreationDate": "2015-10-29T10:05:36.797", "UserId": 3640}
{"Id": 214, "PostId": 101, "Score": 0, "Text": "You stated in the last paragraph that it's not nice to have the whole old site over. What's the reason for this decision? It seems that the two sites have exactly the same scope and about every single question there is  on-topic for this site.", "CreationDate": "2014-09-26T00:30:31.500", "UserId": 878}
{"Id": 216, "PostId": 101, "Score": 0, "Text": "@Pacerier That's addressed [here](http://meta.startups.stackexchange.com/questions/20/what-was-the-problem-with-the-old-site), but basically the old site just became a collection of broad and opinion-based questions that couldn't be answered particularly objectively. In many cases, that led to spam.", "CreationDate": "2014-09-26T00:34:19.630", "UserId": 59}
{"Id": 217, "PostId": 101, "Score": 0, "Text": "Why not close all the opinion-based questions?", "CreationDate": "2014-09-26T00:40:14.813", "UserId": 878}
{"Id": 218, "PostId": 101, "Score": 0, "Text": "@Pacerier As Connor said in his [comment](http://meta.startups.stackexchange.com/questions/100/how-can-i-migrate-my-previous-questions-back-into-the-site/101?noredirect=1#comment213_100) above, we (and specifically, the SE team) wanted a clean start. I can't say I'm personally very aware of the circumstances leading up to the old site getting thrown out, but the fact that it *was* indicates to me that someone, somewhere had a very good reason.", "CreationDate": "2014-09-26T03:00:30.210", "UserId": 59}
{"Id": 1729, "PostId": 101, "Score": 0, "Text": "Closing an entire site because it got spam is a very blunt tool. What about [valuable content](http://meta.startups.stackexchange.com/questions/281/recover-specific-google-vs-your-own-ip-question-from-answers-onstartups)?", "CreationDate": "2015-10-29T08:32:28.747", "UserId": 3640}
{"Id": 222, "PostId": 104, "Score": 0, "Text": "+1 Makes sense, thanks.", "CreationDate": "2014-09-26T21:50:11.903", "UserId": 551}
{"Id": 221, "PostId": 105, "Score": 0, "Text": "+1 Makes sense, thanks.", "CreationDate": "2014-09-26T21:48:28.637", "UserId": 551}
{"Id": 253, "PostId": 105, "Score": 0, "Text": "Your update is on topic, but I don't agree with it, and in fact speaks to one of the core reasons I find SE's \"sites\" approach troubling.", "CreationDate": "2014-10-01T15:31:50.730", "UserId": 551}
{"Id": 224, "PostId": 106, "Score": 1, "Text": "I feel like this is too broad to be answered really effectively. Perhaps some examples would help? If you want to avoid the meta effect (although I doubt that even exists at this point in our development), even just hypothetical ones would work.", "CreationDate": "2014-09-29T05:57:04.743", "UserId": 59}
{"Id": 225, "PostId": 106, "Score": 0, "Text": "+1 @MatthewHaugen: I agree. I'll think more about the topic, but the general gist is that currently it's hard to tell what the current active user value. Meaning I could make choices based on long-term value (aka seo keyword search patterns) - but short-term, it would not be of use. Basic question is how to improve the match of the interest in what I am asking & the usefulness of it.", "CreationDate": "2014-09-29T14:46:20.923", "UserId": 551}
{"Id": 227, "PostId": 106, "Score": 0, "Text": "As for the voting patterns, here's an example of what I mean: [Can someone under 18 start a business in the US?](http://www.brightjourney.com/q/someone-18-start-business-us) vs [How do I start a business as a minor?](http://startups.stackexchange.com/questions/838/how-do-i-start-a-business-as-a-minor).", "CreationDate": "2014-09-29T14:52:00.843", "UserId": 551}
{"Id": 228, "PostId": 106, "Score": 0, "Text": "It looks like you only posted the second question seventeen hours ago, so I'm not really sure what you had hoped for. Are you worried that you haven't yet received a number of up-votes?", "CreationDate": "2014-09-29T18:43:27.447", "UserId": 59}
{"Id": 231, "PostId": 106, "Score": 0, "Text": "Based on my experience, the half-life of votes received by a question on SE (and here for that matter) is normally less than 24-hours; meaning most question receive half of their \"life-time\" votes within one day; clearly there are exception to this, but that's beyond the point, and still accounted for in my reference to the half-life of a questions total votes received. Meaning there's a clear difference between the votes on basically the same question, and I was around when that question was asked on SE and as far as I recall, most of those votes where received on the first day.", "CreationDate": "2014-09-29T21:21:24.777", "UserId": 551}
{"Id": 232, "PostId": 106, "Score": 0, "Text": "I fear there are more factors than simply a community mentality that can lead to questions being taken or votes being given differently. Each question is phrased differently, each community has different traffic patterns, and mostly, each community has different users. I still get a lot of rep points from questions and answers I posted months ago, so I wouldn't try too hard to draw generalizations from a single occurrence. That said, as Connor suggested, feel free to bring up more specific cases and ask for community involvement to help determine more accurate scope boundaries.", "CreationDate": "2014-09-29T23:14:59.080", "UserId": 59}
{"Id": 233, "PostId": 106, "Score": 0, "Text": "\"each community has different users\" is the core of my question; meaning my question is not about scope, but matching content to the community. I'll think more about the question, and post again soon. Thanks!", "CreationDate": "2014-09-29T23:25:34.643", "UserId": 551}
{"Id": 226, "PostId": 107, "Score": 0, "Text": "+1 Good answer based on the question as presented. I agree with Matthew Haugen comment and your position that as is, the question is a bit hard to answer. I'll think more about the topic, but the general gist is that currently it's hard to tell what the current active user value. Meaning I could make choices based on long-term value (aka seo keyword search patterns) - but short-term, it would not be of use. Basic question is how to improve the match of the interest in what I am asking & the usefulness of it.", "CreationDate": "2014-09-29T14:47:11.600", "UserId": 551}
{"Id": 229, "PostId": 107, "Score": 1, "Text": "Don't worry about people on search engines finding your question. Ask your question so that it is on topic for the site and and an answer would be useful to you", "CreationDate": "2014-09-29T20:43:08.963", "UserId": 9}
{"Id": 230, "PostId": 107, "Score": 0, "Text": "Thanks for the feedback. So, my understanding is that most SE traffic comes from search engines, so I disagree on that topic as a result. Also, if I asked questions that would be of use to me, there I wouldn't be posting questions; that might not make sense, but is the case as it relates to me.", "CreationDate": "2014-09-29T21:17:16.943", "UserId": 551}
{"Id": 234, "PostId": 107, "Score": 0, "Text": "SE does hope that sites eventually get most of their traffic (and ad revenue) from search engines. That's one of the metrics they use for how successful a beta is.", "CreationDate": "2014-09-29T23:32:01.430", "UserId": 9}
{"Id": 235, "PostId": 107, "Score": 0, "Text": "The most important metric though is how healthy and productive the community is, which we should focus on more than including seo buzzwords", "CreationDate": "2014-09-29T23:35:49.287", "UserId": 9}
{"Id": 236, "PostId": 107, "Score": 0, "Text": "SEO is not about buzzwords... :-) ...and I agree that the quality of the community is at the core of my question, that being **what is quality content for our community?** My question is an attempt to be productive in discovering that, though very possible there's a better way to do this. Again, thanks!", "CreationDate": "2014-09-29T23:46:56.777", "UserId": 551}
{"Id": 237, "PostId": 108, "Score": 0, "Text": "Related: http://meta.startups.stackexchange.com/questions/13/define-opinion-based-for-startups/14", "CreationDate": "2014-09-30T00:10:07.093", "UserId": 59}
{"Id": 238, "PostId": 108, "Score": 0, "Text": "Also related (and linked to from that): [Good Subjective, Bad Subjective](http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/)", "CreationDate": "2014-09-30T00:10:37.517", "UserId": 59}
{"Id": 239, "PostId": 108, "Score": 0, "Text": "@MatthewHaugen: If the question is truly based on official ethical rules ([see below](http://meta.startups.stackexchange.com/a/109/551)) then this is more related to a legal opinion based on facts, than a subjective opinion based on preferences. Any thoughts on this? Thanks!", "CreationDate": "2014-09-30T00:40:16.623", "UserId": 551}
{"Id": 241, "PostId": 110, "Score": 0, "Text": "Hi, it might worth noting that it appears that you agree with [my existing answer](http://meta.startups.stackexchange.com/a/93/551), but also appears didn't upvote my answer... :-)", "CreationDate": "2014-09-30T20:40:51.423", "UserId": 551}
{"Id": 255, "PostId": 111, "Score": 0, "Text": "+1 Agree, though guess the issues to me is the the site should show questions to people based on the likelihood that they are able to answer the question, not based on which site they happen to browser; meaning questions should be displayed based on tags, not sites. That way, the OP gets the most views on the question by people most likely to answer the question.", "CreationDate": "2014-10-02T11:21:38.377", "UserId": 551}
{"Id": 257, "PostId": 112, "Score": 0, "Text": "Trying to think some of this through myself and I'm curious: If the question you linked to here had been \"How did Uber and AirBnB overcome the chicken and egg customer problem?\" (or perhaps if they'd just chosen one of the two), would that have been better in your opinion. They did give two specific examples that they felt were related enough to their question, so would it be better if they just came out and specifically asked how one of those examples had solved their problem?", "CreationDate": "2014-10-02T18:49:28.167", "UserId": 844}
{"Id": 258, "PostId": 112, "Score": 0, "Text": "@JRWarren: Thanks for the comment. In the case of the question referenced, the if the OP asked about a \"history lesson\" on a company (not companies) - it's possible that someone would have had an answer, but there would not be a singular correct answer. That said, it's clear the OP has a narrowly defined problem, yet refuses to state what it is.", "CreationDate": "2014-10-02T19:11:35.743", "UserId": 551}
{"Id": 259, "PostId": 112, "Score": 0, "Text": "@JRWarren: To me, this is a very common pattern, and one in real life I have a solution for, and to me, that solution applies here too; if you want to be in \"stealth mode\" - then either don't ask questions, or don't reference being in stealth mode.", "CreationDate": "2014-10-02T19:11:50.927", "UserId": 551}
{"Id": 260, "PostId": 112, "Score": 1, "Text": "What makes you think \"Too Broad\" is *not* an acceptable close-vote reason? Or are you just looking to confirm that it is? We'd gladly consider a new, custom VTC reason if need be, but to me, from what you've said, too broad seems appropriate.", "CreationDate": "2014-10-02T19:13:37.323", "UserId": 59}
{"Id": 261, "PostId": 112, "Score": 0, "Text": "@blunders - Yeah, I agree it wouldn't have been a userful question phrased that way. So then if he had asked, \"How can a ridesharing service like Uber overcome the chicken and the egg problem?\" Would that have been better in that it gives a specific example but is not limited to the historic actions of a specific company that no one on this site is likely a part of?  Again, just trying to think through where the line is for how much information should be required for a given question.", "CreationDate": "2014-10-02T19:16:08.020", "UserId": 844}
{"Id": 262, "PostId": 112, "Score": 0, "Text": "@blunders -  I'm not sure it's always about being in stealth mode. I'm sure it is sometimes, and it may be for this person's case. I know you had this issue with at least one or two of my questions.  But for me it isn't so much about being in stealth mode. I honestly believe giving the real life info would detract from the question which would actually more easily be answered with the theoretical information I've given. I'm not saying I'm right, I'm open to discuss it, but I believe that for some questions theoretical info is actually more useful than real data.", "CreationDate": "2014-10-02T19:20:26.153", "UserId": 844}
{"Id": 263, "PostId": 112, "Score": 0, "Text": "@MatthewHaugen: Good question, my goal with this post is to address a pattern that results in an attempt to find a solution. Simple closing questions won't help the OP understand what's going on, since in my opinion the OP is in the position to narrow the question, but decided not to do so; the often cited reason is that the OP has secret information, but in my experience the real reason is secretly they don't want to discover that there are issues with their plan.", "CreationDate": "2014-10-02T19:20:54.533", "UserId": 551}
{"Id": 264, "PostId": 112, "Score": 0, "Text": "\"**I honestly believe giving the real life info would detract from the question which would actually more easily be answered with the theoretical information I've given.**\" - If you truly are not concerned posting information, I would challenge you to clearly and narrowly state the real problems you are facing - and let the results speak for themselves.", "CreationDate": "2014-10-02T19:23:25.867", "UserId": 551}
{"Id": 265, "PostId": 112, "Score": 0, "Text": "@JRWarren: As a side-note, pretty sure that feedback on a given business plan was off-topic, though I might be wrong.", "CreationDate": "2014-10-02T19:25:53.903", "UserId": 551}
{"Id": 266, "PostId": 112, "Score": 0, "Text": "@JRWarren: The line should be that the OP is willingly withholding information that the community believes is vital to addressing the question. For example, imagine a user that has a computer that won't work, but refuses to tell you if the computer has power; not if they can't tell if it does, but that they openly state that they won't tell you because the best answer will cover every possible issue that might need to be considered - including checking to see if the power is on, or that they won't say because it's a secret... :-)", "CreationDate": "2014-10-02T19:30:31.647", "UserId": 551}
{"Id": 267, "PostId": 112, "Score": 0, "Text": "@MatthewHaugen: Thanks for the questions. So, one issue that has not been directly stated is that often feel that an OP doesn't directly link to the company/product in question under the pretext of not wanting to look like a spammer; in thinking about this, but be wrong, but I there's a \"spooler\" formatting that would allow the community on a per user bias if they wanted/needed to know this info, but not providing it when asked is an issue in my opinion.", "CreationDate": "2014-10-02T19:41:50.087", "UserId": 551}
{"Id": 268, "PostId": 112, "Score": 0, "Text": "@blunders - Well, I suppose I would agree with that. I just seem to disagree on what information is vital to which questions.  I'm curious how you determine information is vital to the question? For example in my two most recent questions, you claimed they were duplicates when, in my opinion are as different as a new programmer asking how to use a for loop vs how to use an if-then statement. So it made me feel like someone told me they didn't know the difference between a for loop and an if-then statement and then demanded that I list all the libraries I've imported.", "CreationDate": "2014-10-02T19:43:39.137", "UserId": 844}
{"Id": 269, "PostId": 112, "Score": 0, "Text": "@MatthewHaugen: Yes, \"Too Broad\" is an acceptable close-vote reason, though I feel just like the patent question that the topic need discussion, and I would hope that discussion results in something that would be of use in helping a poster understand how to improve the issues that are specific to wanting a general answer when you're facing a specific problem, or unwilling to share information requested that the community feels is required to answer the question.", "CreationDate": "2014-10-02T19:44:49.880", "UserId": 551}
{"Id": 270, "PostId": 112, "Score": 0, "Text": "@JRWarren: Happy to address that question, but it's unrelated to this topic, or at least directly related, though I would agree that both questions you're referencing likely have the issue that I've raised in this meta question.", "CreationDate": "2014-10-02T19:46:39.343", "UserId": 551}
{"Id": 271, "PostId": 112, "Score": 0, "Text": "@JRWarren: As for the issue of what information is vital, and what is not, I agree it's not 100% black & white. Though I would hope that an OP saying that they have a specific problem, but want a general answer that they clearly state they believe won't related to the problem their facing makes zero since; as I believe is the case in the question I linked to as an example.", "CreationDate": "2014-10-02T19:49:13.937", "UserId": 551}
{"Id": 272, "PostId": 112, "Score": 0, "Text": "@blunders - I don't understand how the question of how you determine what information is vital to the question is unrelated to this topic? I would say it is vital to coming to any conclusion from this discussion.  Again, I'm not trying to argue that I'm right or you're wrong. Just expressing how it felt from my position. And hoping we can all get to a better understanding of this so we not only get better questions but also help the people asking the questions understand why it's necessary.", "CreationDate": "2014-10-02T19:50:22.167", "UserId": 844}
{"Id": 273, "PostId": 112, "Score": 0, "Text": "Wait.. now I'm confused on what I asked that was off topic... since you answered the question I thought you were saying was off topic..", "CreationDate": "2014-10-02T19:50:54.457", "UserId": 844}
{"Id": 274, "PostId": 112, "Score": 0, "Text": "@JRWarren: Guess my filter for what is vital is if an OP post a question on a topic, but refuses to answer questions on the topic - then they're refusing to give vital information. Answer might be to remove a reference to having a problem, providing the information, or closing the question.", "CreationDate": "2014-10-02T19:55:00.480", "UserId": 551}
{"Id": 275, "PostId": 112, "Score": 0, "Text": "@JRWarren: re: \"**now I'm confused on what I asked that was off topic**\" - not clear, what's not clear, please quote what is confusing you.", "CreationDate": "2014-10-02T19:56:13.660", "UserId": 551}
{"Id": 276, "PostId": 112, "Score": 0, "Text": "@blunders \"Happy to address that question, but it's unrelated to this topic, or at least directly related\"  I think I only asked one question, and you at least partially answered it immediately after saying it wasn't related.", "CreationDate": "2014-10-02T19:58:33.327", "UserId": 844}
{"Id": 277, "PostId": 112, "Score": 0, "Text": "@JRWarren: I see. To me the issues of the questions: (1) being a dups of each other; (2) requesting a generic answers to a specific problem and unwillingness to provide information on the problem; -- are different issues/questions. The topic of \"being a dups of each other\" is unrelated to this meta question, and appeared to be the question you wanted an answer too.", "CreationDate": "2014-10-02T20:04:07.483", "UserId": 551}
{"Id": 278, "PostId": 112, "Score": 0, "Text": "@blunders - *my filter for what is vital is if an OP post a question on a topic, but refuses to answer questions*  So if someone asks (another programming example) why a basic for loop isn't working (assume they show basic example code) and someone requests that they list all of the libraries that they've imported for their program (we're assuming a for loop is not part of an external library here), and the asker refuses to give the list because they're confident it's irrelevant, would you want this question to be closed for lack of vital info?", "CreationDate": "2014-10-02T20:05:08.317", "UserId": 844}
{"Id": 279, "PostId": 112, "Score": 0, "Text": "@blunders - I wasn't asking you to describe here why you felt they were dups - I already asked that in the relevent comment thread.  I was using it to make a point that your question made me as the asker feel like you didn't know enough info about the subject to make the judgment of what was vital and what was not. (In reality I don't claim to know your areas of expertise, but this is how your comment came across to me as one asking a question which you perceived as lacking vital info)", "CreationDate": "2014-10-02T20:06:59.533", "UserId": 844}
{"Id": 280, "PostId": 112, "Score": 0, "Text": "@JRWarren: Agree, that's a good example. My response would be if the user requesting the information still believes the information requested is on topic and the OP does not, the user needs to post a comment with a link to a meta with a \"standard\" comment that better explains the issue raised by the user to the OP.", "CreationDate": "2014-10-02T20:18:17.090", "UserId": 551}
{"Id": 281, "PostId": 112, "Score": 0, "Text": "@JRWarren: Beyond that, in my opinion, one core factor in providing the information (putting aside it being truly confidential) is the effort required to provide it. In the example you provided, posting the libraries called by a single loop shouldn't take more than minute; meaning if it takes less than a minute, give it up.", "CreationDate": "2014-10-02T20:18:41.850", "UserId": 551}
{"Id": 282, "PostId": 112, "Score": 0, "Text": "@JRWarren: re: **[It] \"made me as the asker feel like you didn't know enough info about the subject to make the judgment of what was vital and what was not.\"** I see, that's a good point as it relates to the topic, though on \"[How to set early stage revenue goals?](http://startups.stackexchange.com/questions/880/how-to-set-early-stage-revenue-goals)\" I don't believe I made any claim in my comments on the question itself about not providing info, though clear above I did. If you're still concerned about my comments I'd be happy to answer them, on the question, in chat, etc. - but not here.", "CreationDate": "2014-10-02T20:23:35.200", "UserId": 551}
{"Id": 283, "PostId": 112, "Score": 0, "Text": "@JRWarren: If you're still concerned about my comments I'd be happy to answer them, in a [chat](http://chat.stackexchange.com/rooms/17582/discussion-between-blunders-and-jr-warren) that's linked to from that question, but not here.", "CreationDate": "2014-10-02T20:25:45.870", "UserId": 551}
{"Id": 291, "PostId": 112, "Score": 0, "Text": "@blunders - 7 hours ago you directed me to this post through the comments on that question. But again, you're not paying attention to what I'm actually saying but rather picking and choosing the bits you want to.  For example, I've already said that it was not my intention for you to explain why you thought they were duplicates in this thread.  I never wanted you to do that and I never asked you to do that. I was using it to make a point. That point is that (to use Connor's example below) I felt like you were asking what color my computer case is.", "CreationDate": "2014-10-03T02:19:15.200", "UserId": 844}
{"Id": 292, "PostId": 112, "Score": 0, "Text": "@blunders - I get that you THINK the details you're asking for are critical, but I'm trying to get you to consider an alternative option.  What if they're not as critical as you think? What if someone else was fully capable of giving a good answer with the available information? Should the questions still be closed?", "CreationDate": "2014-10-03T02:21:30.257", "UserId": 844}
{"Id": 294, "PostId": 112, "Score": 0, "Text": "Fine, I don't care; to be more clear, I except that everyone but me is willing to put up with it; I don't in real-life, it's a waste of time.", "CreationDate": "2014-10-03T02:46:20.600", "UserId": 551}
{"Id": 286, "PostId": 113, "Score": 0, "Text": "+1 Thanks for an attempt to post an answer; really. Main issue I see that I see this as a generic answer, that doesn't directly response to the patterns I am seeing; those being: \"imagine a user that has a computer that won't work, but refuses to tell you if the computer has power; not if they can't tell if it does, but that they openly state that they won't tell you because the best answer will cover every possible issue that might need to be considered - including checking to see if the power is on, or that they won't say because it's a secret.\"", "CreationDate": "2014-10-02T20:52:09.523", "UserId": 551}
{"Id": 287, "PostId": 113, "Score": 0, "Text": "More to the point, this is the exact pattern present in this [question](http://startups.stackexchange.com/questions/884/how-to-approach-solving-a-chicken-and-egg-customer-problem); happy to dig up other example, but to me this pattern is common, and to some degree, I feel unique to Startups.SE, or at least in my opinion it is.", "CreationDate": "2014-10-02T20:53:17.747", "UserId": 551}
{"Id": 288, "PostId": 113, "Score": 1, "Text": "If withholding those details makes the question impossible to answer and the poster will not provide them then the question will be closed. To use your example whether or not the computer is turned on is an important detail that answerers would need to know, but the color of the computer case is not and should be cleaned out of the post.", "CreationDate": "2014-10-02T20:55:47.930", "UserId": 9}
{"Id": 289, "PostId": 113, "Score": 0, "Text": "Perfectly valid response, though in the case of this question, why am I then only one voting to close the question? (Opps forgot the +1)", "CreationDate": "2014-10-02T21:02:15.203", "UserId": 551}
{"Id": 290, "PostId": 113, "Score": 0, "Text": "Either people disagree or they haven't gone to the review queue yet.", "CreationDate": "2014-10-02T21:10:38.133", "UserId": 9}
{"Id": 295, "PostId": 114, "Score": 0, "Text": "Hmm, it sounds like a good idea overall, but are there not cases where this might prevent some well-researched, broadly-applicable questions from being asked?", "CreationDate": "2014-10-05T08:15:05.643", "UserId": 43}
{"Id": 296, "PostId": 114, "Score": 0, "Text": "I couldn't think of any. If you have an example of one we could use it to refine the reason", "CreationDate": "2014-10-05T21:16:51.473", "UserId": 9}
{"Id": 297, "PostId": 115, "Score": 0, "Text": "As far as you now, SE doesn't offer any form as retargeting for the ADs, right?", "CreationDate": "2014-10-06T04:36:11.807", "UserId": 551}
{"Id": 298, "PostId": 115, "Score": 0, "Text": "Also, I took a look at [our Area51 \"users also committed to\"](http://area51.stackexchange.com/proposals/62811/startups) and nothing jumps out to me; meaning 5% of our Area51 users coming from a given SE is a pretty weak signal in my opinion.", "CreationDate": "2014-10-06T04:36:30.067", "UserId": 551}
{"Id": 299, "PostId": 115, "Score": 0, "Text": "@blunders No, ads are shown at random, based on the votes they receive on the displaying site, so there isn't a way to retarget. At least as far as I know of. And interesting call with the \"users also committed to,\" but be aware that we can only place ads on graduated sites, not betas.", "CreationDate": "2014-10-06T04:43:23.863", "UserId": 59}
{"Id": 300, "PostId": 115, "Score": 0, "Text": "Here's another way to find targets too: [site:stackexchange.com \"a startup\"](https://www.google.com/search?q=site%3Ahttp%3A%2F%2Fstackexchange.com+\"a+startup\"); note that I added \"a\" since without it, number of the results use \"startup\" to mean on load, boot, etc.", "CreationDate": "2014-10-06T04:53:01.420", "UserId": 551}
{"Id": 301, "PostId": 115, "Score": 0, "Text": "Current SE site suggestions might be: [graphicdesign](http://graphicdesign.stackexchange.com/), [ux](http://ux.stackexchange.com/), [programmers](http://programmers.stackexchange.com/), [gamedev](http://gamedev.stackexchange.com).", "CreationDate": "2014-10-06T04:59:29.977", "UserId": 551}
{"Id": 321, "PostId": 115, "Score": 0, "Text": "I don't want to be a killjoy, but <3 questions per day & 44 avid users is a pretty weak position 78 days into beta. So yes, x-ads make sense, but let's also ask - what is it going to take to double the life signs in 30 days, double again in another 45, and keep pushing up? I'm willing to do my bit, but let's recognise that at the moment neither the daily measures nor the quality and breadth have matched (the failed SX beta) answers.onstartups.com", "CreationDate": "2014-10-17T14:25:38.003", "UserId": 425}
{"Id": 322, "PostId": 115, "Score": 0, "Text": "@JeremyParsons you bring up some good points. It may be worth starting a new meta post to see if anyone has any ideas", "CreationDate": "2014-10-17T22:08:29.903", "UserId": 9}
{"Id": 391, "PostId": 115, "Score": 0, "Text": "@connor: No irony lost in the fact that it appeared that both Matthew and you requested actions within SE be taken using consensus, then Matthew unilaterally posts an AD.", "CreationDate": "2014-11-05T15:46:06.417", "UserId": 551}
{"Id": 302, "PostId": 116, "Score": 1, "Text": "My one hesitation about this *is* the programmer-centric design. Many users here happen to be developers, but that's mostly coincidence. Particularly when we're advertising in the same network as SO, CR, CS, Programmers, and all those sites, we want to make sure we don't: A. attract programmers with programming questions, or B. dissuade people with what would be on-topic questions, by making either of those groups think we're another programming site.", "CreationDate": "2014-10-07T05:41:11.503", "UserId": 59}
{"Id": 303, "PostId": 116, "Score": 0, "Text": "So, I like it. But that's my one reservation on it.", "CreationDate": "2014-10-07T05:41:28.570", "UserId": 59}
{"Id": 304, "PostId": 116, "Score": 0, "Text": "@MatthewHaugen: Agree that's possible, and I 100% agree that we don't want some clicking an AD thinking their going to find ABC just to discover it's XYZ. Simple way to address your concerns would be to test the AD with programmers that know of SE - and ask they saw the AD: (1) what the AD says (2) what they'd expect to find clicking the link. On an unrelated note, Physics.SE might be another site that we might get traction. Guessing we should just list the 10 sites traffic wise, state if we're able to post an AD on them, guess at the CTR, and decide if a generic or custom AD site is need.", "CreationDate": "2014-10-07T10:13:56.803", "UserId": 551}
{"Id": 305, "PostId": 116, "Score": 0, "Text": "@MatthewHaugen: Main thing is to get something done.", "CreationDate": "2014-10-07T10:14:46.043", "UserId": 551}
{"Id": 310, "PostId": 116, "Score": 1, "Text": "I really like the chalkboard and flow chart theme of this one.", "CreationDate": "2014-10-16T21:08:44.047", "UserId": 9}
{"Id": 311, "PostId": 116, "Score": 0, "Text": "@connor: Thanks, though a bit odd how you commented less than a minute ago, and it's already got an upvote... :-)", "CreationDate": "2014-10-16T21:11:06.760", "UserId": 551}
{"Id": 312, "PostId": 116, "Score": 0, "Text": "@blunders I'm actually just a sockpuppet of Connor's that up-votes his comments, not a real person.", "CreationDate": "2014-10-16T21:25:34.800", "UserId": 59}
{"Id": 313, "PostId": 116, "Score": 1, "Text": "@MatthewHaugen: Wow; you and your [admin chats](http://cdn.meme.am/instances/500x/55367258.jpg)... :-)", "CreationDate": "2014-10-16T21:30:11.900", "UserId": 551}
{"Id": 314, "PostId": 116, "Score": 0, "Text": "@connor: Just a ping to let you know a two drafts of the AD have been posted above. If you have any mods to request, let me know. Thanks!", "CreationDate": "2014-10-16T23:01:58.633", "UserId": 551}
{"Id": 315, "PostId": 116, "Score": 1, "Text": "@MatthewHaugen: Just a ping to let you know a two drafts of the AD have been posted above. If you have any mods to request, let me know. Thanks!", "CreationDate": "2014-10-16T23:03:06.587", "UserId": 551}
{"Id": 316, "PostId": 116, "Score": 0, "Text": "Nice. I think 001 is my favorite of the two", "CreationDate": "2014-10-16T23:05:32.593", "UserId": 9}
{"Id": 317, "PostId": 116, "Score": 0, "Text": "@Blunders Awesome. Just throwing an idea out there, I wonder whether a whiteboard would work? That might not work as well, I'm not sure. But I think whiteboards are a bit more modern than chalk, and I suspect they're more used in startups, so it could be interesting to see how that would look. I suspect just inverting the colors and maybe applying a scribble effect to the title would be sufficient. Again, just a thought.", "CreationDate": "2014-10-16T23:19:51.927", "UserId": 59}
{"Id": 318, "PostId": 116, "Score": 0, "Text": "@MatthewHaugen: Yep, thought about that too. Since you brought it up, I'll post a version that's a whiteboard.", "CreationDate": "2014-10-16T23:39:37.273", "UserId": 551}
{"Id": 319, "PostId": 116, "Score": 0, "Text": "@Blunders cool, you might want to post it as a separate answer so it can receive individual voting, too.", "CreationDate": "2014-10-16T23:56:59.033", "UserId": 59}
{"Id": 320, "PostId": 116, "Score": 0, "Text": "@MatthewHaugen: Maybe posting it as it's own answer makes sense, though to me it's pretty much the same message, just a different style. (If it's not clear, I posted the whiteboard version above.)", "CreationDate": "2014-10-17T00:18:05.190", "UserId": 551}
{"Id": 323, "PostId": 123, "Score": 1, "Text": "I've marked this featured, so it may get some attention from users on the main site.", "CreationDate": "2014-10-19T03:02:30.513", "UserId": 9}
{"Id": 328, "PostId": 123, "Score": 0, "Text": "Restating what I've already stated in my answer: **Tim Post's public beta announcement \"Put simply, unless we see the site overrun with extremely poor quality questions and spam, and no one doing anything about it, you've got a site.\"** - Simply put, it is my understanding that the stats you're referencing are meaningless as far as SE is concerned. What matters to SE is high quality content and an active community that at is inline with SE's views of how to mod a Q&A site. Until we've got sign-off on the content and community, it does not make sense to focus on anything else in my opinion.", "CreationDate": "2014-10-20T09:57:26.863", "UserId": 551}
{"Id": 329, "PostId": 123, "Score": 2, "Text": "On a more positive note, it looks like the last 10 or so questions are all from new users. People are finding the site.", "CreationDate": "2014-10-20T20:36:08.190", "UserId": 9}
{"Id": 330, "PostId": 123, "Score": 1, "Text": "@connor: Nah, all the new users are just me... :-)", "CreationDate": "2014-10-21T00:47:52.797", "UserId": 551}
{"Id": 332, "PostId": 123, "Score": 0, "Text": "So far, the only answers are avoiding the question! No, metrics aren't everything, but is there seriously no appetite for anything more than community adverts?", "CreationDate": "2014-10-23T06:57:38.130", "UserId": 425}
{"Id": 333, "PostId": 123, "Score": 0, "Text": "I'm interested, have an idea too; email the users directly from the old Startup.SE site requesting they join this site.", "CreationDate": "2014-10-24T22:45:34.247", "UserId": 551}
{"Id": 334, "PostId": 123, "Score": 0, "Text": "So, does your lack of response me your position is that directly engagement of past users is not a good idea?", "CreationDate": "2014-10-25T17:04:03.247", "UserId": 551}
{"Id": 335, "PostId": 123, "Score": 0, "Text": "We're doing the opposite to my question: ideas are coming through in the comments, and the only answers to date are comments! Maybe it's more SE if you start a new meta question with your idea.", "CreationDate": "2014-10-25T19:11:01.013", "UserId": 425}
{"Id": 336, "PostId": 123, "Score": 0, "Text": "Okay, that's fine, posted my comment as a question: [Insert Meaningful Title for Comment Turned Into Question](http://meta.startups.stackexchange.com/questions/128/insert-meaningful-title-for-comment-turned-question)", "CreationDate": "2014-10-25T20:16:23.103", "UserId": 551}
{"Id": 353, "PostId": 123, "Score": 0, "Text": "Oh, well, that idea is dead... Any ideas?", "CreationDate": "2014-10-28T01:53:07.590", "UserId": 551}
{"Id": 385, "PostId": 123, "Score": 0, "Text": "As someone who just stumbled across this site from an advert on another SE site, that is working. Can you get more % of ads?", "CreationDate": "2014-11-03T15:36:57.633", "UserId": 1333}
{"Id": 386, "PostId": 123, "Score": 1, "Text": "Welcome @FionaTaylorGorringe :) Now, invite all your friends too!", "CreationDate": "2014-11-03T15:48:37.983", "UserId": 425}
{"Id": 387, "PostId": 123, "Score": 1, "Text": "@FionaTaylorGorringe: Glad to hear you clicked the AD; [currently the AD is getting 5 clicks a day](http://meta.workplace.stackexchange.com/ads/display/2411). **If you'd like Startups.SE AD to get more views, you need to upvote [it here](http://meta.workplace.stackexchange.com/questions/2411/community-promotion-ads-2014/2966#2966)**; for that matter, anyone reading this needs to do this too!", "CreationDate": "2014-11-03T18:14:58.647", "UserId": 551}
{"Id": 390, "PostId": 123, "Score": 0, "Text": "Where are we on this question? Seems like a waste to be featuring this question on the main site if it's not functioning as it was intended.", "CreationDate": "2014-11-05T15:41:36.830", "UserId": 551}
{"Id": 392, "PostId": 123, "Score": 0, "Text": "The [metrics](http://area51.stackexchange.com/proposals/62811/startups) are creeping up - three \"needs work,\" one \"okay,\" one \"excellent\" (93% answered). Metrics aren't everything, but it's good that nothing's dipping, and that while new questions are few, they're sometimes coming from genuinely new users and are being met helpfully.", "CreationDate": "2014-11-07T14:59:41.467", "UserId": 425}
{"Id": 324, "PostId": 124, "Score": 0, "Text": "Hope I didn't come across as negative. My reason for citing the predecessor wasn't to make an unfavourable comparison, but as a reminder that if its metrics weren't strong enough for the site to make it out of beta, then we need to work hard if this isn't going to fizzle out at an even lower level. To your point that committers haven't come through, how do we engage more from that group, who ought to be willing to be won?", "CreationDate": "2014-10-19T13:36:25.190", "UserId": 425}
{"Id": 326, "PostId": 124, "Score": 0, "Text": "Oh no I completely agree that we're not going to ever leave beta unless we make some improvements. I just meant that the previous site had years to get some of those numbers.", "CreationDate": "2014-10-20T02:05:23.150", "UserId": 9}
{"Id": 327, "PostId": 124, "Score": 0, "Text": "I don't think there's any way to reach out to them. I wish there was a better way to do commitment. It seems like SE doesn't value that promise at all. Joel himself committed, but has not made contributions here unfortunately.", "CreationDate": "2014-10-20T02:07:09.300", "UserId": 9}
{"Id": 338, "PostId": 128, "Score": 0, "Text": "It's also worth noting that Bright Journey is completely independent. I feel like this is something that should be done by stack exchange rather than its users. You may want to talk to a community manager.", "CreationDate": "2014-10-26T15:24:18.163", "UserId": 9}
{"Id": 339, "PostId": 128, "Score": 0, "Text": "@connor: Right, Bright Journey is independent; assumed that was known, but agree it might not be obvious. If SE has a position, I would rather the engage the topic publicly, not in private.", "CreationDate": "2014-10-26T15:27:01.557", "UserId": 551}
{"Id": 340, "PostId": 128, "Score": 0, "Text": "I agree. I'm not aware if they've ever approved or rejected anything like this before.", "CreationDate": "2014-10-26T15:29:31.720", "UserId": 9}
{"Id": 341, "PostId": 128, "Score": 0, "Text": "@connor: Also, I would request given you're expressing concerns about the campaign, that if possible, you post a \"Campaign:\" too, since I agree with Parsons that we need to \"oil the slope\" so to speak.", "CreationDate": "2014-10-26T15:37:44.050", "UserId": 551}
{"Id": 342, "PostId": 128, "Score": 0, "Text": "I'll try and think of some ideas. I wonder if SE would be willing to send out another email to people who committed to this site. Right now 63% signed up and 6.5% fulfilled their commitment.", "CreationDate": "2014-10-26T15:45:59.087", "UserId": 9}
{"Id": 343, "PostId": 128, "Score": 0, "Text": "@connor: Maybe, main issue is that other than knowing who the [SE Community Managers](http://meta.stackexchange.com/questions/99338/who-are-the-community-managers-and-what-do-they-do) are, I know very little about them, how they prefer to get things done, etc.", "CreationDate": "2014-10-26T15:49:51.840", "UserId": 551}
{"Id": 344, "PostId": 128, "Score": 0, "Text": "I can try and point one your way. Keep in mind it is the weekend though", "CreationDate": "2014-10-26T16:01:26.943", "UserId": 9}
{"Id": 345, "PostId": 128, "Score": 0, "Text": "@connor: If you want to, that's fine; there's no rush either, nor am I set on the idea, just attempting work with everyone to keep us moving forward.", "CreationDate": "2014-10-26T16:11:03.573", "UserId": 551}
{"Id": 351, "PostId": 128, "Score": 3, "Text": "**Please don't do that!** Just to clarify (since it's a bit hard to extract the context of that quote): the \"one GOOD use\" I was referring to was the use of the email hash to demonstrate ownership and thus allow authors to claim their posts. NOT the folks who spammed uninterested users.", "CreationDate": "2014-10-28T00:24:15.623", "UserId": 213}
{"Id": 352, "PostId": 128, "Score": 0, "Text": "@Shog9: Thanks for the feedback, I won't use the hashes.", "CreationDate": "2014-10-28T00:35:25.817", "UserId": 551}
{"Id": 337, "PostId": 129, "Score": 0, "Text": "+1 Thanks for the feedback, makes sense, in general having a landing page that is a good idea. So, how do we decide if we're going to do this?", "CreationDate": "2014-10-26T14:50:29.327", "UserId": 551}
{"Id": 346, "PostId": 130, "Score": 0, "Text": "It would help us if you could provide an example question. Right now, this is too broad. Is the question \"Are there marketing disadvantages to accepting payments via bitcoin?\" on topic? I'd say probably. Is \"where can I sell my bitcoins?\" Probably not.", "CreationDate": "2014-10-27T05:32:05.483", "UserId": 59}
{"Id": 347, "PostId": 130, "Score": 0, "Text": "But in general, I agree with Nick, and a question being about payments is not evidence to its being or not being on-topic.", "CreationDate": "2014-10-27T05:32:57.317", "UserId": 59}
{"Id": 350, "PostId": 130, "Score": 0, "Text": "I was thinking of something like \"How to handle incorrect bitcoin payments\"(If they send you to little, what do you do?)", "CreationDate": "2014-10-27T14:25:47.723", "UserId": 132}
{"Id": 349, "PostId": 132, "Score": 0, "Text": "Hey eggy! So, yeah there would be no mass email, that for a number of reason would be bad. I'm planning at least to start emailing users by hand. As for the community, I'm not going to make a judgement about anything out of context. I requested that we QA our communities existing before the current focus on growth, and that request was declined. Area51s are SE's realm; meaning they should be doing this and believe are.", "CreationDate": "2014-10-27T11:44:10.413", "UserId": 551}
{"Id": 354, "PostId": 132, "Score": 0, "Text": "You're making two *huge* assumptions. The first is that SE won't tell why ans.ons was ditched, and the second is that the ans.ons community committed users will, like bulls in a china shop, smash this community to bits. I have no data on the first, so why not ask? As to the second, I am one data point, so judge for yourself. The idea in this question is pretty much orthogonal to Area 51 outreach, and neither touches the far larger community of startup people with no significant SE involvement. It's not either/or, what we need IMO is a range of activities to reach multiple communities.", "CreationDate": "2014-10-28T07:57:03.530", "UserId": 425}
{"Id": 355, "PostId": 132, "Score": 0, "Text": "Just so it's clear, I've been a user on OnStartups, Startups.SE-1.0, BH, and now Startups.SE-2.0... So, agree with Parsons that the idea any user is a bad user needs proof. Also agree about the lack of data supporting SE's choice to kill Startups.SE-1.0...", "CreationDate": "2014-10-28T16:38:35.337", "UserId": 551}
{"Id": 357, "PostId": 134, "Score": 0, "Text": "I'm very interested to know the answer to your question. Other than a gradual build up from search engine traffic and members of other SE sites that happen to wander in (or see one of the ads) I'm not sure where the growth will come from (or maybe that's it?).", "CreationDate": "2014-10-28T21:15:18.903", "UserId": 844}
{"Id": 360, "PostId": 134, "Score": 1, "Text": "To answer your third question, yes SE expect communities to promote and grow themselves. Along with site definition and moderation, SE has a policy of giving much of the control and responsibility to the site's community.", "CreationDate": "2014-10-28T21:43:14.937", "UserId": 9}
{"Id": 362, "PostId": 134, "Score": 0, "Text": "@connor: Please don't speak for SE, SE needs to speak for itself.", "CreationDate": "2014-10-28T21:45:18.833", "UserId": 551}
{"Id": 363, "PostId": 134, "Score": 0, "Text": "@blunders I'm looking for where I saw a statement similar to that. In terms of expected growth, you may want to look at these blog posts. http://blog.stackoverflow.com/2011/07/does-this-site-have-a-chance-of-succeeding/ http://blog.stackoverflow.com/2010/10/when-will-my-site-graduate/", "CreationDate": "2014-10-28T21:49:04.693", "UserId": 9}
{"Id": 365, "PostId": 134, "Score": 1, "Text": "Here's what I was looking for: \"We can come up with budgets and promotions but the means and ideas about how to reach your target audience HAS TO come from you and your community. Has to. Has to, has to, has to! We simply are not experts in your field. We don’t have the the connections nor the experience you bring to the table. You are both our evangelist and our ambassador\" - http://blog.stackoverflow.com/2010/07/the-7-essential-meta-questions-of-every-beta/", "CreationDate": "2014-10-28T21:53:25.307", "UserId": 9}
{"Id": 366, "PostId": 134, "Score": 0, "Text": "@connor: Thanks, though I've never heard of SE offering and/or providing any budget to any SE, and that blog post is very old; meaning [things change](http://discuss.area51.stackexchange.com/questions/5089/next-generation-of-area-51).", "CreationDate": "2014-10-28T22:10:58.683", "UserId": 551}
{"Id": 367, "PostId": 134, "Score": 0, "Text": "It's definitely a few years old, but I think most of the changes they've made to the process are minor and don't change the general philosophy SE has for beta sites", "CreationDate": "2014-10-28T23:00:48.543", "UserId": 9}
{"Id": 368, "PostId": 134, "Score": 0, "Text": "@connor: \"[They (SE)] don't change the general philosophy SE has for beta sites\" - you did look at the [link](http://discuss.area51.stackexchange.com/questions/5089/next-generation-of-area-51) in my comment above, right?", "CreationDate": "2014-10-29T00:54:13.433", "UserId": 551}
{"Id": 369, "PostId": 134, "Score": 0, "Text": "It doesn't look like they're close to launching area 52 and I'm not sure that would even affect current beta sites. Those blog posts are the most recent information I could find. If they've made significant changes, I'd expect they'd be announced somewhere.", "CreationDate": "2014-10-29T01:14:52.917", "UserId": 9}
{"Id": 370, "PostId": 134, "Score": 0, "Text": "@connor: Please request an estimate for an annual budget for Startup.SE from SE so that a plan is able to be crafted around the scope of said budget. Thanks!", "CreationDate": "2014-10-29T12:40:16.643", "UserId": 551}
{"Id": 371, "PostId": 134, "Score": 0, "Text": "I'll ask if they still do that. In that blog post they do say they match effort, and I'm not sure if we've done enough to qualify", "CreationDate": "2014-10-29T20:37:01.160", "UserId": 9}
{"Id": 372, "PostId": 134, "Score": 0, "Text": "Thank you. If they match, marketing it would be good to know what they mean; min, max, themes, insert-some-rule-we-don't-know-about, etc.", "CreationDate": "2014-10-30T00:14:12.187", "UserId": 551}
{"Id": 498, "PostId": 136, "Score": 0, "Text": "\"I think it's best to comment first and explain why the answer doesn't work for you. (...) Personally, I'd give the answerer a chance to edit their answer before downvoting.\" This is so impossibly wrong I cannot bring myself to explain it in a single comment and ended up posting my own answer. What you suggest and was accepted yields the very reason the first startup SE died: excessively fussy moderation, to the point of becoming user hostile, basically killed it.", "CreationDate": "2014-12-16T23:04:05.920", "UserId": 1824}
{"Id": 501, "PostId": 136, "Score": 0, "Text": "@DenisdeBernardy I don't see how this is a moderation issue. I'm suggesting that if users aren't on the same page they use comments to hash it out, but there's no way we can enforce that through moderation.", "CreationDate": "2014-12-17T21:39:14.883", "UserId": 9}
{"Id": 359, "PostId": 138, "Score": 0, "Text": "FCC’s ban does not cover non-commercial messages.", "CreationDate": "2014-10-28T21:40:41.710", "UserId": 551}
{"Id": 364, "PostId": 138, "Score": 0, "Text": "@blunders - I could be wrong, it's been a while since I've read the CAN SPAM act, but it's my understanding that this would fall under their definition of \"commercial\".  Yeah, you're not selling them anything, but you are trying to get them to use this website. I believe they still count that as commercial purposes even though the end user isn't charged for the experience. Like I said, it's been a while since I've read it, but that's my understanding.", "CreationDate": "2014-10-28T21:53:13.093", "UserId": 844}
{"Id": 373, "PostId": 139, "Score": 0, "Text": "Worth trying though unclear where the new visitors would come from unclear it's from the featured startups list, which then begs the question of why they'd promo the startup to people they already know. Would it be possible for you to estimate even roughly the head count of new users that might result from a single post? Thanks for posting an idea!", "CreationDate": "2014-10-30T02:38:36.967", "UserId": 551}
{"Id": 374, "PostId": 139, "Score": 3, "Text": "@blunders The spirit would be in community building. It's important to get new users, but it's also important to keep existent users excited and engaged in the site. Our hope would be that a stronger community could help build up a more solid foundation, which would not only inherently attract outside attention, but also give new users more of a platform off of which to build their time with us.", "CreationDate": "2014-10-30T02:42:13.750", "UserId": 59}
{"Id": 375, "PostId": 139, "Score": 0, "Text": "Sorry, not interested.", "CreationDate": "2014-10-30T02:53:14.603", "UserId": 551}
{"Id": 376, "PostId": 139, "Score": 1, "Text": "I like the idea. As a community building concept, I think it has good potential.  Personally, I don't think I would be interested in participating if it took place before the end of the year.", "CreationDate": "2014-10-30T21:39:25.793", "UserId": 844}
{"Id": 377, "PostId": 139, "Score": 0, "Text": "@JRWarren you bring up a good point. We'd want to schedule this at a time where we think we can get some good participation.", "CreationDate": "2014-10-30T22:30:06.487", "UserId": 9}
{"Id": 388, "PostId": 139, "Score": 1, "Text": "I like it.  Speaking personally, such an idea would have worked on me, if I hadn't already found this site.", "CreationDate": "2014-11-03T20:44:59.373", "UserId": 1083}
{"Id": 379, "PostId": 141, "Score": 0, "Text": "-1 Unclear what time has to do with consensus other than possibly the claim that to achieve a significant sample time is needed, and if that's the case, it's my position that no question has ever reached a significant sample size; for example, the post on provisional moderators has so far had only 205 views, which off the cuff appears to lack significance. Basically, my premise is that SE's use of meta for reaching consensus is flawed.", "CreationDate": "2014-11-02T23:51:43.240", "UserId": 551}
{"Id": 380, "PostId": 141, "Score": 0, "Text": "As for patience, patience requires a reasoning to be of merit. Saying that the community, or a member of it, that they need to be patience should in my opinion be backed up by reasoning that results in an explanation of what is to be gained, and so far, I'm missing such an explanation.", "CreationDate": "2014-11-02T23:55:31.393", "UserId": 551}
{"Id": 381, "PostId": 141, "Score": 0, "Text": "Feel like that this point that when it comes to marketing an SE, it's better that I just go off I my own, collect users on a project unrelated to SE, and then offer to promote the SE based on the community's pitch for doing so.", "CreationDate": "2014-11-02T23:57:26.427", "UserId": 551}
{"Id": 382, "PostId": 141, "Score": 0, "Text": "@Blunders we do the best we can, that's pretty much it. If you have a clever way of getting the community more invested in meta, that would be great to suggest. That's part of what our \"show off your startup\" idea is meant to promote. As for your example of pro-tem appointments, remember, that even that was never *meant* to reach community consensus--it was the team's responsibility. Similarly, the idea of consensus in general is to find enough support for whatever you're hoping to accomplish.", "CreationDate": "2014-11-03T00:35:17.520", "UserId": 59}
{"Id": 383, "PostId": 141, "Score": 0, "Text": "Here on Startups, that threshold is generally pretty low, because us mods don't have a ton to do yet. So if there's an idea that's fully formed and out there, we've probably been reading it the whole time and we'll go to the community team when we can. It's all very subjective, and it can't be quantified in the way that it sounds like you're looking for.", "CreationDate": "2014-11-03T00:36:37.910", "UserId": 59}
{"Id": 384, "PostId": 141, "Score": 0, "Text": "Thank you for your attempts to address my concerns, which in my opinion reflect why meta in my opinion is not fit to be a vehicle for reaching any sort of meaningful consensus within the community; something I personally find important. To that end, appears that I will build consensus behind the the curtains before posting again, much like the mods and SE do already. Lastly, happy to put aside any example, but lacking an example of where a meaningful sample was reached, in my opinion, my point stands.", "CreationDate": "2014-11-03T00:45:43.293", "UserId": 551}
{"Id": 389, "PostId": 143, "Score": 0, "Text": "Very well said, and the various angles are helpful.  Thanks!", "CreationDate": "2014-11-04T17:19:08.260", "UserId": 1083}
{"Id": 396, "PostId": 144, "Score": 1, "Text": "+1 Just to be clear, the \"What do you need for a great MVP landing page?\" sample question would be on the main site, have amoung other tags a show-and-tell tag, and startups would be invited via say email to post an answer, right?", "CreationDate": "2014-11-12T14:50:07.187", "UserId": 551}
{"Id": 400, "PostId": 144, "Score": 0, "Text": "@blunders right. If it's a main site type question, the main site is the place for it. There would be some meta Q&A for reference, I expect.", "CreationDate": "2014-11-13T12:41:06.070", "UserId": 425}
{"Id": 402, "PostId": 144, "Score": 0, "Text": "Might be wrong, but don't see any issue with moving forward with this. Is there anything that you need help or feedback on to make this happen? Thanks!", "CreationDate": "2014-11-13T17:14:49.407", "UserId": 551}
{"Id": 403, "PostId": 144, "Score": 0, "Text": "OK, so let's take our own advice first. This is an idea, but we need to do some customer development to find out if it's a good one. So the question is, do we go to our existing audience and ask who has a startup they'd commit to involving, and use that to bootstrap the test, or do we go to someone who has a significant following outside this space, get their input and ask for their help?", "CreationDate": "2014-11-14T08:14:12.787", "UserId": 425}
{"Id": 404, "PostId": 144, "Score": 0, "Text": "My opinion is that we need to focus on people with big list that are already known in the startup QnA community; for example, smart bear (aka Jason Cohen) or one of SE's co-founders (Joel or Jeff). What is your position? Thanks.", "CreationDate": "2014-11-14T15:06:30.207", "UserId": 551}
{"Id": 406, "PostId": 144, "Score": 0, "Text": "Personally, I'd like to ask Jeff, since within SE, he's like get a massive amount of views for us. Key would be to get users to not only view the listing, but to post a question, or answer a question too; that is, become users.", "CreationDate": "2014-11-14T16:27:19.817", "UserId": 551}
{"Id": 417, "PostId": 144, "Score": 0, "Text": "Yes, I agree. As long as we don't skip the \"ask for their input\" bit.", "CreationDate": "2014-11-15T07:06:28.190", "UserId": 425}
{"Id": 419, "PostId": 144, "Score": 0, "Text": "Agree. So, what format would the ask take, and who is going to ask who? (Fine suggesting/doing both, or letting anyone else including you do it, just don't see any value in not moving forward.) Again, thanks for your interest and willingness to promote the community!", "CreationDate": "2014-11-15T08:26:51.503", "UserId": 551}
{"Id": 426, "PostId": 144, "Score": 0, "Text": "@connor it would be great to get your input", "CreationDate": "2014-11-17T09:27:30.093", "UserId": 425}
{"Id": 435, "PostId": 144, "Score": 0, "Text": "For the first incarnation of this we'd like to keep it pretty general and just give users a chance to tell us about their startup. I like the idea of a focus/ theme for the future though.", "CreationDate": "2014-11-18T00:32:55.293", "UserId": 9}
{"Id": 436, "PostId": 144, "Score": 0, "Text": "I think doing some sort of event with Jeff or Joel would be great. They are busy people though. I know Joel committed to this site, but he hasn't contributed much so far.", "CreationDate": "2014-11-18T00:33:02.203", "UserId": 9}
{"Id": 438, "PostId": 144, "Score": 0, "Text": "@JeremyParsons: Okay, now that you gotten feedback from Connor, where are we at with taking action?", "CreationDate": "2014-11-18T17:20:32.890", "UserId": 551}
{"Id": 444, "PostId": 144, "Score": 0, "Text": "@blunders reading down the comments we haven't nailed the MVP (MVQ?) yet. Prompted by a question from yesterday and Connor's input, do we allow the main site to have questions that are \"Here's my startup: what do you think?\" but only when tagged with, say, **not-general** or some such? We just need one launch question, or to characterise a question we'll allow in spite of the guidelines.", "CreationDate": "2014-11-19T10:01:20.383", "UserId": 425}
{"Id": 445, "PostId": 144, "Score": 0, "Text": "Using meta as a way to brainstorm is not working in my opinion. (I am not trying to avoid the question, just at this point don't feel that even five more comments from now that we'll be doing something.) As for questions on the main site, any questions that follows our guidelines are okay, I don't believe we should make up rules that only apply sometimes, since that in my opinion will be confusing and result in conflict.", "CreationDate": "2014-11-19T14:23:50.893", "UserId": 551}
{"Id": 395, "PostId": 145, "Score": 0, "Text": "Hadn't ever thought of it as a healthy part of the SE model.  I agree that a lot of times questions involve a major assumption that may not be accurate. I also agree that the most helpful, while perhaps not the most direct, answer might include a section explaining why Y is better than X in many cases.  I guess my problem is when the question clearly asked how to do X not whether or not to do X and the answer doesn't even address that.  If it addresses it AND then proceeds to say, \"BUT I'd highly recommend you take a closer look at Y for your situation because...\"  That seems more ideal to me.", "CreationDate": "2014-11-11T22:38:21.263", "UserId": 844}
{"Id": 401, "PostId": 145, "Score": 0, "Text": "@JRWarren My point is that in the SE model, what's ideal emerges from the structures, processes and the community. It may change over time, or between questions of different types - and indeed different SE sites show different patterns. My guess is that most people answering are trying to be maximally helpful, and making all kinds of judgement calls in how to interpret, and how far to deconstruct, questions.", "CreationDate": "2014-11-13T12:51:11.273", "UserId": 425}
{"Id": 393, "PostId": 146, "Score": 3, "Text": "Well this is definitely the most unique idea posted so far. If there's support for it, I definitely think it's worth trying.", "CreationDate": "2014-11-08T20:15:51.297", "UserId": 9}
{"Id": 394, "PostId": 146, "Score": 0, "Text": "I'm fascinated by the idea, and I honestly think it has some cool potential - but the hardest part is probably going to be finding a team (teams?) of people who are willing and able to consistently work on a project like this.  I assume most people on this site already have relatively full schedules.  This might actually provide some decent free exposure for whatever the theoretical startup(s) was, which could be valuable if it was targeting the right demographic...", "CreationDate": "2014-11-10T19:11:02.017", "UserId": 844}
{"Id": 397, "PostId": 146, "Score": 0, "Text": "+1 Bit hard to imagine how this might work, though I'm fine not knowing, largely since I like the idea of virtual teams. So, what would the MVP be for this and would there be any customer development?", "CreationDate": "2014-11-12T14:58:39.837", "UserId": 551}
{"Id": 398, "PostId": 146, "Score": 0, "Text": "So, what would be the first major decision to make? Almost seems like that in itself is a decision that needs to be made.", "CreationDate": "2014-11-12T19:07:47.873", "UserId": 551}
{"Id": 399, "PostId": 146, "Score": 0, "Text": "@blunders Decision 1 (after team forms around initial idea) is - what's MVP. Yes to customer development, though it would have to fit in the spirit of spending (limited) time not cash. As long as people understand this going in, I'd hope that ideas that are realistic within the overall constraints would float to the surface.", "CreationDate": "2014-11-13T12:39:12.770", "UserId": 425}
{"Id": 407, "PostId": 146, "Score": 0, "Text": "@JeremyParsons: Thinking that since the idea is a bit rough at this point it might be better to get people to commit based on some basis before the ideas are voted on, since this way people are committing to the overall project, not a given project within it. Any thoughts, or do you just want to solicit project ideas, allow people to vote as many times as they like, but per vote require that in the comments of the answer they say something like \"+1 I commit to spend X-hours over the next two weeks on this project.\" (This way it's possible for people to be held accountable for votes.)", "CreationDate": "2014-11-14T18:21:26.273", "UserId": 551}
{"Id": 418, "PostId": 146, "Score": 0, "Text": "@blunders: I like your step-by-step approach. Maybe it's three steps. First, \"Are you (provisionally) in?\" -> 6+ people and we bail. Second, \"What's your idea?\" -> shortlist by general vote (i.e. not just the committers). Third, for each shortlisted idea, \"What role(s) would you bid for, and how many hours per week would you commit?\" -> provisional teams formed.", "CreationDate": "2014-11-15T07:12:32.177", "UserId": 425}
{"Id": 420, "PostId": 146, "Score": 0, "Text": "Works for me. Again though, I would strongly request that it be made clear that votes for this project only count if the voters publicly commits by commenting on the question/answer in related to the vote; for example, 5-votes, 1-comment-commit, equals 1-countable-vote.  Agree, and if not, why? If you agree, are we posting a new question, or just updating this question to request comment-commits? Thanks!", "CreationDate": "2014-11-15T08:33:25.473", "UserId": 551}
{"Id": 421, "PostId": 146, "Score": 0, "Text": "I agree with the motivation, but I'm not sure it's achievable. So I'm suggesting three questions, one after the other, with the end result that we either have at least one team, or we stop.", "CreationDate": "2014-11-15T09:07:27.483", "UserId": 425}
{"Id": 422, "PostId": 146, "Score": 0, "Text": "FYI, didn't see your response until now since you didn't use @blunders: in you message.", "CreationDate": "2014-11-16T00:40:55.743", "UserId": 551}
{"Id": 424, "PostId": 146, "Score": 0, "Text": "@JeremyParsons: People responding to three questions is a lot more overhead than a one question, plus there's I see no reason to limit people as a group or as a person two a single team. If a given answer gets commits, and theirs no conficts with the other answers time wise, then don't see a reason to force people to be on a given team/idea. This question itself really is the first question anyway, just without the comment-commits. Any rate, I'll leave it up to you, just providing my take on the topic.", "CreationDate": "2014-11-16T02:19:40.953", "UserId": 551}
{"Id": 425, "PostId": 146, "Score": 0, "Text": "@blunders Forcing definitely mustn't come into it. Maybe the idea that the team pursues is a red herring. All we really need is a bunch of people willing to team. Agreed?", "CreationDate": "2014-11-17T09:24:18.627", "UserId": 425}
{"Id": 427, "PostId": 146, "Score": 0, "Text": "@JeremyParsons: Yes and no. Yes I agree that a good team is all that matters, no I don't agree that a team needs a good idea for motivation. What would people work on if they just agree to work together? (Very possible that I've misunderstood your comment above, if so, just let me know.) Thanks.", "CreationDate": "2014-11-17T13:59:22.747", "UserId": 551}
{"Id": 431, "PostId": 146, "Score": 0, "Text": "@blunders If the point is the challenges we face becoming questions, we just need a start point. Ten minutes, startup weekend style, then start?", "CreationDate": "2014-11-17T18:04:31.037", "UserId": 425}
{"Id": 432, "PostId": 146, "Score": 0, "Text": "Okay, then I'd suggest that once people agree to join, we have a time-boxed chat/Google-hangout session, that way people get/give real-time feedback. Otherwise, the lag in commits to action might result in issues. Main thing in my opinion is to do something at this point and learn based on doing it.", "CreationDate": "2014-11-17T18:21:02.930", "UserId": 551}
{"Id": 433, "PostId": 146, "Score": 0, "Text": "I would personally love something like this! I think though that we would need some organization, but love the idea of making it the community's project. What if we had a couple of teams (2 or 3 people) and team leads. Then each team tackles a portion of the overall project decided by the users. Then a single user is defined as the one who asks all questions, which start with the project name, followed by the team number, then the topic. That way it would be super easy to find all the project's questions, and group them logically.", "CreationDate": "2014-11-17T22:43:50.473", "UserId": 1207}
{"Id": 434, "PostId": 146, "Score": 0, "Text": "@JaredWadsworth: Awesome, thank you for expressing your interest in the idea, I like it too!", "CreationDate": "2014-11-17T23:31:50.337", "UserId": 551}
{"Id": 459, "PostId": 146, "Score": 0, "Text": "Actioning this at [this new meta question](http://meta.startups.stackexchange.com/questions/167/would-you-like-to-be-part-of-a-startups-se-startup/). See you there, I hope!", "CreationDate": "2014-12-04T14:41:09.297", "UserId": 425}
{"Id": 408, "PostId": 148, "Score": 0, "Text": "Thanks for the feedback. Please feel free to create a AD for Startups.SE if you feel you have a better design to present for the community to vote on.", "CreationDate": "2014-11-14T18:30:04.863", "UserId": 551}
{"Id": 409, "PostId": 148, "Score": 0, "Text": "@blunders I like the design and the ad. Only the *destination* you listed is misleading. It's easy to forget that the vast, vast majority of people don't know what we mean by .SE when we become so accustomed to using it ourselves. That's all.", "CreationDate": "2014-11-14T18:31:30.847", "UserId": 152}
{"Id": 410, "PostId": 148, "Score": 0, "Text": "Yes, I understand your point, and if you, or for someone else based on your feedback feels like creating a new banner up to collect votes, awesome. Currently, for now, I've moved onto focusing on other campaign which I hope will being more that roughly 10 clicks a day.", "CreationDate": "2014-11-14T18:47:28.177", "UserId": 551}
{"Id": 411, "PostId": 148, "Score": 0, "Text": "Clearly it's possible that someone such as yourself might see this as an issue, but if that's the case, to me the issue is much larger than a single banner; the dot-SE notation is used all the time and all over SE.", "CreationDate": "2014-11-14T18:48:24.880", "UserId": 551}
{"Id": 412, "PostId": 148, "Score": 0, "Text": "...and that's why we've become blind to it; hence, my meta post.", "CreationDate": "2014-11-14T18:49:39.043", "UserId": 152}
{"Id": 413, "PostId": 148, "Score": 0, "Text": "To me, the overall topic seems more like an Stackexchange.Meta question, or a much larger issue of Startup.SE's brand; clearly, our brand is not \"Startups\" and as you point out, the domain \"Startups.SE\" is already taken.", "CreationDate": "2014-11-14T18:59:39.160", "UserId": 551}
{"Id": 414, "PostId": 148, "Score": 1, "Text": "Thought about your feedback, and while I don't like the \"Site SE\" notation, I do agree using that notation should address issues with using the \"Site.SE\" notation; honestly don't think Startups.SE is getting a meaningful amount of type-in traffic from the AD though, but agree it's an issue. So, is your request simply that \"Startups.SE\" be changed to \"Startups SE\" in the AD, or does the request go beyond that; if so, how?  If that's the only issue, I'm fine just updating the graphic to change \"Startups.SE\" to \"Startups SE\" in the AD.", "CreationDate": "2014-11-14T19:33:02.433", "UserId": 551}
{"Id": 415, "PostId": 148, "Score": 1, "Text": "I think that is sufficient.", "CreationDate": "2014-11-14T22:29:11.473", "UserId": 152}
{"Id": 416, "PostId": 148, "Score": 0, "Text": "Thanks, updated the [AD in active use here](http://meta.workplace.stackexchange.com/questions/2411/community-promotion-ads-2014/2966#2966) to reflect your request that it not use the dot-SE notation.", "CreationDate": "2014-11-15T01:14:31.193", "UserId": 551}
{"Id": 437, "PostId": 150, "Score": 0, "Text": "+1 Main issue is that this functionality would require SE adding code, which short-term is unlikely.", "CreationDate": "2014-11-18T17:18:46.830", "UserId": 551}
{"Id": 439, "PostId": 150, "Score": 1, "Text": "...or not.  They wouldn't have to add any code to have geographic chat rooms.  Just name the room after the geographic location in question. i.e. \"South Florida Startups!\".  Location wouldn't need to be enforced, just encouraged.", "CreationDate": "2014-11-18T17:54:36.217", "UserId": 1268}
{"Id": 440, "PostId": 150, "Score": 0, "Text": "Well, you're always welcome to earn the rep needed to create you own chat rooms and attempt to pull users into chat, but I imagine that would take a massive effort to do based on how chat currently works.", "CreationDate": "2014-11-18T20:16:09.930", "UserId": 551}
{"Id": 446, "PostId": 150, "Score": 0, "Text": "This is a really interesting idea, and I think it speaks to the same kind of notion as [a \"show your startup\" event](http://meta.startups.stackexchange.com/questions/139/what-do-you-think-of-a-show-your-startup-event).", "CreationDate": "2014-11-19T20:41:35.873", "UserId": 59}
{"Id": 447, "PostId": 150, "Score": 0, "Text": "Unfortunately, though, [chat] is pretty quiet as-is, and I fear that filtering down that audience by geography could have two undesirable effects: one, each room would be all the quieter (although that's really just a matter of waiting until we have enough users, and perhaps people would talk more with others in their area), and two, it might make people feel left out who weren't in a covered area. I would hate to see the only contributor from some part of the world feel left out or like they weren't welcome in the community. We really don't want \"cliques\" forming, in other words.", "CreationDate": "2014-11-19T20:41:48.587", "UserId": 59}
{"Id": 448, "PostId": 150, "Score": 0, "Text": "Those shouldn't, of course, be taken as \"this is impossible and we shouldn't do it,\" they're just things to overcome. I do think it's an intriguing idea, and worth exploring, I just don't want our community-building efforts to leave anyone out.", "CreationDate": "2014-11-19T20:44:20.483", "UserId": 59}
{"Id": 442, "PostId": 151, "Score": 0, "Text": "Just another note, until you reach 50 reputation you are only able to comment on your own posts and answers to your questions. In this case, the user wasn't able to comment.", "CreationDate": "2014-11-19T03:08:19.790", "UserId": 9}
{"Id": 443, "PostId": 151, "Score": 0, "Text": "I think they were a low reputation so that might be something to consider in future, Thanks!", "CreationDate": "2014-11-19T06:27:22.140", "UserId": 1482}
{"Id": 441, "PostId": 152, "Score": 2, "Text": "Awesome! Thanks for the clarification! Sorry, still a bit new to the SE community. Just happy to jump in learning on a forum I might actually be able to help build and contribute to.", "CreationDate": "2014-11-18T21:55:24.100", "UserId": 1482}
{"Id": 449, "PostId": 153, "Score": 2, "Text": "I threw out a couple of ideas to get the process moving. They're all community wiki, so feel free to improve them and add your own suggestions.", "CreationDate": "2014-11-19T23:53:59.200", "UserId": 9}
{"Id": 503, "PostId": 153, "Score": 0, "Text": "@connor: (CC @Matthew) How do you want to handle weekly challenges that have been done. One option would be to just post a new question requesting suggestions. Another might be to delete challenge as they're done, and yet another option would be to update the suggested challenge as completed in the answer.", "CreationDate": "2014-12-21T22:46:56.737", "UserId": 551}
{"Id": 505, "PostId": 153, "Score": 0, "Text": "@Blunders that's a very good question. I don't completely love the idea of deleting answers to this post, but it might be the best. I just edited yours as you may have seen to include that it was complete, but I don't know whether there's a nicer way to convey that.", "CreationDate": "2014-12-22T01:29:28.367", "UserId": 59}
{"Id": 506, "PostId": 153, "Score": 0, "Text": "Works for me, thanks!", "CreationDate": "2014-12-22T01:32:04.393", "UserId": 551}
{"Id": 507, "PostId": 153, "Score": 0, "Text": "Yep. It might become a problem down the road if we have tons of answers to this question and the list of complete ones overruns the list of pending ones by vote, but by the time that's an issue, we'll come up with some more clever solution.", "CreationDate": "2014-12-22T01:35:54.863", "UserId": 59}
{"Id": 450, "PostId": 156, "Score": 0, "Text": "I'm all for it... But it might be better to choose the bigger class **social enterprise** (definitions vary, but I like *\"Make money by doing good; do good by making money\"*), which can include non-profit and for-profit.", "CreationDate": "2014-11-20T17:51:39.393", "UserId": 425}
{"Id": 453, "PostId": 164, "Score": 0, "Text": "Thanks for the awesome answer! That clarifies everything - I'll be sure to check if they've accepted answers in the past as that is a pretty good indicator of if they know how to at all. And now I will accept your answer or risk getting way to meta-ironic.", "CreationDate": "2014-11-26T19:41:41.997", "UserId": 1482}
{"Id": 454, "PostId": 164, "Score": 0, "Text": "@Fernando Ha! I had been thinking that when I was writing it, too, about having to ask you to accept this :P. But yeah, I guess the TL;DR version is to do what feels right. If you care enough to bother asking here on meta, you probably have a good sense of what would qualify as annoying to the population and what's acceptable, so just go with your gut. If you think it was an honest mistake, go ahead and remind the poster about it. Otherwise, just hold off. I've had users accept answers *months* after that sort of interaction, and that's always a nice treat in and of itself.", "CreationDate": "2014-11-27T11:49:03.450", "UserId": 59}
{"Id": 455, "PostId": 165, "Score": 0, "Text": "I agree that we should definitely have some policy in place for these. I have no idea about the legality so hopefully we can get an answer from someone more knowledgeable.", "CreationDate": "2014-12-01T21:47:55.360", "UserId": 9}
{"Id": 456, "PostId": 165, "Score": 1, "Text": "One idea could be to add a warning that will appear when a user adds a certain tag such as [tag:legal]. Stack Overflow has a [similar system](http://meta.stackoverflow.com/questions/274632/help-the-helpless-with-how-to-ask-tag-tips/274634#274634) that we may be able to use.", "CreationDate": "2014-12-01T21:49:45.417", "UserId": 9}
{"Id": 458, "PostId": 166, "Score": 0, "Text": "+1 Nice answer. Think you'll find that  those most concerned with the topic are lawyers, not non-lawyers, or sites enabling non-lawyers to give legal advice. Next, given that I've personally given lots of legal advice, my main concern is not so much getting an OP to limit my liability, but that they understand the nature of legal advice, even from a lawyer. Lastly, I don't have a position on dealing with legal questions other than that they're common and often not well handled.", "CreationDate": "2014-12-02T22:14:08.623", "UserId": 551}
{"Id": 504, "PostId": 167, "Score": 0, "Text": "Any thoughts on how to get people to post there name under an answer? Also, just to provide some context, I've upvoted the question, but not the answer, which means two other users upvoted you answer.", "CreationDate": "2014-12-21T23:15:27.297", "UserId": 551}
{"Id": 508, "PostId": 167, "Score": 1, "Text": "I've gone ahead and [tag:featured] this. I'm not really sure it should be, but I definitely think it deserves more attention than it's receiving. I'm still not sure completely what I think of it (it's an awesome idea without doubt, I'm just not sure how it would work in practice). Hopefully this will get some more engagement now.", "CreationDate": "2014-12-23T02:59:44.193", "UserId": 59}
{"Id": 512, "PostId": 167, "Score": 0, "Text": "+1 @matthewhaugen: Thanks!", "CreationDate": "2014-12-23T15:04:35.407", "UserId": 551}
{"Id": 520, "PostId": 167, "Score": 2, "Text": "To make it more awesome, I suggest making the teams do an actual startup with actual money. No one gets the cash, but instead it's donated to charity. This could give Startups a lot of attention. However, you need to solidify the rules a little more. How big are the teams? Who wins? How much time? What qualifies it as a \"major decision?\" What if a major decision is 100% opinion based and can't be asked? Can you post your own answers and/or vote on answers for the decision choosing?", "CreationDate": "2014-12-31T23:41:51.827", "UserId": 127}
{"Id": 525, "PostId": 167, "Score": 0, "Text": "Hmmm... I hate to sound negative but Startup By Committee sounds like a recipe for disaster.  But I hope I'm wrong.", "CreationDate": "2015-01-05T22:00:10.460", "UserId": 210}
{"Id": 528, "PostId": 167, "Score": 0, "Text": "@ClayNichols The point of the (now probably abandoned) idea wasn't to make a big success, but to get some great questions, learn good stuff and give startups.SE users the opportunity to see what happens next.", "CreationDate": "2015-01-06T15:04:59.763", "UserId": 425}
{"Id": 519, "PostId": 168, "Score": 1, "Text": "You have five votes currently, when do you expect to do something and how? Thanks!", "CreationDate": "2014-12-31T16:33:46.343", "UserId": 551}
{"Id": 521, "PostId": 168, "Score": 0, "Text": "Looking for \"comment commits\" - votes are indicators, but not necessarily volunteers!", "CreationDate": "2015-01-03T10:46:27.570", "UserId": 425}
{"Id": 522, "PostId": 168, "Score": 0, "Text": "@Jeremy you are going to need a set definitions of rules and such. I know you want to wait for support before finalizing rules, but it seems like there's people interested but they don't want to commit unless they know what exactly it is (like I am). Small details like how to prevent cheating and such can be finalized later, but give people an idea of what they're in for. Also: if this goes well, it could really create a new concept for smaller sites (http://meta.stackexchange.com/questions/246411/could-se-promote-community-projects-for-smaller-sites)", "CreationDate": "2015-01-05T02:35:14.580", "UserId": 127}
{"Id": 523, "PostId": 168, "Score": 0, "Text": "FYI I'd be interested in joining a chat room on SE sometime to help work out details. I like stuff like this :)", "CreationDate": "2015-01-05T02:44:25.397", "UserId": 127}
{"Id": 524, "PostId": 168, "Score": 0, "Text": "Just not sure what's to be gained by me adding rules, before anyone is in! Provisionally in is good enough to start, and we'll find out what rules we need when we are moving, lean style", "CreationDate": "2015-01-05T15:15:42.693", "UserId": 425}
{"Id": 526, "PostId": 168, "Score": 0, "Text": "At this point it's my position that even requesting a comment to a single pitch is too much and there just needs to be a request to commit to being present on a chat on the topic at a given date and time.", "CreationDate": "2015-01-06T14:11:18.063", "UserId": 551}
{"Id": 527, "PostId": 168, "Score": 0, "Text": "I think this is dead. If we can't muster a handful of \"I'm in\" comments, the launchpad is way too far away. It was fun kicking this around, but as I said to start with, **this is probably a super bad idea** - so no regrets ;)", "CreationDate": "2015-01-06T15:01:36.047", "UserId": 425}
{"Id": 529, "PostId": 168, "Score": 0, "Text": "If that's your position, in my opinion you should update the question above's opening with something like \"**UPDATE -- This project is dead: Reason(s) why...**\" - and ping the mods to remove it from the featured meta posts.", "CreationDate": "2015-01-06T16:10:19.017", "UserId": 551}
{"Id": 1526, "PostId": 168, "Score": 0, "Text": "@Blunders you say that as if we aren't all-knowing ;). Or just super lucky about when we randomly check on things.", "CreationDate": "2015-01-07T07:02:24.420", "UserId": 59}
{"Id": 1527, "PostId": 168, "Score": 0, "Text": "I've dropped the \"featured\" tag (particularly since I said I would after a couple weeks anyway), but I'm sad to see this go. This question and answer have gotten a lot of attention--it's tied as the fourth top post on meta, by votes--but it's definitely true that people will need to see more rules and logistics before it can move forward. I think talking through some ideas on chat could be a great idea, if people were interested.", "CreationDate": "2015-01-07T07:02:43.847", "UserId": 59}
{"Id": 466, "PostId": 172, "Score": 0, "Text": "Those stats are unrelated to the current question, and while you might feel they are, I assure you they are not. If you are concerned about the stats or the status of this SE you need to post a new question, for which you may or may not get an answer that provides the closure you seek. Again, did you or did you not down vote the answer above and if so why?", "CreationDate": "2014-12-13T01:00:43.023", "UserId": 551}
{"Id": 468, "PostId": 172, "Score": 1, "Text": "I don't care about down votes, but I do care about responding to feedback and in my opinion it is required. I've moved my comment to the answer, since to me as is the question's intent appears to have nothing to do with the current site, an everything to do with sites that no longer exist.", "CreationDate": "2014-12-13T01:10:37.780", "UserId": 551}
{"Id": 469, "PostId": 172, "Score": 0, "Text": "I agree with you about the current site being more inline, but I think it still needs a lot of work as it is still not up to par.", "CreationDate": "2014-12-13T01:15:34.913", "UserId": 80}
{"Id": 470, "PostId": 172, "Score": 0, "Text": "@iliveunderawesomerock: Nothing is perfect - and I currently have zero concerns about SE believing the site is not meeting their needs; again, the stats are a legacy of Area51 and if you have questions about them, you need to post a question on Startup SE's meta.", "CreationDate": "2014-12-13T01:21:10.740", "UserId": 551}
{"Id": 471, "PostId": 172, "Score": 0, "Text": "Thank You I will, there is a lot of things that need to be addressed.", "CreationDate": "2014-12-13T01:23:39.150", "UserId": 80}
{"Id": 472, "PostId": 172, "Score": 0, "Text": "If I could have downvoted i would have, but I don't have enough hitpoints to do that.  Can you be a bit more specific?  I don't know what \"more inline with SE's needs\" means.\n\nI have looked through the current site's questions and not sure I want to invest time again only to have the rug pulled out from under me again.", "CreationDate": "2014-12-13T17:10:37.207", "UserId": 1775}
{"Id": 474, "PostId": 172, "Score": 0, "Text": "I agree that you put a lot of effort into Startups-2.0 before it went offline. Given it appears that you've logged into your account on [Bright Journey](http://www.brightjourney.com/u/timj) (Startups-3.0) since it went live, you're aware that all content on SE is user contributions licensed under Creative Commons ([cc by-sa 3.0](http://creativecommons.org/licenses/by-sa/3.0/) with [attribution required](http://blog.stackoverflow.com/2009/06/attribution-required/)) and as such, the idea that SE took something from the community is what it is.", "CreationDate": "2014-12-13T18:18:55.517", "UserId": 551}
{"Id": 475, "PostId": 172, "Score": 0, "Text": "As for the community being more inline with SE's needs, this is my understanding. If you require further clarification then the best way to get this would be from SE, not me, since I am just a single member of the community.", "CreationDate": "2014-12-13T18:20:28.053", "UserId": 551}
{"Id": 489, "PostId": 173, "Score": 1, "Text": "Starting to feel as if your trying to cause issues and unable to let go of the past.", "CreationDate": "2014-12-14T14:15:33.003", "UserId": 551}
{"Id": 490, "PostId": 173, "Score": 0, "Text": "@blunders - I am providing the consensus that was repeated over and over in the previous Q&A site as well as untold posts from incubator management and VC folks.  This is nothing new and has no other meaning.", "CreationDate": "2014-12-15T03:37:48.743", "UserId": 1775}
{"Id": 473, "PostId": 174, "Score": 0, "Text": "My understanding is that long-term this is an option, but short-term that the goal is to focus on the creating new content and building the community, not bulk loading old content. For example, I would much rather Joel be semi-active on the community than just post one or more past answers. Does that address your question? Thanks!", "CreationDate": "2014-12-13T18:02:46.330", "UserId": 551}
{"Id": 476, "PostId": 174, "Score": 1, "Text": "Not really. Expecting Joel to re-do Q&A he has already done on a site that is in its 3rd incarnation is unrealistic.\nI am not sure that the concept of \"creating new content\" is relevant - i am asking specifically about questions already asked on this new site that currently have poor answers, but we have the accepted and highly up-voted answers already on the prior sites.", "CreationDate": "2014-12-13T18:27:15.493", "UserId": 1775}
{"Id": 477, "PostId": 174, "Score": 0, "Text": "If we continue to allow the poor questions and don't take the good content from the previously FAILED startup site(s) I don't see how it is reasonable to expect any different outcome", "CreationDate": "2014-12-13T18:29:09.970", "UserId": 1775}
{"Id": 478, "PostId": 174, "Score": 0, "Text": "My point is not that we redo anything, but that we need a community that responds to active questions in a way that conforms to SE's needs - and that having Joel be active would be better than reposting legacy questions.", "CreationDate": "2014-12-13T18:30:15.030", "UserId": 551}
{"Id": 480, "PostId": 174, "Score": 0, "Text": "Please post a question providing examples questions, answers, comments, etc. on the current site your concerned and you'll get a response. If you would like to suggest an way to do a review of the current content, I'd be happy to help execute such a review. Thanks!", "CreationDate": "2014-12-13T18:35:00.187", "UserId": 551}
{"Id": 481, "PostId": 174, "Score": 0, "Text": "There are a number of questions on the site that have nothing to do with startups.  I have flagged a bunch and I have posted comments on a few.", "CreationDate": "2014-12-13T18:48:52.817", "UserId": 1775}
{"Id": 482, "PostId": 174, "Score": 0, "Text": "This for example:  http://startups.stackexchange.com/questions/1621/why-do-reddit-craigslist-etc-not-develop-their-own-mobile-app, but yet is was answered by a moderator  Ths discussion may be interesting and the answer is a good one - but it has nothing to do with startups", "CreationDate": "2014-12-13T18:50:05.540", "UserId": 1775}
{"Id": 484, "PostId": 174, "Score": 0, "Text": "Please refrain from bring up a number of different issues within a single meta-question. If you have a number of issues, post the most important ones first and allow the community time to respond. Thanks! (Meaning that if you post a new meta question related to each of the concerns you've commented on above I'll respond, otherwise I will not, since I do not want to encourage this pattern of bring up issues.)", "CreationDate": "2014-12-13T18:57:09.660", "UserId": 551}
{"Id": 485, "PostId": 174, "Score": 0, "Text": "Uh, not sure how to respond - you're not a moderator so I'm not sure it is useful posting new questions in meta regarding poor questions on the main site that have already been flagged.  You asked me to point you to examples, which I have done.", "CreationDate": "2014-12-13T19:00:32.073", "UserId": 1775}
{"Id": 486, "PostId": 174, "Score": 0, "Text": "Yes, some users are selected as official moderators, but all users are moderators in the general sense; for example, I am able to vote to close questions, edit content without approval, etc.  Further, I have no reason to believe that my request that you limit questions to singular well defined issues does not conform to SE general approach to processing questions. Comments should be used for responding to the question/answer at hand, not bring up new issues.", "CreationDate": "2014-12-13T19:06:50.790", "UserId": 551}
{"Id": 479, "PostId": 175, "Score": 0, "Text": "Not sure how to respond.  I was a moderator for both previous incarnations.  I hope it succeeds...  I have some serious doubts.", "CreationDate": "2014-12-13T18:34:16.470", "UserId": 1775}
{"Id": 488, "PostId": 175, "Score": 0, "Text": "@Tim those aren't my views, I'm just paraphrasing from some of SE's comments. It's rare that they close a public beta, so they must have seen something they didn't like at onstartups", "CreationDate": "2014-12-13T20:57:35.797", "UserId": 9}
{"Id": 497, "PostId": 175, "Score": 0, "Text": "OnStartups didn't die because the quality of content and moderation was suffering. It died because moderation was actively and neurotically killing the content, owing to SE's inane quality standards (i.e. not the place for opinion based questions). It was basically user hostile.", "CreationDate": "2014-12-16T22:12:31.347", "UserId": 1824}
{"Id": 483, "PostId": 176, "Score": 1, "Text": "Re: \"I'm not sure of the legality of copying from there.\" - a quick review of [Bright Journey's terms of service](http://www.brightjourney.com/nr/terms) appears to show that only SE's content is available under [CC by-sa 3.0](http://creativecommons.org/licenses/by-sa/3.0/). Given that content is in the dump, it would be my position that content should only be sourced from the dump to insure there are no copyright conflicts.", "CreationDate": "2014-12-13T18:52:27.150", "UserId": 551}
{"Id": 495, "PostId": 177, "Score": 2, "Text": "I think this is a pretty awesome idea. I find myself checking out startups more in the past week or so as my curiosity for this seasonal/holiday time's impact on business & generic entrepreneurship is definitely eminent!", "CreationDate": "2014-12-15T17:13:08.077", "UserId": 43}
{"Id": 491, "PostId": 178, "Score": 0, "Text": "Extremely related: [What can we do to double the site's utility, then double it again?](http://meta.startups.stackexchange.com/questions/123/what-can-we-do-to-double-the-sites-utility-then-double-it-again)", "CreationDate": "2014-12-15T04:56:43.147", "UserId": 59}
{"Id": 494, "PostId": 178, "Score": 1, "Text": "Yes, you're over reacting. If you see an issue that needs to be fixed, directly reference it and provide 3-5 real examples. Those stats are a legacy, and have been for years.", "CreationDate": "2014-12-15T13:00:24.720", "UserId": 551}
{"Id": 492, "PostId": 179, "Score": 0, "Text": "These stats are a legacy. For the site to be failing in my opinion it would have to be dead (as in no questions being posted) or have large amounts of content that meets a valid reason to closed/remove.", "CreationDate": "2014-12-15T12:50:18.287", "UserId": 551}
{"Id": 496, "PostId": 179, "Score": 0, "Text": "Another way of looking at this is that there are other betas with [worst stats](http://area51.stackexchange.com/proposals/52070/moderators) than us and if you review their [meta](http://meta.communitybuilding.stackexchange.com/questions) it's clear SE is aware they exist (as in SE is spending time reviewing other topics, such as a [name change for the SE](http://meta.communitybuilding.stackexchange.com/questions/193/changing-the-name-of-moderators-se-the-saga-continues)) - but [never once have the stats been brought up by SE](http://meta.communitybuilding.stackexchange.com/).", "CreationDate": "2014-12-15T17:20:48.100", "UserId": 551}
{"Id": 502, "PostId": 183, "Score": 2, "Text": "yep this is a brilliant idea to pull traffic", "CreationDate": "2014-12-21T22:01:19.457", "UserId": 1111}
{"Id": 509, "PostId": 186, "Score": 0, "Text": "Speaking of \"startup or small business\", would it not be appropriate to rename and recope the site as such?", "CreationDate": "2014-12-23T10:09:46.917", "UserId": 1824}
{"Id": 510, "PostId": 186, "Score": 0, "Text": "@DenisdeBernardy [We've thought about that](http://meta.startups.stackexchange.com/questions/92/is-our-name-appropriate), but it didn't get a ton of traction.", "CreationDate": "2014-12-23T10:18:05.840", "UserId": 59}
{"Id": 511, "PostId": 186, "Score": 0, "Text": "http://meta.startups.stackexchange.com/a/94/1824 gets my vote", "CreationDate": "2014-12-23T10:27:39.543", "UserId": 1824}
{"Id": 513, "PostId": 186, "Score": 0, "Text": "Also, since that post, Community Building (formerly, Moderators) has gotten a name change.", "CreationDate": "2014-12-23T23:41:58.737", "UserId": 9}
{"Id": 515, "PostId": 186, "Score": 0, "Text": "It seems we also hit the Hot Network Questions list.", "CreationDate": "2014-12-26T07:01:40.513", "UserId": 1824}
{"Id": 514, "PostId": 189, "Score": 3, "Text": "So... For lazier readers, the TL;DR version is: \"No, not really, but we'd tolerate such a question if it masquerades as a specific problem.\" :-)", "CreationDate": "2014-12-25T08:18:47.600", "UserId": 1824}
{"Id": 517, "PostId": 189, "Score": 0, "Text": "I literally can distinguish Matthew's posts within the first 10 lines versus any of the other mods here :D +1", "CreationDate": "2014-12-27T14:30:12.630", "UserId": 43}
{"Id": 518, "PostId": 189, "Score": 1, "Text": "@jdero if a post is long enough that you can't see the author listed on the first page of a full HD screen, I'm probably the author.", "CreationDate": "2014-12-27T19:26:09.387", "UserId": 59}
{"Id": 516, "PostId": 190, "Score": 0, "Text": "The ground rules you linked to seem pretty sane imho.", "CreationDate": "2014-12-26T16:05:36.093", "UserId": 1824}
{"Id": 1528, "PostId": 192, "Score": 0, "Text": "I'm cool with whatever the community decides on this. I definitely think we're in need of some tag cleanups (which isn't unreasonable for a small site, still finding its bearings), so I can say on behalf of your moderator team that we'll fully support the conclusions that the community comes to on this, and create appropriate synonyms in line with that.", "CreationDate": "2015-01-09T01:43:51.490", "UserId": 59}
{"Id": 1529, "PostId": 192, "Score": 1, "Text": "As for my personal opinion, I'm with Blunders' [answer below](http://meta.startups.stackexchange.com/a/193/59)--use the most common term. I'm less certain on [tag:ltd] versus [tag:gmbh], because one or both of those might not be clear, depending on the user's location, but I think CEO makes a lot of sense. Then tag synonyms and wikis can handle the rest.", "CreationDate": "2015-01-09T01:45:44.813", "UserId": 59}
{"Id": 1530, "PostId": 195, "Score": 0, "Text": "If this is happening on SE and other sites you need to post this to SE's meta, not here.", "CreationDate": "2015-01-13T18:58:36.457", "UserId": 551}
{"Id": 1531, "PostId": 195, "Score": 1, "Text": "I'm not able to repro this. May I ask which browser you're using? Including the version number, preferably. It might also be useful to include a screenshot of what it looks like for you.", "CreationDate": "2015-01-13T20:52:24.167", "UserId": 59}
{"Id": 1532, "PostId": 195, "Score": 0, "Text": "@blunders Im not sure what youre talking about, this is a stackexchange site. Im not talking about stackOVERFLOW if you mean that...", "CreationDate": "2015-01-13T21:56:50.990", "UserId": 3088}
{"Id": 1533, "PostId": 195, "Score": 0, "Text": "@MatthewHaugen see my edits please", "CreationDate": "2015-01-13T21:59:34.207", "UserId": 3088}
{"Id": 1534, "PostId": 195, "Score": 0, "Text": "You reference SE and SE-meta in your question, so it's unclear how my request that you post to StackExchange Meta is unclear. Why do you feel this question does not belong on StackExchange Meta if it impacts a number of SE sites?", "CreationDate": "2015-01-13T22:02:42.667", "UserId": 551}
{"Id": 1535, "PostId": 195, "Score": 0, "Text": "@blunders While this post may be appropriate for MSE, posting here is acceptable as well. I might migrate it, but either way works.", "CreationDate": "2015-01-13T22:06:59.360", "UserId": 59}
{"Id": 1536, "PostId": 195, "Score": 0, "Text": "@Yorrd thanks for the edit. That's definitely not right! Could you try it in another browser, like Chrome or Internet Explorer?", "CreationDate": "2015-01-13T22:08:51.060", "UserId": 59}
{"Id": 1537, "PostId": 195, "Score": 0, "Text": "Unable to replicate the bug on Firefox Versions 34.0.5 or 35.0 - do you have any additional info?", "CreationDate": "2015-01-13T22:30:38.500", "UserId": 551}
{"Id": 1538, "PostId": 195, "Score": 0, "Text": "@MatthewHaugen I posted here because it does not happen on the Stackexchange Meta page itself. I will try another browser and report back.", "CreationDate": "2015-01-13T22:33:51.083", "UserId": 3088}
{"Id": 1539, "PostId": 195, "Score": 0, "Text": "See the edit please @MatthewHaugen", "CreationDate": "2015-01-13T22:39:25.680", "UserId": 3088}
{"Id": 1540, "PostId": 195, "Score": 0, "Text": "This is odd; firstly because I see `#hlogo a` as `width: 405px`, not `width: 400px` - is it possible that it is using an out-of-date css resource? but secondly because it still shouldn't overlap; do you have any custom fonts / zoom / etc?", "CreationDate": "2015-01-14T14:48:20.883", "UserId": 3117}
{"Id": 1541, "PostId": 195, "Score": 0, "Text": "@MarcGravell yes sorry, it is defined twice, 400px is overridden by 405px. Fonts seem to be standard, zoom level is 0. The strange thing is that this is happening with every browser on that system.", "CreationDate": "2015-01-14T14:51:57.030", "UserId": 3088}
{"Id": 1542, "PostId": 195, "Score": 1, "Text": "@Yorrd I'm having great difficulty reproducing this; I believe that it is happening... but that doesn't make it any easier to fix ;p", "CreationDate": "2015-01-14T15:48:08.210", "UserId": 3117}
{"Id": 1543, "PostId": 195, "Score": 0, "Text": "@MarcGravell well, for me the easy fix is just to remove the width definition (which I dont see a use for anyways, but *please* tell me if Im wrong)", "CreationDate": "2015-01-14T15:49:42.123", "UserId": 3088}
{"Id": 1545, "PostId": 195, "Score": 0, "Text": "@Yorrd: I was able to reproduce the bug by changing the font size in FireFox; press \"CTRL +\" (that is \"Control Plus\") to increase the size and \"CTRL -\" (that is \"Control Minus\") to decrease the size. Given the issue is happening on all browsers for you I'm wondering if the issue is not some system level setting for your font settings. For me with the default setting I had to increase the logo width to 422px before the issue happened. Ctrl+0 (that is a zero) should reset it, or via the menus: View -> Zoom -> Reset.", "CreationDate": "2015-01-14T17:29:54.573", "UserId": 551}
{"Id": 1546, "PostId": 195, "Score": 0, "Text": "@blunders you're the best, I changed the gtk font size to something other than default. However, I still don't see the point of the fixed size... O.O", "CreationDate": "2015-01-14T17:36:31.953", "UserId": 3088}
{"Id": 1549, "PostId": 195, "Score": 0, "Text": "Awesome, please post that as the answer so that it is clear to others the issue has been resolved. As for why they decided to use fixed vs something else, that's a question for SE. Cheers!", "CreationDate": "2015-01-14T19:00:34.277", "UserId": 551}
{"Id": 1550, "PostId": 196, "Score": 1, "Text": "Thanks for answering it, didn't get around to it yesterday :)", "CreationDate": "2015-01-15T07:40:32.387", "UserId": 3088}
{"Id": 1551, "PostId": 197, "Score": 1, "Text": "I think it's a good idea. Young-entrepreneurs should really just be used when age is a critical factor. e.g. the difficulties of registering a business while underage", "CreationDate": "2015-01-17T14:29:44.560", "UserId": 9}
{"Id": 1553, "PostId": 197, "Score": 0, "Text": "@connor: Okay, well I've removed the tag from a number of questions since in my opinion in those cases the tag did not apply; noted this in the comment to the revision. To see the edits you should be able to view them in [my revisions activity list here](http://startups.stackexchange.com/users/551/blunders?tab=activity&sort=revisions).", "CreationDate": "2015-01-21T21:18:19.347", "UserId": 551}
{"Id": 1554, "PostId": 197, "Score": 0, "Text": "Looks fine to me. It seems like a lot of the questions had nothing to do with age or experience at all.", "CreationDate": "2015-01-21T21:46:55.580", "UserId": 9}
{"Id": 1552, "PostId": 198, "Score": 0, "Text": "+1 Awesome, thanks for posting a new challenge!", "CreationDate": "2015-01-19T16:25:33.630", "UserId": 551}
{"Id": 1555, "PostId": 198, "Score": 0, "Text": "I am locally known as the \"pivot guy\" :). I'll try to answer as much as I can", "CreationDate": "2015-01-24T09:47:33.760", "UserId": 1111}
{"Id": 1556, "PostId": 198, "Score": 0, "Text": "Why are all the pivot questions downvoted? They seem pretty good to me", "CreationDate": "2015-01-24T09:50:04.723", "UserId": 1111}
{"Id": 1557, "PostId": 198, "Score": 0, "Text": "@esq It doesn't seem like it's restricted to pivoting. Almost all new questions are receiving at least one downvote", "CreationDate": "2015-01-24T13:17:26.697", "UserId": 9}
{"Id": 1558, "PostId": 198, "Score": 0, "Text": "@connor: Think it might be worth creating a standard AD which is embed in the footer of the body of challenge questions while the challenge is taking place, otherwise it's likely hard to see the question is part of the challenge and would bring more attention to the challenges too; all just my opinion, though I do think the challenges are a great way to grow the site.", "CreationDate": "2015-01-24T16:02:54.270", "UserId": 551}
{"Id": 1559, "PostId": 198, "Score": 0, "Text": "@blunders, I don't think visibility is the problem. This post has gotten a lot of views. People just may not have questions on pivoting, or they may be waiting. Our last challenge, most of the questions came on the last day. Thanks for keeping the momentum going by the way", "CreationDate": "2015-01-24T22:41:04.443", "UserId": 9}
{"Id": 1561, "PostId": 203, "Score": 0, "Text": "Tag is not \"yc-startup-school\" - but \"yc-how-to-start-a-startup\" so no, it appears that \"yc-startup-school\" is not covered.", "CreationDate": "2015-01-26T19:10:36.443", "UserId": 551}
{"Id": 1562, "PostId": 203, "Score": 0, "Text": "As for what would be good questions, basically any question that was a result of the \"how-to-start-a-startup\" class that's on topic on Startups-SE; predicting what would get upvotes, really be useful, etc. - is to hard to do in my opinion.", "CreationDate": "2015-01-26T19:12:18.217", "UserId": 551}
{"Id": 1563, "PostId": 203, "Score": 2, "Text": "@esq I think we could add startup school to the challenge as well. It should use its own tag though (perhaps yc-startup-school).", "CreationDate": "2015-01-26T21:42:23.633", "UserId": 9}
{"Id": 1564, "PostId": 203, "Score": 0, "Text": "+1 on adding the tag, though if it's added to the challenge it should likely be covered in the question above with information on the school, links, etc. in my opinion.", "CreationDate": "2015-01-27T14:12:28.257", "UserId": 551}
{"Id": 1565, "PostId": 203, "Score": 0, "Text": "@blunders I've added some information to the main post", "CreationDate": "2015-01-27T17:59:30.833", "UserId": 9}
{"Id": 1566, "PostId": 208, "Score": 0, "Text": "Re: migrated questions, I think that limitation *is* enforced by the system, but diamond moderators get to bypass it manually. Non-moderators cannot migrate a question *to* [main] (except from meta), nor can they migrate a question *from* [main] (except to meta). When we graduate, a few sites will be populated into our list of user-votable outbound ones, and we'll show up on a few other sites'.", "CreationDate": "2015-01-27T19:51:48.453", "UserId": 59}
{"Id": 1567, "PostId": 208, "Score": 0, "Text": "Historically one on the largest bottlenecks in sites becoming non-beta sites beyond the basics such as traffic and community was that SE appears to have had a hard time rolling out the visual building blocks of a site; believe that they're working on this, but sites like Salesforce-SE met the requirements (per SE) to become a non-beta site, and even after that it was still 6-12 months until the site finally rolled out.", "CreationDate": "2015-01-27T20:43:39.847", "UserId": 551}
{"Id": 1568, "PostId": 209, "Score": 3, "Text": "I've made this community wiki, as is standard with such posts, so I definitely welcome community editors who have things to change. I tagged this [tag:faq-proposed], so I'd like to see it end up in our [tag:faq] some day. Let's make it the best resource we can.", "CreationDate": "2015-01-29T11:34:16.873", "UserId": 59}
{"Id": 1569, "PostId": 213, "Score": 1, "Text": "I like this proposal. I think we need to fix the software tag too, before we start merging questions into it. Right now it's used for startups that develop software and startups that use software.", "CreationDate": "2015-02-08T14:55:01.210", "UserId": 9}
{"Id": 1570, "PostId": 213, "Score": 0, "Text": "@connor Thanks. I now looked a bit into the software tag and I think you're right, it needs to be fixed too. But in my opinion this should not stop us from fixing the application tag (and, by the way, the first two questions already have the software tag anyway).", "CreationDate": "2015-02-08T19:09:49.677", "UserId": 1630}
{"Id": 1571, "PostId": 214, "Score": 0, "Text": "It's unclear what you mean when you say Startups-SE \"should entertain these questions\" - since it appears asking for off-topic questions to be ontopic; if so, you need to present a better case an examples of exactly what you mean and why you believe it's a good idea.", "CreationDate": "2015-02-09T22:18:40.517", "UserId": 551}
{"Id": 1572, "PostId": 214, "Score": 1, "Text": "I mean we encourage pointed 'soft' questions. Such as 'I am thinking about quitting my job and starting a business. What are some resources that would help me along. My background is...'. These types of questions have the potential to becoming hot network questions as well as sticky questions (since they would be common to a lot of people). I found that every time someone asked a vague question at startups-se, they were shown the door. We should maybe suggest that they rephrase and narrow their question down (or perhaps senior members could edit the question to make it widely useful).", "CreationDate": "2015-02-09T22:26:26.773", "UserId": 3096}
{"Id": 1573, "PostId": 214, "Score": 0, "Text": "My experience is that people asking those questions don't have the skills and/or desire to refine the questions. If you believe in your idea your welcome to build a rep and help do what you're saying, though as is I don't agree with your position or feel it's a good fit for SE.", "CreationDate": "2015-02-09T23:05:23.967", "UserId": 551}
{"Id": 1576, "PostId": 217, "Score": 3, "Text": "-1 After searching around I've been unable to find any formal comment by any SE staff on the function of this review; which is not to say there's not, just that I've been unable to find any. What is the point of this?", "CreationDate": "2015-02-16T20:03:51.843", "UserId": 551}
{"Id": 1577, "PostId": 217, "Score": 0, "Text": "@blunders I don't know if you've seen these, but I looked a bit more and managed to find *some* stuff. The first bit (not really anything) is on the MSE question [What are review queues, and how do they work?](http://meta.stackexchange.com/a/161391/263510). That brought me to, ta-da!, [Which questions need Community Evaluation?](http://meta.stackexchange.com/q/161033/263510) and, in turn, [Strategies for handling beta community quality evaluations](http://meta.stackexchange.com/q/115988/263510). None of those are ground-breaking, but at least they're official.", "CreationDate": "2015-02-18T22:13:44.200", "UserId": 59}
{"Id": 1578, "PostId": 217, "Score": 0, "Text": "@MatthewHaugen: Thanks, I'll dig through these more in the next day or so, though I stand by my vote to close, since as is neither the process or the question itself appear to reflect SE's position that they be transparent so the community can learn from the experience. For example, there's no way for me to reproduce the results of the eval here, \"[Strategies for handling beta community quality evaluations](http://meta.stackexchange.com/questions/115988/strategies-for-handling-beta-community-quality-evaluations)\" and if I am unable to reproduce those results, I don't see the point.", "CreationDate": "2015-02-18T22:32:18.467", "UserId": 551}
{"Id": 1585, "PostId": 222, "Score": 2, "Text": "Why is \"Satisfactory\" not okay? Honestly, don't think the average user wants anything more than a satisfactory answer.", "CreationDate": "2015-02-24T00:09:42.440", "UserId": 551}
{"Id": 1590, "PostId": 223, "Score": 0, "Text": "I know other sites have dealt with similar topics. Stack Overflow has no problem with users breaking NDAs while Gardening doesn't allow posts about marijuana cultivation.", "CreationDate": "2015-02-24T23:49:00.373", "UserId": 9}
{"Id": 1591, "PostId": 223, "Score": 0, "Text": "I'm not familiar with the laws in this situation, but I think any posts that are unquestionably illegal in the US, where SE is located, (e.g. growing pot) should be removed.", "CreationDate": "2015-02-24T23:50:41.713", "UserId": 9}
{"Id": 1592, "PostId": 223, "Score": 1, "Text": "This isn't quite the same as breaking NDAs. Breaking an NDA is merely breaking an agreement between two private entities. Actively dodging taxes can [potentially land you in jail](http://en.m.wikipedia.org/wiki/Irwin_Schiff).", "CreationDate": "2015-02-25T06:03:19.370", "UserId": 1824}
{"Id": 1595, "PostId": 223, "Score": 0, "Text": "Voted to close this question as it's too broad in my opinion. If you run across questions that in your opinion have legal issues, then comment on the question, post to meta, etc.  I personally don't feel that making a judgement on questions of this type is needed.", "CreationDate": "2015-02-25T13:15:04.470", "UserId": 551}
{"Id": 1597, "PostId": 223, "Score": 0, "Text": "Minor point, might be wrong too, though as far as I know, in some locations, growing pot in some form is legal in the US.", "CreationDate": "2015-02-25T13:17:23.213", "UserId": 551}
{"Id": 1600, "PostId": 223, "Score": 0, "Text": "@DenisdeBernardy: Keyword in my opinion is \"potentially\" - and to me that does not make the subject of the question illegal, and as such, the question is not of an illegal nature. As for the \"too broad issue\" - my sense is that this question is about all potentially illegal questions, which to me is way, way too broad.", "CreationDate": "2015-02-25T17:52:42.863", "UserId": 551}
{"Id": 1604, "PostId": 223, "Score": 0, "Text": "@blunders: Have you ever seen the argument that having anonymous assets in a tax haven is cool and legal hold up in court against a taxman?", "CreationDate": "2015-02-26T21:54:31.133", "UserId": 1824}
{"Id": 1605, "PostId": 223, "Score": 0, "Text": "@DenisDeBernardy: If there's a paper trail proving all assets are where taxed as required by law, there's no claim to be made. Putting aside the exact question at hand, there are a number of valid and legal reasons to store assets offshore. Again, unless you're able to show there's no legal use for a given question, then in my opinion, there's no proof the question is of an illegal nature unless the OP clear states their intent as such.", "CreationDate": "2015-02-26T22:28:37.473", "UserId": 551}
{"Id": 1596, "PostId": 224, "Score": 0, "Text": "Voted to close this question as it's too broad in my opinion. If you run across questions that in your opinion have legal issues, then comment on the question, post to meta, etc. I personally don't feel that making a judgement on questions of this type is needed.", "CreationDate": "2015-02-25T13:15:58.917", "UserId": 551}
{"Id": 1598, "PostId": 224, "Score": 0, "Text": "Re: \"certain Silk Road developer got arrested after posting a question on Stack Overflow that led to his identity being leaked\" - I'm not aware of any official source that links DPR's post on SE to his attribution in investigation that resulted in criminal charges; my understanding is that this was likely done via \"secret methods & sources\" that were then credited after the fact to a misconfiguration of Silk Road's CAPTCHA; finding his SE post was easy after his true identity was known using an MD5 hash of his email and Gravatar's API.", "CreationDate": "2015-02-25T14:56:48.330", "UserId": 551}
{"Id": 1610, "PostId": 224, "Score": 0, "Text": "Curious; what to you is the difference between our answers?", "CreationDate": "2015-02-27T16:14:10.790", "UserId": 551}
{"Id": 1611, "PostId": 224, "Score": 0, "Text": "@blunders I think there are exceptions to pretty well every rule, and but this is one of those things that we do need some official word on, even if it will sometimes vary. If someone sees a question asking for something unlawful, then posts their own question about something similar, it's unfair of the community to go and delete the second one (all things being equal). So we do need some standard we can fall back on, even if that does include some uncomfortable broadness.", "CreationDate": "2015-02-27T18:25:39.963", "UserId": 59}
{"Id": 1612, "PostId": 224, "Score": 0, "Text": "As for the Silk Road bit, I have absolutely no idea, and offered it more as an example. I do know, of course, that law enforcement officials contacted Stack Exchange privately, so I assume that wasn't for naught. But regardless, you see my point.", "CreationDate": "2015-02-27T18:26:14.610", "UserId": 59}
{"Id": 1613, "PostId": 224, "Score": 1, "Text": "And as for the difference between our answers, I have no idea. There, have an upvote.", "CreationDate": "2015-02-27T18:26:58.207", "UserId": 59}
{"Id": 1614, "PostId": 224, "Score": 0, "Text": "As it relates to DPR, I went back and reviewed everything you've said, and don't see your point, unless it's don't do something illegal, which I would hope is obivious.", "CreationDate": "2015-02-27T18:41:51.773", "UserId": 551}
{"Id": 1615, "PostId": 224, "Score": 0, "Text": "Might be wrong, but in my opinion it's unlikely SE will expand on do not \"engage in any kind of illegal activity\" and for that matter, it would be my advice not to do so.", "CreationDate": "2015-02-27T18:44:23.293", "UserId": 551}
{"Id": 1616, "PostId": 224, "Score": 0, "Text": "@blunders more like \"don't do something illegal, then post about it online.\" But yes, I'd hope that as well to be obvious. And as for the [se] policies on the matter, I suspect you're right that nobody wants unlawful behavior going on, *but* I also think that most users and employees of SE would be advocates for this kind of freedom of speech, as we've each expressed in our answers.", "CreationDate": "2015-02-27T18:52:48.360", "UserId": 59}
{"Id": 1617, "PostId": 224, "Score": 0, "Text": "If you don't do anything illegal, then you don't have to be concerned with that you'll leak any evidence supporting that you did; meaning to me your response might be read as don't get caught, which is, in my opinion, not something that should be said.", "CreationDate": "2015-02-27T19:00:47.340", "UserId": 551}
{"Id": 1621, "PostId": 224, "Score": 0, "Text": "Just thought it would be worth noting that a number of times there's been a new question posted, I've commented that due to the legal nature of the question it's likely best that the OP remove the question, and to my knowledge that every single time the OP has removed the question. Not exactly sure how this related to the question at hand, but thought it might be worth mentioning; clearly all comments to an OP related to my opinions are my opinions.", "CreationDate": "2015-03-03T20:58:06.510", "UserId": 551}
{"Id": 1622, "PostId": 224, "Score": 0, "Text": "@blunders That kind of speaks to my point. You comment to the person and say \"maybe this shouldn't be asked here...\" and they choose to take it down. I think that's completely fine. However, I don't think that it's a job for moderators (diamond or 2k users) or Stack Exchange to delete those borderline questions just because they could be used for evil. That's the real question here: should those questions be closed or deleted, and I don't think they should unless it's *completely* clear that there's something very bad going on, in which case a flag is appropriate.", "CreationDate": "2015-03-03T22:27:06.283", "UserId": 59}
{"Id": 1623, "PostId": 224, "Score": 0, "Text": "I'd be down for moving this to chat if you wanted, by the way. I've said pretty well everything I have to say on the matter, and I don't tend to worry about comment discussions on meta, but chat does tend to be better at discussions just by nature. Your call.", "CreationDate": "2015-03-03T22:28:08.813", "UserId": 59}
{"Id": 1628, "PostId": 224, "Score": 0, "Text": "@MatthewHaugen: it's *completely* clear what is going on in that specific question when you've any familiarity with international tax law: OP wants to create a foundation (a not for profit with no owner) that owns a company (for the limited liability). Make the foundation's purpose be to serve its *beneficiary* (i.e. you), and you've a setup in a *tax-free* jurisdiction that can own assets you have full control of, with *no paper trail* to your name -- in theory.", "CreationDate": "2015-03-07T07:21:46.117", "UserId": 1824}
{"Id": 1629, "PostId": 224, "Score": 0, "Text": "@DenisdeBernardy That's definitely fair. I don't know. This is a tough question, as I said. I feel like in this specific incident, it's not really \"illegal enough\" for me--the asker wasn't asking for something illegal, even if it's pretty obvious that they probably wanted to *use it* for something illegal. I don't know, maybe that doesn't make sense. I'm definitely on the fence with all this.", "CreationDate": "2015-03-07T07:34:24.467", "UserId": 59}
{"Id": 1601, "PostId": 225, "Score": 3, "Text": "Putting aside the issues covered above, just wanted to say thank you for making the effort to improve the site and posting to meta too!", "CreationDate": "2015-02-26T14:52:42.003", "UserId": 551}
{"Id": 1602, "PostId": 225, "Score": 0, "Text": "@blunders Thank you for your comment also. In part, just to know that you recognize my effort to see the community growing diminishes the sentiment I had this morning when I saw the review queue, and make me keep putting faith in this community. Thanks.", "CreationDate": "2015-02-26T17:14:25.317", "UserId": 60}
{"Id": 1607, "PostId": 225, "Score": 1, "Text": "I worry that if we decide to allow wikipedia articles, that's all we would have for tag wikis. They are better than nothing, but they really should be information presented in a way specific to the site. I'm generally not as strict about SE's quality requirements (it's amazing how many times I've been helped by a deleted answer on SO), but I'd agree the cons outweigh the pros here. If a user can't figure out what product market fit is, wikipedia will be at the top of their google search. I don't think there's a big need to copy it here.", "CreationDate": "2015-02-27T02:07:45.910", "UserId": 9}
{"Id": 1608, "PostId": 225, "Score": 1, "Text": "That being said, it is unfortunate that a ban was triggered for what was basically one incident. I'm sorry I can't do anything about that.", "CreationDate": "2015-02-27T02:12:10.837", "UserId": 9}
{"Id": 1609, "PostId": 225, "Score": 1, "Text": "And to second what blunders said, thanks for taking the initiative to try and improve our tags. I think is an important discussion to be having.", "CreationDate": "2015-02-27T02:19:44.483", "UserId": 9}
{"Id": 1619, "PostId": 228, "Score": 0, "Text": "Thank you for your answer. You're right when saying that are 2 disjoint cases in here (my bad!), and I'm glad you answered both. About the MSE question, I understand that two of the four says it is OK, including the accepted one. About the main question I asked, unfortunately, yours diverges from mine, I still believe that in certain cases short pieces of texts not written by me are useful, as I said, I didn't copy an entire Wikipedia topic for the [tag:international] tag. And maybe you do agree with me, otherwise, why would you have accepted one of the excerpts before change your mind?", "CreationDate": "2015-03-02T19:04:54.560", "UserId": 60}
{"Id": 1620, "PostId": 228, "Score": 0, "Text": "I'm just not accepting your answer right now because the main question is for the whole community and I don't want to demonstrate that there's no room for people to give their opinion here. Unfortunately, so far, there was little participation from the community regarding this guideline, that not necessarily has to be the same from others SE site. So apparently, by now, whatever decision is being taken it is OK to the community. And one more time, thank you for exposing your point of view.", "CreationDate": "2015-03-02T19:06:07.847", "UserId": 60}
{"Id": 1631, "PostId": 229, "Score": 0, "Text": "For what it is worth, my position is that we're doing good, but have a long way to go.", "CreationDate": "2015-03-07T18:42:15.447", "UserId": 551}
{"Id": 1625, "PostId": 231, "Score": 0, "Text": "Thought about your request above and willing to attempt to ask questions like this. That said, it would be nice to have a meta that outlines how to ask questions like this, since to me it is not exactly clear how to see this niche of questions; honestly to me these are just questions that are dangerous, since they might lead to being an excuse for questions that are off topic, but that's just my opinion.", "CreationDate": "2015-03-05T17:16:01.873", "UserId": 551}
{"Id": 1658, "PostId": 231, "Score": 2, "Text": "I think the more mechanical \"starting a start-up\" questions stem from the sheer fact that way more people are interested in starting a start-up than the number of people who actually do it, and have questions about sustaining it. I would propose that a large number of users are here because they fall into that first category.", "CreationDate": "2015-03-26T12:51:36.087", "UserId": 4036}
{"Id": 1626, "PostId": 232, "Score": 1, "Text": "Do you have some examples of questions that are being closed and some which aren't?", "CreationDate": "2015-03-05T19:38:17.477", "UserId": 59}
{"Id": 1627, "PostId": 232, "Score": 0, "Text": "Already mention this in chat, but there's in fact one question that promoted me to post this, that being: [Keeping the international team connected](http://startups.stackexchange.com/questions/3605/keeping-the-international-team-connected)", "CreationDate": "2015-03-05T22:17:07.900", "UserId": 551}
{"Id": 1630, "PostId": 234, "Score": 0, "Text": "If an user posts a question that's off-topic, answer it in chat, or edit the question to be on-topic. As is, the question is off-topic, and the current answers, including yours in my opinion are link only answers. As for, \"Else this site is useless\" - I disagree, and don't see any value or for that matter logic in such a claim.", "CreationDate": "2015-03-07T18:35:50.153", "UserId": 551}
{"Id": 1632, "PostId": 234, "Score": 1, "Text": "I mean no offense, but that's because you're not out of school yet. Seriously. When you'll create your first company, you'll find that the type of non-actionable questions and answers that you and other students occasionally write are simply not useful to those who have an actual, operational problem to solve -- like, right now. If this site is going to succeed, it needs to cater to the latter folks. And to hell with SE Q&A guidelines if that means answering list-of types of questions that are actually useful to folks who need to solve genuine operational problems.", "CreationDate": "2015-03-07T23:25:31.220", "UserId": 1824}
{"Id": 1633, "PostId": 234, "Score": 0, "Text": "**\"to hell with SE Q&A guidelines\"** - think it's clear that you have an agenda, and in my opinion, that agenda is not welcome here, or for that matter, as I am sure you know, anywhere on SE. Stop being  troll.", "CreationDate": "2015-03-08T01:46:33.033", "UserId": 551}
{"Id": 1634, "PostId": 234, "Score": 1, "Text": "@blunders: It's not about having an agenda, and I'd appreciate if this discussion didn't follow Godwin's Law by going down the lane of ad hominem. Per [this site's tour page](http://startups.stackexchange.com/tour): we're \"a question and answer site for entrepreneurs\" and \"Focus on questions about an **actual** problem you have faced.\" What tools to use in order to manage a remote team fits that description quite well in my opinion.", "CreationDate": "2015-03-08T09:20:27.077", "UserId": 1824}
{"Id": 1635, "PostId": 234, "Score": 0, "Text": "You've clearly stated you have an agenda and I've told you the place for it is SE-meta; happy to dig up evidence supporting this if needed. The ban on \"list of\" questions has always accounted for \"real problems\" and they're not an excuse to allow them.", "CreationDate": "2015-03-08T11:49:23.100", "UserId": 551}
{"Id": 1636, "PostId": 238, "Score": 0, "Text": "For the time being, I've locked the question in its initial state and purged the comments.", "CreationDate": "2015-03-15T03:18:05.980", "UserId": 9}
{"Id": 1637, "PostId": 238, "Score": 0, "Text": "As a side note, \"I was hoping the mods would intervene,\" the site is growing to the point where mods may not be able to read every question that has activity. I'm directing this at all users involved, not just you: if something like this occurs (edit wars, comment disputes), it's best to take a step back, flag the post using the \"other\" reason, and clearly state what's gone wrong. A meta post for this is also definitely appropriate, but civility needs to come first, and arguments in comments rarely remain civil.", "CreationDate": "2015-03-15T03:39:21.413", "UserId": 59}
{"Id": 1638, "PostId": 238, "Score": 1, "Text": "Well, I did flag the comments as inappropriate, I was hoping it would put them on your radar.", "CreationDate": "2015-03-15T07:19:05.117", "UserId": 3110}
{"Id": 1639, "PostId": 238, "Score": 0, "Text": "Yep, and it did. Connor handled those flags implicitly by purging comments, then he rightfully locked the post. It's definitely all good this time, but I meant more generally, the clearer a flag is (in exceptional cases like this, the \"other\" flag is the only way to make it clear), the more likely the case will be resolved appropriately. Even with the tools available to us as users and moderators, sometimes nuances and subtleties slip through the cracks. But again, no worries on this time around. I just say this in case a similar case arises in the future.", "CreationDate": "2015-03-15T10:56:10.063", "UserId": 59}
{"Id": 1640, "PostId": 238, "Score": 0, "Text": "Speaking more specifically on this one, I suspect you'll be able to open up a much more civil and productive conversation if you edit this post to make it more about the actions rather than the user. In other words, you mention rep level a few times, and rep doesn't affect the okay-ness of any actions here on Stack Exchange. I'm withholding personal judgment for now on this specific case, but regardless of its outcome, I'll bet everyone will be happier with whatever conclusions are drawn if we keep the conversation about the scenario, and not the people involved. If that makes any sense.", "CreationDate": "2015-03-15T11:02:47.110", "UserId": 59}
{"Id": 1642, "PostId": 238, "Score": 0, "Text": "@DenisdeBernardy Forgive me, it's late in my time-zone--which user? And what do you mean by \"called out?\" In general, I prefer to leave involvement up to the user themselves, rather than forcing their name into a conversation which, as I noted in a previous comment, should really be about activities performed, and not who performed them. Anyone can find who it was with a little digging, but I hope that doesn't become the focus of this. As for private communications we hold with any user, we aren't allowed to publicly discuss moderator messages we do or do not send.", "CreationDate": "2015-03-15T11:22:12.267", "UserId": 59}
{"Id": 1644, "PostId": 238, "Score": 2, "Text": "@MatthewHaugen the reason I mentioned rep level is because it allowed the member to edit the question without oversight. My edits had to go through approvals (which in this case was that same member who rejected - and the OP who approved).", "CreationDate": "2015-03-15T19:30:02.783", "UserId": 3110}
{"Id": 1645, "PostId": 238, "Score": 1, "Text": "@littleadv Yeah, for sure. I know. But my point is the edit privilege doesn't matter--the other involved user isn't allowed to do more than you are, it's just that they're trusted by the system to do the right thing without supervision. Sometimes that works, sometimes it doesn't, but it's a relatively arbitrary system to allow the broad improvement of [se] sites.", "CreationDate": "2015-03-15T21:30:27.420", "UserId": 59}
{"Id": 1646, "PostId": 238, "Score": 0, "Text": "I don't mean you should leave out these details about the OP's approval, just that you should phrase your question about the activities. Because if you're asking if high-rep users are allowed to do things that you aren't, the answer to that is no, regardless.", "CreationDate": "2015-03-15T21:30:35.643", "UserId": 59}
{"Id": 1656, "PostId": 242, "Score": 0, "Text": "This is unfortunate, because so many on-topic questions can't really be answered because they require more information about each specific instance... which would make the question off-topic.", "CreationDate": "2015-03-26T12:41:42.473", "UserId": 4036}
{"Id": 1657, "PostId": 242, "Score": 0, "Text": "Consider, for example, someone asking if their acquisition rates are healthy. Nobody can say without knowing what kind of business they have and if they are not healthy, nobody can advise on why or how to fix it without seeing the business (website) to know what's wrong. The site could be poor, the wording could be bad, the application process could be confusion etc. etc. etc. \n\nUltimately, however, the OP will never get an answer because the questions he needs to ask are off-topic.", "CreationDate": "2015-03-26T12:44:37.193", "UserId": 4036}
{"Id": 1647, "PostId": 244, "Score": 0, "Text": "Might be wrong, but the OP and community clearly appear to believe that there is information present on the homepage of the link provided that's not present in the answer, and more importantly, that the OP has decline to add to the question itself. Am I missing something?", "CreationDate": "2015-03-19T16:00:21.647", "UserId": 551}
{"Id": 1648, "PostId": 244, "Score": 2, "Text": "For what it's worth, I think your last sentence is really important--I've taken notice to a number of cases over the last few months where a new, sometimes misguided and sometimes not even, user posts a link to their own site in an otherwise completely relevant, acceptable-quality post, and suddenly they receive the wrath of our community through downvotes, passive aggressive edits, and even spam flags..", "CreationDate": "2015-03-19T18:04:41.433", "UserId": 59}
{"Id": 1649, "PostId": 244, "Score": 3, "Text": "I'd hate to be a new user, excited about my own product (which is most of the \"spam\" we get), who comes trying to share information or get help, and just gets yelled at for not knowing a rule that's fairly localized to the [se] network. Some users deserve it, for sure, but spam flags carry some pretty heavy restrictions with them, against the user and sometimes the user's IP address. We need to change our attitude a bit for these new users to better follow our \"Be Nice\" policy here, and to try and teach them the right way to make posts, rather than assuming everyone knows and ignores it.", "CreationDate": "2015-03-19T18:06:51.520", "UserId": 59}
{"Id": 1650, "PostId": 244, "Score": 2, "Text": "@blunders: You might be missing something in the sense that, here or in [this](http://meta.startups.stackexchange.com/questions/238/so-the-highest-rep-decides-he-knows-better-than-the-op-what-is-being-asked) or [that](http://meta.startups.stackexchange.com/questions/232/list-of-questions-whats-the-deal) or other questions, you seem to be focusing on the letter of the rule instead of on its spirit.", "CreationDate": "2015-03-19T20:41:38.950", "UserId": 1824}
{"Id": 1651, "PostId": 244, "Score": 0, "Text": "Very aware of the spirit of the law.  For example, link only answers in my opinion are comparable in this case to the OP refusing to embed the information present on their site in the question itself.  Just to be clear, are you agree that the OP is correct in refusing to embed the information on their site in the question itself, and if so, why? Second, have you reviewed the OP's site, and if so, in your opinion what is the nature of the OP's business based on what the website states, not what is stated in te question. Lastly, I agree there's a pattern, just disagree about who's wrong.", "CreationDate": "2015-03-19T21:50:28.347", "UserId": 551}
{"Id": 1652, "PostId": 244, "Score": 0, "Text": "Worth noting that I personally no longer view votes on meta on any merit, since they're to easy to game. If you have a valid point, please feel free to let me know I've missed it. Otherwise, \"No Solication\" is very common in business networks, I personally feel you have a conflict on interest in the topic and are failing to acknowledge this; simple review of you profile and answer would quickly show you solicate users all the time.", "CreationDate": "2015-03-19T21:57:16.290", "UserId": 551}
{"Id": 1653, "PostId": 244, "Score": 2, "Text": "As a long time SE user, I assume you're already aware that voting on meta is on an agree/disagree basis.", "CreationDate": "2015-03-20T00:18:30.430", "UserId": 1824}
{"Id": 1654, "PostId": 244, "Score": 2, "Text": "For the rest, OP's site struck me as that of a designer who loves comics. And as to my solicitating users you'll be hard pressed to find more than a few gentle nudges to get in touch, which is hardly all the time or a conflict of interest. Plus, that user needs a cofounder or at the very least some help. I'm incidentally both qualified and open for work. If you sincerely think I should look for work or clients by crawling under a rock and hoping when a potential opportunity shows up, I can only laugh out loud and wish you luck finding work or clients when the time comes on your end.", "CreationDate": "2015-03-20T00:51:10.207", "UserId": 1824}
{"Id": 1655, "PostId": 244, "Score": 4, "Text": "Hey folks. I'm the OP from the question. I never intended for people to buy off the site. I was posting it, because it adds more clarity to my question. People would be able to look around and find what they want. Either way, the link has been removed just so I don't appear to be disrespecting the site rules or people.", "CreationDate": "2015-03-20T13:03:54.917", "UserId": 461}
{"Id": 1709, "PostId": 245, "Score": 0, "Text": "I don't know why you got down voted, seems to me you did the correct thing.", "CreationDate": "2015-08-10T14:41:59.627", "UserId": 4161}
{"Id": 1659, "PostId": 246, "Score": 4, "Text": "Well it appears there are some people stopping by to vote on meta.", "CreationDate": "2015-05-01T02:40:14.167", "UserId": 9}
{"Id": 1661, "PostId": 246, "Score": 0, "Text": "+1 @connor: Thanks, posted a followup question to chat for the mods; please take a look, thanks!", "CreationDate": "2015-05-07T16:13:17.240", "UserId": 551}
{"Id": 1704, "PostId": 246, "Score": 0, "Text": "Our chat has been quiet for a while. I've featured this post to see if we have any ideas to get it going again.", "CreationDate": "2015-06-21T13:11:50.497", "UserId": 9}
{"Id": 1660, "PostId": 247, "Score": 0, "Text": "+1 Always wondered this, but under the questions tab on the main site is a [frequent](http://startups.stackexchange.com/questions?sort=frequent) sub-tab.  Does this list relate to this question, and if not, why? Also, curious if you know how the results for this tab are generated, any idea? Thanks!", "CreationDate": "2015-05-07T16:05:38.330", "UserId": 551}
{"Id": 1673, "PostId": 247, "Score": 0, "Text": "@Blunders I just realized I never responded to this, sorry. I don't know the algorithm behind the \"frequent\" tab, unfortunately, but yes, I would consider this meta post to be a human-parsed version of those questions. Doing something manually, as I imagine we all know, tends to give better data (*tends* being the operative word) for things like this, and it's quite possible that there's a canonical question begging to be asked that nobody has thought of yet. In an ideal world, I think that tab would relate to the first of the two reasons for this post, but the second is the main goal now.", "CreationDate": "2015-05-11T18:46:00.217", "UserId": 59}
{"Id": 1676, "PostId": 247, "Score": 0, "Text": "Might be worth knowing how that list is put together (aka the algorithm) so that we're able to decide if it's worth sourcing and monitoring that list to populate this list. And, ha... \"quite possible that there's a canonical question begging to be asked that nobody has thought of yet\" -- sure there still 1000s waiting to be asked, in fact, was talking to a mod of the prior Startup-SE and they said duplicate questions was on of their main pain points.  Any rate, this is an excellent idea! Thanks.", "CreationDate": "2015-05-11T23:12:53.777", "UserId": 551}
{"Id": 1677, "PostId": 247, "Score": 0, "Text": "Per an SE dev, [here's how \"frequent-sort-function\" roughly works](http://meta.stackexchange.com/questions/172726/whats-the-frequent-sort-function); which to me seems a bit odd, but maybe it's me.", "CreationDate": "2015-05-12T05:09:00.873", "UserId": 551}
{"Id": 1678, "PostId": 247, "Score": 0, "Text": "@blunders Which part seems odd about it?", "CreationDate": "2015-05-12T05:21:33.630", "UserId": 59}
{"Id": 1679, "PostId": 247, "Score": 0, "Text": "Duplicate questions are not the same thing as a link within a question to another; not even close in my opinion. Since the tab is under questions, which makes in my opinion the tab sound like a FAQ tab, but it's a frequently linked to tab unless I'm missing something. Anyway, that tab as it relates to this question, in my opinion, is not as useful as I thought it might be.", "CreationDate": "2015-05-12T06:18:10.330", "UserId": 551}
{"Id": 1683, "PostId": 247, "Score": 0, "Text": "If you have any suggestions for hunting questions like this, please let me know; for example, [here's what appears to be all the dups on Startup-SE per Google](https://www.google.com/search?q=site%3Astartups.stackexchange.com+%22This+question+already+has+an+answer+here%22) -- though this [list appears to be more complete](http://startups.stackexchange.com/search?q=duplicate%3Ayes). Thanks!", "CreationDate": "2015-05-12T06:34:58.453", "UserId": 551}
{"Id": 1672, "PostId": 254, "Score": 2, "Text": "Do you have some examples of questions where you feel the answer should have been accepted? There are a few reasons why someone may leave one without an \"official\" answer of sorts, including that they didn't feel it answered the question completely, they wanted to wait for a little while to see if a better one came in (and/or they forgot), or they don't know how. Knowing a few questions for which this is the case could help us narrow down the possible cause, and in turn perhaps find a solution.", "CreationDate": "2015-05-11T18:42:32.543", "UserId": 59}
{"Id": 1674, "PostId": 254, "Score": 0, "Text": "While I don't have stats to back this up, I don't believe that Startups-SE has an overly high count of questions where an answer has not been selected from the answers present when compared to other SE sites. I personally try to select an answer, in part because it makes it easier to see where in fact a good answer is missing. In the end, I personally think most users would get more rep by answering more questions than trying to get an OP to select an answer. That said, this is in my opinion an issue worth talking about. Cheers!", "CreationDate": "2015-05-11T20:00:17.587", "UserId": 551}
{"Id": 1675, "PostId": 254, "Score": 1, "Text": "I will try and find some examples. Even if it isn't currently a problem it would be nice to get more questions closed for the community. I just wanted to get a thread going for a discussion on increasing the close rate", "CreationDate": "2015-05-11T20:49:32.663", "UserId": 4468}
{"Id": 1681, "PostId": 254, "Score": 1, "Text": "Possible that you might be able to find examples using the [Stack Exchange Data Explorer](https://data.stackexchange.com/) and build a search for questions that have not accepted an answer where an answer has 2+ more upvotes than the question itself; no idea how to do this, but if it's possible, then this pattern might make it easier to find examples without even having to review the questions & answers by hand that don't hand an accepted answer yet.", "CreationDate": "2015-05-12T06:26:45.037", "UserId": 551}
{"Id": 1682, "PostId": 254, "Score": 1, "Text": "Also, I would highly suggest that you don't go around suggesting that someone select an answer; meaning not sure where this is going and that's fine, but please don't read my support of you looking into this as an endorsement go \"knocking on doors\" to get users to select an answer. Again, thank you for your interest in improving the site!", "CreationDate": "2015-05-12T06:28:52.673", "UserId": 551}
{"Id": 1684, "PostId": 254, "Score": 0, "Text": "Here's a [query on the main site](http://startups.stackexchange.com/search?tab=votes&q=answers%3a1%20score%3a2%20hasaccepted%3ano) that might be of use in finding examples.", "CreationDate": "2015-05-12T06:39:13.857", "UserId": 551}
{"Id": 1685, "PostId": 254, "Score": 1, "Text": "Don't worry I don't intend to start badgering users to accept answers, I'm not trying to cause trouble. I just wanted to get a discussion going about this :)", "CreationDate": "2015-05-12T09:03:39.283", "UserId": 4468}
{"Id": 1688, "PostId": 257, "Score": 1, "Text": "Please point to any notable source that states a question being unanswered is an issue. Also, I my opinion if you feel there's a pattern, wouldn't make sense to talk about the pattern and provide example too?  As for why the prior site got shutdown, that matter has come and gone.  If SE has an issue, it's their responsibility to express it; I'm not aware of any issues SE currently has with the site.  Basically I don't agree, and more importantly, if you feel the site lack quality questions best way to solve it in my opinion is to start asking questions.", "CreationDate": "2015-05-12T22:50:22.500", "UserId": 551}
{"Id": 1689, "PostId": 257, "Score": 1, "Text": "Lastly, I review the unanswered questions ever now and then, but not aware of any that I'm in the position to answer. That said, on one of the questions you [publicly suggested be closed](http://startups.stackexchange.com/questions/5254/is-sending-mass-emails-and-social-media-posts-with-bots-a-viable-strategy-to-acq#comment5150_5254), your [prior comments on the answer appears to state you have an answer](http://startups.stackexchange.com/questions/3177/how-to-increase-the-accuracy-precision-of-customer-development-questions#comment4964_3177), which is a bit puzzling.", "CreationDate": "2015-05-12T23:04:28.783", "UserId": 551}
{"Id": 1690, "PostId": 257, "Score": 1, "Text": "If you disagree, vote to keep open. It's really that simple. And yes, I do have an answer to that one, and you're welcome to hire me if you want an executive summary of the book.", "CreationDate": "2015-05-12T23:06:41.117", "UserId": 1824}
{"Id": 1691, "PostId": 257, "Score": 0, "Text": "On a side note, thank you for responding to my request for comment on this. Realize that we don't agree about everything, but as you know, I do value everything you're doing, regardless of specific disagreements.", "CreationDate": "2015-05-12T23:18:29.943", "UserId": 551}
{"Id": 1692, "PostId": 257, "Score": 0, "Text": "Just out of curiosity, is there a reason you waited until now to close these? I think that's the main source of surprise for other users (cc @blunders). Not so much \"I don't think these should be closed!\" as that many are several months old, and typically people VTC when the question is first asked. Certainly, as you said, you can do whatever you would like with your votes, but again, I'm just curious.", "CreationDate": "2015-05-14T03:25:45.090", "UserId": 59}
{"Id": 1694, "PostId": 257, "Score": 1, "Text": "@MatthewHaugen - I had not read most of unanswered questions until recently. I'd normally go: meh, sucks, but who knows, might get answered. When you closed an arguably better question, however, I felt like shedding some light on the double-standard.", "CreationDate": "2015-05-14T09:51:21.013", "UserId": 1824}
{"Id": 1695, "PostId": 257, "Score": 1, "Text": "@DenisdeBernardy: I'd be the first to agree double-standards are unhealthy, but communication is the only cure in my opinion.  Votes are a very low-bandwidth form of commutation. For example, it's still [not exactly clear to me what filter/logic was used to close this question](http://startups.stackexchange.com/questions/4128/linear-measurement-vs-dimensional-weight-flat-rate-shipping#comment5182_4128) even though the reason is stated and there's a comment expanding on that reasoning too; might just be me though. (cc @MatthewHaugen)", "CreationDate": "2015-05-14T15:14:44.827", "UserId": 551}
{"Id": 1696, "PostId": 257, "Score": 2, "Text": "Lastly, still believe an unanswered question being unanswered for a extended duration is not a reason to close, but I would agree that it increases the odds long-term that the question would be reviewed again for closing, editing, answering, etc.; meaning that it's not surprising that this happened in bulk, just feel that when there's a pattern that requires a global response, that might be worth covering in meta first.", "CreationDate": "2015-05-14T15:17:46.213", "UserId": 551}
{"Id": 1699, "PostId": 260, "Score": 0, "Text": "What are examples of questions that you feel are missing good and/or numerous answers?", "CreationDate": "2015-06-02T14:25:21.347", "UserId": 551}
{"Id": 1698, "PostId": 261, "Score": 3, "Text": "I asked on SE and it's been absolutely eviscerated lol. Never mind eh!", "CreationDate": "2015-05-30T20:42:53.453", "UserId": 4468}
{"Id": 1705, "PostId": 264, "Score": 0, "Text": "For chat: Or maybe just talk about someone's startup. What they do, what difficulties they encountered, how they solved/plan to solve it, etc. I'd like to hear about this, but as I did not start a startup, I can't provide one as a topic.", "CreationDate": "2015-07-10T18:00:17.883", "UserId": 1630}
{"Id": 1706, "PostId": 265, "Score": 0, "Text": "I like the idea of sharing ideas. Maybe someone has an idea that they aren't able to implement, but could find a partner in chat", "CreationDate": "2015-07-22T01:15:10.713", "UserId": 9}
{"Id": 1707, "PostId": 265, "Score": 0, "Text": "Yes. And the other way round: some may look for people with more \"conceptual\" approach, seeing the bigger picture, having business know-how, marketing experience, knowledge on unfulfilled niches etc.", "CreationDate": "2015-07-22T09:06:51.763", "UserId": 5214}
{"Id": 1708, "PostId": 266, "Score": 4, "Text": "I'd vote for finding a better name for [tag:sell]. Maybe something along the lines of [tag:buy-out] or [tag:licensing]? The latter wouldn't work in its current form, but something to that effect might be appropriate.", "CreationDate": "2015-07-29T06:21:24.207", "UserId": 59}
{"Id": 1710, "PostId": 266, "Score": 0, "Text": "As there are no other opinions, I suggested an edit of the mentioned question to change its tag to [tag:buy-out]. Also, as I can not suggest tag synonyms, would one of you moderators please add [tag:sell] as a synonym to [tag:sales]?", "CreationDate": "2015-08-10T18:25:57.373", "UserId": 1630}
{"Id": 1711, "PostId": 270, "Score": 0, "Text": "No, Edit summary has different limitation - 10 chars IIRC.", "CreationDate": "2015-08-12T08:21:14.783", "UserId": 5467}
{"Id": 1712, "PostId": 271, "Score": 0, "Text": "Okay got it. Looks like all the complexities in this world are designed to prevent the bad actors and annoy the good ones :) Maybe I could then just give a comment asking the owner to change it.", "CreationDate": "2015-08-12T08:27:19.643", "UserId": 5467}
{"Id": 1713, "PostId": 271, "Score": 0, "Text": "As far as I know, tag changes do not count against the 6 character limit for text body changes. Neither do title changes, if I remember that correctly.", "CreationDate": "2015-08-13T07:53:27.403", "UserId": 1630}
{"Id": 1714, "PostId": 272, "Score": 1, "Text": "There's another side to this too. Some people add so much irrelevant information about their company that it begins to read like more of an advertisement than a question.", "CreationDate": "2015-08-21T16:20:41.260", "UserId": 9}
{"Id": 1715, "PostId": 275, "Score": 0, "Text": "Yes, it is completely relevant when it comes to discussing marketing and growth strategies for startups. But, the same, for bigger and established companies would be off-topic(I guess) in this community.\n\nSo, I wanted that site to be a universal discussion site for professionals hailing from companies of any size and domain.", "CreationDate": "2015-09-11T05:17:21.763", "UserId": 5834}
{"Id": 1716, "PostId": 277, "Score": 0, "Text": "I don't think there's much we can do about that, the same advice would apply to sending mail with user consent. The question is useful regardless of whether you're spamming.", "CreationDate": "2015-09-14T12:26:41.030", "UserId": 5892}
{"Id": 1717, "PostId": 277, "Score": 0, "Text": "@bjb568, that's true. But I don't think that a responsible answer would give the technical means of doing it without pointing out the negative consequences and the anti-social nature of doing it.", "CreationDate": "2015-09-14T13:50:38.697", "UserId": 1142}
{"Id": 1718, "PostId": 277, "Score": 0, "Text": "In terms of what is legal, Stack Exchange follows American law since it's an American company. That's why marijuana questions are not allowed on Gardening.SE despite being legal in some states and countries.", "CreationDate": "2015-09-15T00:48:38.053", "UserId": 9}
{"Id": 1719, "PostId": 277, "Score": 0, "Text": "@connor, I understand - although my understanding is that the U.S. also has anti-spam laws. But legality is not the only issue. Are we really \"making the internet a better place\" by helping spammers? IMO we should at the very least be pointing out what a disreputable business practice this is. I'm concerned that my comments doing just that were deleted as unwelcome.", "CreationDate": "2015-09-15T07:03:29.010", "UserId": 1142}
{"Id": 1720, "PostId": 277, "Score": 0, "Text": "@AE, I didn't mean to suggest that this particular to post was or was not legal. I'm not well versed enough in spam law to say. I just wanted to clarify that US law is the system that is followed here. If the post can be shown that it clearly violates US law than it will be removed.", "CreationDate": "2015-09-17T01:25:42.090", "UserId": 9}
{"Id": 1721, "PostId": 277, "Score": 1, "Text": "As for the ethical side, it is perfectly fine to ask about sketchy business practices. I would hope that answers would point out the negatives if there are any. As with other posts, voters are free to downvote posts they think are bad advice for the asker.", "CreationDate": "2015-09-17T01:28:01.093", "UserId": 9}
{"Id": 1722, "PostId": 277, "Score": 0, "Text": "We've had some issues on the site with comment chains degrading into personal arguments. I believe this chain was purged because we felt it was getting close to that point. Since the discussion was still on topic, I've restored the comments. Of course if the discussion does degrade, it will have to be cleaned up. I'm sorry about the confusion here.", "CreationDate": "2015-09-17T01:31:15.350", "UserId": 9}
{"Id": 1723, "PostId": 277, "Score": 0, "Text": "thanks @connor ....", "CreationDate": "2015-09-17T08:40:55.623", "UserId": 1142}
{"Id": 1735, "PostId": 277, "Score": 0, "Text": "Downvoting because this is a politically correct hand wringing question. Startups want to grow and sometimes grey areas are the best growth hacks for a startup. Bill Gates and Steve Jobs did not always worry about whether they were taking the high road. First priority for a company is to grow, while being legal. Treading on grey areas and \"frowned upon\" turf is OK imo.", "CreationDate": "2015-11-09T14:36:25.177", "UserId": 233}
{"Id": 1736, "PostId": 277, "Score": 0, "Text": "@a20 You're being rude. I'm not \"hand wringing\", and thinking that spam is a bad thing is not \"political correctness\".", "CreationDate": "2015-11-10T20:02:08.543", "UserId": 1142}
{"Id": 1737, "PostId": 277, "Score": 0, "Text": "@AE As long as it's legal, it's another tool in an entreprenuer's toolkit. Being a startup is risky and you have to take every advantage you can get.", "CreationDate": "2015-11-11T06:50:56.760", "UserId": 233}
{"Id": 1724, "PostId": 279, "Score": 0, "Text": "Denis, I think we're going to have to agree to disagree on a couple of points: \n1) Whether 5,000 constitutes 'bulk',\n2) Whether personalising unsolicited bulk emails overrides the necessity of getting consent,\n3) Whether the fact that people do it every day makes it ok,\n4) Whether spam email is legal in all jurisdictions; I've repeatedly cited the particular law which makes the practise you describe above illegal here in the UK, and don't see much point in repeating myself again; if you want to ignore the law then that's up to you - if you're outside the UK then it's irrelevant to you anyway.", "CreationDate": "2015-09-17T08:46:04.190", "UserId": 1142}
{"Id": 1725, "PostId": 279, "Score": 1, "Text": "A lawyer's analysis of the relevant law: http://www.lawdonut.co.uk/law/sales-and-marketing/marketing-and-advertising/your-email-marketing-and-anti-spam-law Basically, B2B 'cold email' can be legal (\"You can ‘cold email’ an unsolicited, direct marketing email to a corporate subscriber, but be careful.\") but B2C is not (\"This is permitted if the email is work-related (eg promoting office furniture to a facilities manager) but not if it is personal (eg promoting family holidays to the sales team at a recruitment company).\").", "CreationDate": "2015-09-17T08:50:18.523", "UserId": 1142}
{"Id": 1726, "PostId": 279, "Score": 0, "Text": "@AE: \"B2B 'cold email' can be legal\" - see? You're now writing it yourself. :)", "CreationDate": "2015-09-17T10:47:33.000", "UserId": 1824}
{"Id": 1739, "PostId": 283, "Score": 0, "Text": "that makes perfect sense, thanks. Futher on, I'll spend a while around help pages :)", "CreationDate": "2015-11-17T12:34:54.210", "UserId": 6184}
{"Id": 1740, "PostId": 288, "Score": 0, "Text": "Maybe if you worded it as type of skill and where you might be able to find it.", "CreationDate": "2015-12-22T18:52:09.980", "UserId": 5232}
{"Id": 1741, "PostId": 288, "Score": 0, "Text": "Possible duplicate: http://startups.stackexchange.com/questions/3864/where-can-we-find-developers-who-want-to-join-our-startup-for-equity/3865#3865", "CreationDate": "2015-12-22T20:14:56.403", "UserId": 3396}
{"Id": 1742, "PostId": 288, "Score": 0, "Text": "I moved this to Meta, our site for questions *about* [startups.se], as it sounds like a question more about our policies than starting a startup. Mustaccio's linked question might help you resolve the root of your problem, though.", "CreationDate": "2015-12-22T20:45:22.440", "UserId": 59}
{"Id": 1744, "PostId": 300, "Score": 1, "Text": "Related: [Should we encourage all questions to include their location?](/q/4/59) Definitely not a duplicate or anything, just useful for some context.", "CreationDate": "2016-03-18T16:31:15.493", "UserId": 59}
{"Id": 1745, "PostId": 300, "Score": 1, "Text": "Having a prompt to remind users to enter the tag could be useful. I don't remember which, but I believe one of the sites in the network has something similar already. I don't think it should be a dialog or popup, nor should it be a totally separate field, but just a yellow box on the ask question page that suggests it could be a nice, passive way to remind new users, without getting in the way of anyone to whom it doesn't apply.", "CreationDate": "2016-03-18T16:33:38.690", "UserId": 59}
{"Id": 1746, "PostId": 303, "Score": 1, "Text": "I like the appearance of this, but we got feedback last time from a Community Manager (SE employee) suggesting that we shy away from \".se\" notation. Could you fit in the full \"Startups Stack Exchange\" name here? I know it won't be as pretty, but it'll hit a wider audience of users who may not know \".se\" means \".stackexchange.com\"", "CreationDate": "2016-04-13T08:25:24.340", "UserId": 59}
{"Id": 1755, "PostId": 307, "Score": 0, "Text": "Maybe call it \"Business Management\"", "CreationDate": "2016-07-18T09:54:52.713", "UserDisplayName": "user9022"}
{"Id": 1756, "PostId": 307, "Score": 0, "Text": "@TomDworzanski That'd discourage people from asking startup-related doubts, thinking this site is strictly for MBA students!  Maybe `startups and business`?", "CreationDate": "2016-07-29T06:16:56.000", "UserId": 5834}
{"Id": 1757, "PostId": 307, "Score": 1, "Text": "You're probably right. It's so hard to name things.", "CreationDate": "2016-07-29T21:16:56.910", "UserDisplayName": "user9022"}
{"Id": 1758, "PostId": 307, "Score": 0, "Text": "Just want to point out there is an Area 51 proposal for [Business Owners](http://area51.stackexchange.com/proposals/97241/business-owners) with a bit of traction but not enough to take off at this point.", "CreationDate": "2016-08-10T01:14:24.227", "UserDisplayName": "user9022"}
{"Id": 1763, "PostId": 307, "Score": 0, "Text": "The good news is, after almost a week, there are still 70 people watching this SE's meta. That's a surprisingly high number considering how inactive it has been in the past year or so. Oh wait, this was _asked_ over a year ago. :-|", "CreationDate": "2017-07-14T18:57:16.600", "UserId": 1824}
{"Id": 1752, "PostId": 309, "Score": 1, "Text": "Thank you! I've been with startups since Area 51 and I look forward to helping it continue to grow.", "CreationDate": "2016-06-28T20:18:35.397", "UserId": 43}
{"Id": 1753, "PostId": 309, "Score": 1, "Text": "@jdero Oops! I meant `Welcome to the mods list of the site`. I have a crappy English.  Anyways, good luck and godspeed :)", "CreationDate": "2016-06-29T01:03:24.147", "UserId": 5834}
{"Id": 1754, "PostId": 314, "Score": 0, "Text": "\"If a bad programming question is posted here, there's no sense in sending it Stack Overflow. They have plenty of those already.\" - I wasn't aware they had anything _but_, of late. :D", "CreationDate": "2016-07-07T10:46:14.017", "UserId": 1824}
{"Id": 1762, "PostId": 328, "Score": 0, "Text": "Come join me in chat, I just pinged you to a room I made over on GDSE (I'm a mod over there) -- https://chat.stackexchange.com/rooms/61299/marketing-proposal", "CreationDate": "2017-07-08T11:31:46.473", "UserId": 1241}
{"Id": 1779, "PostId": 328, "Score": 1, "Text": "Looks like this might be needed after all. :D", "CreationDate": "2017-12-07T19:50:45.617", "UserId": 1824}
{"Id": 1764, "PostId": 332, "Score": 2, "Text": "Thanks for starting this discussion Denis. I've marked it as featured so it shows up on the main site. I don't think many folks browse the meta.", "CreationDate": "2017-08-24T02:08:35.523", "UserId": 9}
{"Id": 1765, "PostId": 332, "Score": 0, "Text": "I think the idea behind the featured topics was quality out of quantity, but special topic questions ended up being worse on average. I think it's worked on other sites though, so I'm open to trying it again with tweaks.", "CreationDate": "2017-08-24T02:10:49.557", "UserId": 9}
{"Id": 1767, "PostId": 332, "Score": 0, "Text": "For what (little, extremely little) it's worth, I do think monthly topics increased the volume of good questions. They just also proportionately (or more) increased the volume of bad ones. But if we had a good metric by which to judge a \"bad\" question (since I don't think the only problem here is what's on- or off-topic for the site), we might be able to slow, or at least kill, the latter. Not sure where exactly I'm going with this, except that I agree with @connor: I'm open to trying improvements.", "CreationDate": "2017-08-24T04:47:34.343", "UserId": 59}
{"Id": 1768, "PostId": 332, "Score": 0, "Text": "@MatthewHaugen: I've honestly no idea how well it worked, but I vividly recollect a period where we were getting swamped by _terrible_ product market fit and pivoting questions. :D Also, I seem to remember the questions lacked depth. By this I mean you could usually feel they weren't genuine; they lacked that screaming cry for help touch that makes some of the better questions instantly picture what the asker is going through.", "CreationDate": "2017-08-24T07:12:33.760", "UserId": 1824}
{"Id": 1766, "PostId": 333, "Score": 2, "Text": "I think this could have the dual benefit of improving quantity and refining our scope as we add to it.", "CreationDate": "2017-08-24T02:19:08.570", "UserId": 9}
{"Id": 1770, "PostId": 345, "Score": 4, "Text": "Well, shoot. I really liked that community. There were some knowledgeable members (such as Denis De Bernardy) who helped me as I fumbled through building startups. I'll miss it.", "CreationDate": "2017-11-30T21:00:45.517", "UserId": 3743}
{"Id": 1778, "PostId": 345, "Score": 3, "Text": "sad to hear this. I just joined this community.", "CreationDate": "2017-12-06T15:03:58.963", "UserId": 15521}
{"Id": 1780, "PostId": 345, "Score": 0, "Text": "What's going to happen the chat rooms for this site? Are they part of the data dump?", "CreationDate": "2017-12-07T22:57:15.957", "UserId": 9}
{"Id": 1782, "PostId": 345, "Score": 0, "Text": "@connor The rooms **may** still be accessible but there will not be connected to a site so you will need to know the room's name/ID. (PS: I have seen before some closed beta sites main chatroom still open for messages/unfrozen even after the site being closed for years.)", "CreationDate": "2017-12-08T13:27:39.497", "UserId": 12083}
{"Id": 1783, "PostId": 345, "Score": 0, "Text": "Out of curiosity, what happens to the reputation that high reppers have gained here?  Will it still contribute to their network reputation?  It seems to me it ought to, since a user (like jdero, for instance) could have more rep on here than the rest of the network sites, so it could make them look like they have a lot less experience on SE than they actually do.", "CreationDate": "2017-12-08T14:42:00.900", "UserId": 15535}
{"Id": 1790, "PostId": 345, "Score": 0, "Text": "So good things die so that other, better things can live.", "CreationDate": "2017-12-11T15:44:02.377", "UserId": 13085}
{"Id": 1771, "PostId": 346, "Score": 3, "Text": "Congratulations on the baby, Denis! I've learned a lot of from your answers the past few years, and I'll miss them. I agree that being more proactive would have helped a great deal. Nick left the site in 2015 and wasn't replaced for a year. For some reason, his diamond was never removed.", "CreationDate": "2017-12-02T00:45:07.430", "UserId": 9}
{"Id": 1772, "PostId": 346, "Score": 2, "Text": "Perhaps I should have guessed from your reviewing and flagging, but I wish I'd known you were willing to take on moderating. I announced I'd be stepping down a few months, but for several months before that, I wasn't able to contribute as much to the site as I'd like. The main reason is I didn't resign earlier is because I didn't know if there was anyone else who would step up in my place. I think it would have been helpful to re-post the nomination thread when it ran out of nominations instead of waiting until we needed a candidate.", "CreationDate": "2017-12-02T00:52:15.393", "UserId": 9}
{"Id": 1773, "PostId": 346, "Score": 0, "Text": "Chat and Meta becoming ghost towns is not particularly problematic. We have quite a few sites on the network that get very little to no consistent activity on either of those platforms but are still able to successfully run. The major problem here is the lack of community moderation, and a build-up of very low quality content and even spam on the main site. Lack of Meta participation only reinforces the conclusion that the site is lacking the necessary interest to moderate and maintain.", "CreationDate": "2017-12-04T15:44:53.673", "UserId": 4083}
{"Id": 1775, "PostId": 346, "Score": 1, "Text": "@animuson: Back when I was very active until last month the community seemed pretty quick to get rid of spam. All it took was one flag for experienced users who don't read all questions to pile on and rid the site of spammy content. The real issue IMO was what I complained about in the chat over 2 months ago: https://chat.stackexchange.com/rooms/16081/the-incubator - If you go through my list of flags, untold numbers of them never made it to a moderator. Which, to me, means you're closing a site because lack of community flagging, whereas the actual problem is lack of mods reading them.", "CreationDate": "2017-12-04T18:03:06.703", "UserId": 1824}
{"Id": 1776, "PostId": 346, "Score": 2, "Text": "(And to reiterate, I'd happily step in as a mod at the side of a few other long timers if not closing the site is still an option. The only thing is, I can't commit to be on here multiple times per day, due to parental duties.)", "CreationDate": "2017-12-04T18:04:03.040", "UserId": 1824}
{"Id": 1777, "PostId": 346, "Score": 3, "Text": "@Denis As I explained on SmallChess' post, this is a *community moderated* site. The community itself can destroy spam with 6 spam flags, just as it can close a question with 5 close votes. Sure, a moderator can do that with a single button press, but that's not what diamond moderators exist for. The regular users should be doing as much of this moderation as possible, with moderators stepping in as little as possible to handle the edge cases. Depending entirely on a moderator to do *all of the work* is a sign of a failing community - especially when that moderator inevitably burns out.", "CreationDate": "2017-12-04T18:41:47.797", "UserId": 4083}
{"Id": 1784, "PostId": 346, "Score": 1, "Text": "@DenisdeBernardy Congratulations on your new child! I was hoping we could stay in touch, so I emailed you at your mesoconcepts sites. I understand you're busy (and happy ... and sleep-deprived...!) so just reply whenever you have a few minutes. Thanks!", "CreationDate": "2017-12-08T21:33:12.133", "UserId": 3743}
{"Id": 1774, "PostId": 347, "Score": 4, "Text": "\"Our mods should have done something\" is exactly the kind of thinking that dooms a site to failure. A site should *not* be dependent on the moderators doing all of the clean-up work and decision making. It should be dependent on its users doing the majority of the work and moderators only stepping in to handle edge cases. But those users don't seem to exist here - either they just don't want to do it or they've all left. Aside: Nick was actually replaced a while ago, but for some reason was just never removed as moderator.", "CreationDate": "2017-12-04T15:52:16.857", "UserId": 4083}
{"Id": 1786, "PostId": 348, "Score": 0, "Text": "Thank you for moderating. I wanted to comment on your second paragraph. I'm not sure my approach is aligned with Stack Exchange's intent, but I personally like those low-level questions that all sound the same. For example, today a new user said they didn't see many people each day, and the people they see didn't have many problems, so they couldn't identify problems that needed solving in order to create businesses. I love offering advice to people like that! In my mind, those entrepreneurs develop, and later they can help and encourage other newbies.", "CreationDate": "2017-12-08T21:43:28.487", "UserId": 3743}
{"Id": 1787, "PostId": 348, "Score": 0, "Text": "I suppose what I meant is that the I didn't see those low level questions that are similar to each other popping up relative to how frequent they were in the community's early days, even if they were repetitive. I'm all for answering unique questions, but a lot of what I was seeing in terms of new questions was oriented towards spam. In any matter, it's a bit late to discuss a remedy for the problem. Best wishes to everyone!", "CreationDate": "2017-12-10T02:08:10.823", "UserId": 43}
{"Id": 1785, "PostId": 350, "Score": 1, "Text": "Thanks! Followed!", "CreationDate": "2017-12-08T21:37:46.373", "UserId": 3743}
{"Id": 1788, "PostId": 350, "Score": 1, "Text": "Could you make the link https? Scary to log in on the http version ;)", "CreationDate": "2017-12-11T12:15:20.457", "UserId": 12265}
{"Id": 1789, "PostId": 350, "Score": 0, "Text": "@DonQuiKong done", "CreationDate": "2017-12-11T12:36:49.043", "UserId": 1241}
